{
  "content": "Diagnosis:\tRight temporal lobe glioblastoma WHO grade 4\n\t\tIDH-wildtype, MGMT promoter methylated\n\t\tDiagnosed following seizure January 2025\n\nManagement:\tDebulking surgery 15.01.2025\n\t\tCompleted concurrent chemoradiotherapy with temozolomide\n\t\t(60Gy in 30 fractions) March 2025\n\t\tCommenced adjuvant temozolomide 150mg/m2 D1-5 q28 days\n\nCurrent Situation:\tDay 15 cycle 3 adjuvant temozolomide\n\nI reviewed [redacted name] today in the neuro-oncology clinic for assessment during cycle 3 of adjuvant temozolomide. His recent MRI brain on 15.05.2025 shows post-treatment changes with minimal residual enhancement and no clear evidence of disease progression. There is reduction in surrounding FLAIR signal abnormality compared to post-radiotherapy imaging.\n\nHe developed grade 3 thrombocytopenia (platelets 47) following cycle 2, necessitating a one-week treatment delay and subsequent dose reduction to 125mg/m2. Current cycle has been better tolerated with grade 1 nausea controlled by delayed-release ondansetron. He reports persistent grade 2 fatigue but is gradually increasing his daily activities.\n\nOn examination today, his performance status is 1. Neurological examination shows stable mild right-sided facial weakness and occasional word-finding difficulty. His platelet count has recovered to 156, and other blood parameters are satisfactory.\n\nThe plan is to proceed with cycle 4 temozolomide at the reduced dose of 125mg/m2 D1-5. We will maintain close monitoring of blood counts with weekly checks. Next MRI brain is scheduled prior to cycle 5. Review arranged in clinic in 4 weeks with imaging results.",
  "output": {
    "primary_cancer": {
      "site": "brain, right temporal lobe",
      "year": 2025,
      "month": 1,
      "histopathology_status": "WHO grade 4",
      "biomarker_status": "IDH-wildtype, MGMT promoter methylated",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Diagnosed following seizure",
          "year": 2025,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Debulking surgery",
          "year": 2025,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Completed concurrent chemoradiotherapy with temozolomide (60Gy in 30 fractions)",
          "year": 2025,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced adjuvant temozolomide 150mg/m2 D1-5 q28 days",
          "year": 2025,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Dose reduction to 125mg/m2 due to grade 3 thrombocytopenia",
          "year": 2025,
          "month": 5
        },
        {
          "type": "investigation_finding",
          "value": "MRI brain shows post-treatment changes with minimal residual enhancement and no clear evidence of disease progression, reduction in surrounding FLAIR signal abnormality",
          "year": 2025,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "performance status is 1"
      },
      {
        "type": "examination_finding",
        "value": "stable mild right-sided facial weakness and occasional word-finding difficulty"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 fatigue but gradually increasing daily activities"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Glioblastoma on adjuvant temozolomide with recent dose reduction due to thrombocytopenia. Latest MRI shows stable disease with improving FLAIR changes, proceeding with cycle 4 at reduced dose with close monitoring."
      },
      {
        "type": "latest_treatment_response",
        "value": "minimal residual enhancement and no clear evidence of disease progression, reduction in surrounding FLAIR signal abnormality"
      },
      {
        "type": "update_to_treatment",
        "value": "proceed with cycle 4 temozolomide at the reduced dose of 125mg/m2 D1-5"
      },
      {
        "type": "planned_investigation",
        "value": "Next MRI brain scheduled prior to cycle 5"
      },
      {
        "type": "follow_up_referral",
        "value": "Review arranged in clinic in 4 weeks with imaging results"
      }
    ]
  }
}