{
    "content": "Diagnosis:\tMetastatic breast cancer with bone-only disease - pending histological confirmation\n\nBackground:\tLeft breast cancer 2015 - treated at [redacted name] Hospital with breast conserving surgery and sentinel lymph node biopsy, Grade 2, 0/15 lymph nodes\n\tCompleted adjuvant radiotherapy and attempted hormone therapy (discontinued after 8 months due to intolerance)\n\nCurrent situation:\tNew referral for consideration of bone biopsy, palliative radiotherapy, and systemic therapy including bisphosphonates\n\nI reviewed [redacted name] in clinic today. She presented initially in 2015 with a left-sided breast cancer, treated with breast conserving surgery and sentinel node biopsy. Histology showed a Grade 2 invasive ductal carcinoma, oestrogen receptor positive, HER2 negative, with clear margins and 0/15 nodes involved. She completed adjuvant radiotherapy but unfortunately experienced significant difficulties with endocrine therapy. Initially commenced on anastrozole, this was discontinued after 3 months due to severe arthralgia. A switch to tamoxifen resulted in intolerable hot flushes and cognitive symptoms. Despite attempting exemestane as a third option, she ultimately discontinued all hormone therapy after 8 months due to persistent side effects.\n\nShe presented to her GP in September 2023 with progressive right hip pain, initially attributed to osteoarthritis. The pain gradually worsened despite conservative management, and by December 2023 had become severe enough to affect mobility. An MRI performed on 15th January 2024 revealed a suspicious lesion in the right acetabulum. Subsequent bone scan on 1st February 2024 demonstrated additional areas of uptake in the T12 vertebra and left ilium. CT staging on 20th February 2024 confirmed the bone lesions and showed no evidence of visceral metastases.\n\nHer current symptoms include right hip pain, rated 7/10 in severity, worse on weight-bearing, and mid-thoracic back discomfort. She reports gradual weight loss of 4kg over 3 months and increasing fatigue. Her past medical history includes hypothyroidism, migraine, and osteoporosis. She has documented allergies to clarithromycin (rash) and contrast media (bronchospasm).\n\nCurrent medications include levothyroxine 100mcg daily, sumatriptan as required, alendronic acid weekly, and regular paracetamol and tramadol for pain control.\n\n[redacted name] lives independently. She maintains an active lifestyle despite her symptoms and continues her work as a part-time consultant.\n\nOn examination today, her performance status is 2. She has tenderness over T12 vertebra and right hip, with limited hip rotation due to pain. Neurological examination is intact, and there is no evidence of cord compression. Systemic examination is otherwise unremarkable.\n\nI have discussed the findings with [redacted name] today. While the clinical picture is highly suggestive of metastatic breast cancer, we recommend proceeding with a bone biopsy to confirm diagnosis and determine current receptor status. We have explained that bone biopsies can sometimes be technically challenging and may occasionally yield false negative results for hormone receptor status.\n\nGiven her relatively brief exposure to adjuvant endocrine therapy, we anticipate a good response to systemic treatment. We will arrange urgent blood tests including tumour markers, bone profile, vitamin D, and coagulation screen. A bone biopsy will be scheduled within the next 2 weeks.\n\nWe have made a referral to Clinical Oncology for consideration of palliative radiotherapy to the right hip. She will require dental assessment prior to commencing bisphosphonate therapy. We have also provided information about our current bone metastases imaging study.\n\nWe will review her again in clinic in 2 weeks with all results and following MDT discussion.",
    "output": {
        "primary_cancer": {
            "site": "breast, left",
            "year": 2015,
            "metastases": "bone metastases in right acetabulum, T12 vertebra, and left ilium",
            "histopathology_status": "Grade 2 invasive ductal carcinoma",
            "biomarker_status": "oestrogen receptor positive, HER2 negative",
            "cancer_timeline": [
                {
                    "type": "treatment_surgery",
                    "value": "breast conserving surgery and sentinel lymph node biopsy - 0/15 nodes negative",
                    "year": 2015
                },
                {
                    "type": "treatment_radiotherapy",
                    "value": "Completed adjuvant radiotherapy",
                    "year": 2015
                },
                {
                    "type": "treatment_systemic_start",
                    "value": "Started on anastrozole",
                    "year": 2015
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Switched from anastrozole to tamoxifen due to severe arthralgia",
                    "year": 2015
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Switched from tamoxifen to exemestane due to hot flushes and cognitive symptoms",
                    "year": 2015
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Discontinued all hormone therapy after 8 months due to persistent side effects",
                    "year": 2016
                },
                {
                    "type": "other_progress_or_event",
                    "value": "Presented with progressive right hip pain",
                    "year": 2023,
                    "month": 9
                },
                {
                    "type": "anatomical_finding",
                    "value": "MRI shows suspicious lesion in right acetabulum",
                    "year": 2024,
                    "month": 1
                },
                {
                    "type": "anatomical_finding",
                    "value": "Bone scan shows additional uptake in T12 vertebra and left ilium",
                    "year": 2024,
                    "month": 2
                },
                {
                    "type": "anatomical_finding",
                    "value": "CT staging confirms bone lesions with no visceral metastases",
                    "year": 2024,
                    "month": 2
                }
            ]
        },
        "patient_facts": [
            {
                "type": "performance_status",
                "value": "Performance status 2"
            },
            {
                "type": "current_symptom",
                "value": "Right hip pain rated 7/10, worse on weight-bearing"
            },
            {
                "type": "current_symptom",
                "value": "Mid-thoracic back discomfort"
            },
            {
                "type": "current_symptom",
                "value": "Weight loss of 4kg over 3 months"
            },
            {
                "type": "current_symptom",
                "value": "Increasing fatigue"
            },
            {
                "type": "examination_finding",
                "value": "Tenderness over T12 vertebra and right hip, with limited hip rotation due to pain"
            },
            {
                "type": "comorbidity",
                "value": "Hypothyroidism"
            },
            {
                "type": "comorbidity",
                "value": "Migraine"
            },
            {
                "type": "comorbidity",
                "value": "Osteoporosis"
            }
        ],
        "status_updates": [
            {
                "type": "clinical_summary",
                "value": "Early breast cancer from 2015 with limited endocrine therapy exposure due to intolerance, now presenting with suspected bone-only metastatic disease. Current consultation shows symptomatic bone lesions with PS2, requiring urgent tissue confirmation and multimodal palliative management including local radiotherapy."
            },
            {
                "type": "planned_investigation",
                "value": "Arrange urgent blood tests including tumour markers, bone profile, vitamin D, and coagulation screen"
            },
            {
                "type": "planned_investigation",
                "value": "Schedule bone biopsy within next 2 weeks"
            },
            {
                "type": "planned_investigation",
                "value": "dental assessment prior to commencing bisphosphonate therapy"
            },
            {
                "type": "follow_up_referral",
                "value": "Referral made to Clinical Oncology for consideration of palliative radiotherapy to right hip"
            },
            {
                "type": "follow_up_referral",
                "value": "Review in clinic in 2 weeks with results and following MDT discussion"
            }
        ]
    }
}