{
    "content": "Diagnosis:\t\tEndometrial carcinoma\n\nManagement:\t\tTotal abdominal hysterectomy and bilateral salpingo-oophorectomy March 2023\n\t\tAdjuvant carboplatin/paclitaxel chemotherapy completed September 2023\n\nHistology:\t\tGrade 2 endometrioid adenocarcinoma, FIGO Stage IIIA\n\t\tpT3aN0M0, lymphovascular space invasion present\n\nCurrent Situation:\tSurveillance review\n\nI reviewed [redacted name] today for her first three-monthly surveillance appointment following completion of adjuvant chemotherapy for stage IIIA endometrial cancer. She has made an excellent recovery since completing treatment and reports continuing improvement in her energy levels and general wellbeing. Her appetite has returned to normal and she has regained 3kg of weight. She has now returned to her regular swimming sessions twice weekly and is managing household activities independently.\n\nShe reports complete resolution of her previous chemotherapy-related peripheral neuropathy. No concerning symptoms reported. She denies any pelvic pain, vaginal bleeding, or new respiratory symptoms. Clinical examination today was unremarkable with well-healed surgical scars and no concerning findings.\n\nHer latest CT scan from January 2024 shows no evidence of disease recurrence, and her CA125 has remained stable at 12. I have explained our surveillance plan, which will involve three-monthly clinical reviews for the first two years with six-monthly CT imaging. I have arranged her next CT scan for July 2024 and will see her again in clinic in three months' time with the results.",
    "output": {
        "primary_cancer": {
            "site": "endometrium",
            "year": 2023,
            "month": 3,
            "tnm_stage": "pT3aN0M0",
            "other_stage": "FIGO Stage IIIA",
            "histopathology_status": "Grade 2 endometrioid adenocarcinoma, lymphovascular space invasion present",
            "cancer_timeline": [
                {
                    "type": "treatment_surgery",
                    "value": "Total abdominal hysterectomy and bilateral salpingo-oophorectomy",
                    "year": 2023,
                    "month": 3
                },
                {
                    "type": "treatment_systemic_start",
                    "value": "Started adjuvant carboplatin/paclitaxel chemotherapy",
                    "year": 2023,
                    "month": 3
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Completed adjuvant carboplatin/paclitaxel chemotherapy",
                    "year": 2023,
                    "month": 9
                },
                {
                    "type": "laboratory_finding",
                    "value": "CA125 stable at 12",
                    "year": 2024,
                    "month": 1
                },
                {
                    "type": "anatomical_finding",
                    "value": "CT scan shows no evidence of disease recurrence",
                    "year": 2024,
                    "month": 1
                }
            ]
        },
        "patient_facts": [
            {
                "type": "quality_of_life_finding",
                "value": "Returned to regular swimming sessions twice weekly and managing household activities independently"
            },
            {
                "type": "examination_finding",
                "value": "Well-healed surgical scars and no concerning findings"
            },
            {
                "type": "investigation_finding",
                "value": "CT January 2024 shows no evidence of disease recurrence, CA125 stable at 12"
            }
        ],
        "status_updates": [
            {
                "type": "clinical_summary",
                "value": "Stage IIIA endometrial cancer post surgery and adjuvant chemotherapy. Now in surveillance with no evidence of disease and improving functional status"
            },
            {
                "type": "latest_treatment_toxicity",
                "value": "Complete resolution of previous chemotherapy-related peripheral neuropathy"
            },
            {
                "type": "updated_patient_functional_status",
                "value": "Excellent recovery with improved energy levels, normal appetite, and weight gain of 3kg"
            },
            {
                "type": "planned_investigation",
                "value": "CT scan arranged for July 2024"
            },
            {
                "type": "follow_up_referral",
                "value": "Three-monthly clinical reviews planned with next review in 3 months with CT results"
            }
        ]
    }
}