{
    "content": "Diagnosis:\tEndometrial adenocarcinoma, FIGO Stage IIIC1\n\nInitial staging MRI pelvis 12 March 2024 showed bulky endometrial tumor with cervical stromal invasion and pelvic nodal disease. CT staging confirmed left external iliac node measuring 18mm but no distant metastases. Endometrial biopsy showed grade 2 endometrioid adenocarcinoma, MMR proficient.\n\nCurrent Situation:\tWeek 4 of concurrent chemoradiotherapy\n\nI reviewed [redacted name] today who is currently receiving concurrent chemoradiotherapy with weekly cisplatin. She has completed 4 weeks of external beam radiotherapy (prescribed dose 45Gy in 25 fractions) with concurrent weekly cisplatin 40mg/m2. Treatment has been relatively well tolerated with grade 1 nausea managed with regular ondansetron, and mild radiation proctitis responding to local measures. Her main challenge has been fatigue, though she continues to maintain good mobility and independence at home.\n\nClinical examination shows good performance status (ECOG PS 1). Recent blood tests show stable renal function with creatinine 85, though magnesium has dropped to 0.65 requiring supplementation. CT performed last week for treatment planning shows partial response with reduction in primary tumor volume and decrease in left external iliac node to 12mm.\n\nThe plan is to proceed with week 5 cisplatin and radiotherapy today. We will arrange MRI pelvis after completion of treatment to assess response. Follow-up appointment will be scheduled in 3 weeks with full blood count, renal function, and magnesium level check prior to review.",
    "output": {
        "primary_cancer": {
            "site": "endometrium",
            "year": 2024,
            "month": 3,
            "metastases": "left external iliac nodal disease",
            "other_stage": "FIGO Stage IIIC1",
            "histopathology_status": "grade 2 endometrioid adenocarcinoma",
            "biomarker_status": "MMR proficient",
            "cancer_timeline": [
                {
                    "type": "anatomical_finding",
                    "value": "MRI pelvis shows bulky endometrial tumor with cervical stromal invasion and pelvic nodal disease",
                    "year": 2024,
                    "month": 3
                },
                {
                    "type": "anatomical_finding",
                    "value": "CT staging confirms left external iliac node measuring 18mm, no distant metastases",
                    "year": 2024,
                    "month": 3
                },
                {
                    "type": "treatment_systemic_start",
                    "value": "Started concurrent chemoradiotherapy with weekly cisplatin 40mg/m2",
                    "year": 2024,
                    "month": 3
                },
                {
                    "type": "anatomical_finding",
                    "value": "CT shows partial response with reduction in primary tumor volume and decrease in left external iliac node to 12mm",
                    "year": 2024,
                    "month": 4
                }
            ]
        },
        "patient_facts": [
            {
                "type": "performance_status",
                "value": "ECOG PS 1"
            },
            {
                "type": "current_symptom",
                "value": "grade 1 nausea managed with regular ondansetron"
            },
            {
                "type": "current_symptom",
                "value": "mild radiation proctitis responding to local measures"
            },
            {
                "type": "current_symptom",
                "value": "fatigue but maintaining good mobility and independence"
            },
            {
                "type": "investigation_finding",
                "value": "stable renal function with creatinine 85, magnesium dropped to 0.65"
            }
        ],
        "status_updates": [
            {
                "type": "clinical_summary",
                "value": "Stage IIIC1 endometrial cancer receiving concurrent chemoradiotherapy with good partial response and manageable toxicities"
            },
            {
                "type": "latest_treatment_response",
                "value": "Partial response with reduction in primary tumor volume and decrease in left external iliac node from 18mm to 12mm"
            },
            {
                "type": "latest_treatment_toxicity",
                "value": "Grade 1 nausea, mild radiation proctitis, and low magnesium requiring supplementation"
            },
            {
                "type": "update_to_treatment",
                "value": "Continuing with week 5 cisplatin and radiotherapy"
            },
            {
                "type": "planned_investigation",
                "value": "MRI pelvis after completion of treatment to assess response"
            },
            {
                "type": "follow_up_referral",
                "value": "Follow-up appointment in 3 weeks with blood tests"
            }
        ]
    }
}