{
    "content": "Diagnosis:\n\nJuly 2019 Stage IV adenocarcinoma, confirmed on thoracoscopic pleural biopsy\n\n\n\n(PDL1 negative, KRAS G12C wild type)\n\nTreatment History:\nSeptember 2019 Enrolled in ATLAS-456 trial (durvalumab/platinum doublet \n\n\ncombination).  Experienced grade 3 pneumonitis after first cycle.  Withdrawn from trial, \n\n\ntransitioned to standard cisplatin/pemetrexed regimen.\n\n\nOctober to December 2019 completed additional 3 cycles cisplatin/pemetrexed.  Achieved partial response on interval imaging.\n\n[] attended clinic following completion of 4 cycles systemic therapy, with 3 cycles of standard cisplatin/pemetrexed after initial trial treatment.  Following cycle 4, she required admission to [] Hospital with significant toxicity.  Primary issues included grade 3 mucositis, grade 2 thrombocytopenia with epistaxis, profound fatigue, and grade 2 peripheral neuropathy affecting upper and lower limbs.  Hospital documentation indicates pancytopenia with neutrophils 0.8.  Since discharge, marked improvement in clinical status with return to baseline function.  She has engaged with psycho-oncology services for management of treatment-related anxiety.\n\nFollowing previous review, lower limb duplex ultrasound excluded suspected DVT.  Current performance status 1.  Weight recorded at 72kg.  Clinical examination demonstrates reduced breath sounds at right base with dull percussion note.  Post-treatment CT imaging shows partial resolution of pleural disease compared to baseline, meeting RECIST criteria for partial response.  Overall disease status remains controlled.\n\nGiven cumulative toxicity profile, decision made to discontinue systemic therapy after 4 cycles.  Have discussed potential enrollment in phase II maintenance therapy study evaluating novel TKI versus standard observation.  Patient provided with trial information and will return next week for formal consent process.  Additional molecular analysis planned including NRG1 fusion testing and comprehensive next-generation sequencing panel.",
    "output": {
        "primary_cancer": {
            "site": "lung",
            "year": 2019,
            "month": 7,
            "histopathology_status": "adenocarcinoma",
            "tnm_stage": "Stage IV",
            "biomarker_status": "PDL1 negative, KRAS G12C wild type",
            "cancer_timeline": [
                {
                    "type": "clinical_trial_update",
                    "value": "Enrolled in ATLAS-456 trial (durvalumab/platinum doublet combination)",
                    "year": 2019,
                    "month": 9
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Withdrawn from trial due to grade 3 pneumonitis after first cycle",
                    "year": 2019,
                    "month": 9
                },
                {
                    "type": "treatment_systemic_start",
                    "value": "Started standard cisplatin/pemetrexed regimen",
                    "year": 2019,
                    "month": 9
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Completed additional 3 cycles cisplatin/pemetrexed",
                    "year": 2019,
                    "month": 12
                },
                {
                    "type": "treatment_systemic_change",
                    "value": "Required admission with significant toxicity after cycle 4, including grade 3 mucositis, grade 2 thrombocytopenia with epistaxis, profound fatigue, and grade 2 peripheral neuropathy",
                    "year": 2019,
                    "month": 12
                }
            ]
        },
        "patient_facts": [
            {
                "type": "performance_status",
                "value": "performance status 1"
            },
            {
                "type": "examination_finding",
                "value": "reduced breath sounds at right base with dull percussion note"
            }
        ],
        "status_updates": [
            {
                "type": "clinical_summary",
                "value": "Stage IV lung adenocarcinoma initially treated on immunotherapy trial, switched to standard chemotherapy due to toxicity, achieving partial response but now stopping treatment due to cumulative side effects"
            },
            {
                "type": "latest_treatment_response",
                "value": "partial resolution of pleural disease compared to baseline, meeting RECIST criteria for partial response"
            },
            {
                "type": "update_to_treatment",
                "value": "decision made to discontinue systemic therapy after 4 cycles"
            },
            {
                "type": "planned_investigation",
                "value": "NRG1 fusion testing and comprehensive next-generation sequencing panel"
            },
            {
                "type": "follow_up_referral",
                "value": "will return next week for formal consent process regarding maintenance therapy trial"
            }
        ]
    }
}