{
    "content": "I reviewed [redacted name] today in the urgent suspected cancer clinic following referral from her GP with a 6-week history of post-menopausal bleeding. She describes intermittent fresh red vaginal bleeding, initially light spotting but becoming heavier over the past 2 weeks. She reports no associated pain but notes some lower abdominal bloating. She had her menopause at age 52 and has never taken HRT.\n\nIn her past medical history, she has type 2 diabetes diagnosed in 2018, well-controlled on metformin, and hypertension. She had a previous laparoscopic cholecystectomy in 2015. Her current medications include metformin 1g BD, ramipril 5mg OD, and aspirin 75mg OD. She has no known drug allergies.\n\nShe lives with her husband who provides good support. She is an ex-smoker having quit 10 years ago and drinks minimal alcohol. She has two grown-up children.\n\nOn examination, she appears well. Her BMI is 32. Abdominal examination reveals mild suprapubic tenderness but no masses or organomegaly. Speculum examination shows no obvious cervical lesions but some blood in the posterior fornix. On bimanual examination, the uterus feels bulky and slightly tender.\n\nGiven these concerning symptoms, I have arranged an urgent transvaginal ultrasound scan for next week and have booked her for an outpatient hysteroscopy and endometrial biopsy in our rapid access clinic. Blood tests including FBC, U&Es, LFTs, and CA125 have been requested today.\n\nI have explained to [redacted name] that while post-menopausal bleeding can have benign causes, we need to investigate urgently to rule out more serious conditions. She understands this and is happy with the plan. I will review her again with the results in 2 weeks' time in the rapid access clinic. I have provided her with written information about the planned procedures and emergency contact details should her symptoms worsen.",
    "output": {
        "primary_cancer": {
            "site": "",
            "year": null,
            "month": null
        },
        "other_cancers": [],
        "patient_facts": [
            {
                "type": "current_symptom",
                "value": "6-week history of post-menopausal bleeding, initially light spotting becoming heavier over past 2 weeks"
            },
            {
                "type": "current_symptom",
                "value": "Lower abdominal bloating"
            },
            {
                "type": "comorbidity",
                "value": "Type 2 diabetes diagnosed in 2018, well-controlled on metformin"
            },
            {
                "type": "comorbidity",
                "value": "Hypertension"
            },
            {
                "type": "examination_finding",
                "value": "BMI 32"
            },
            {
                "type": "examination_finding",
                "value": "Mild suprapubic tenderness, bulky and slightly tender uterus on bimanual examination"
            }
        ],
        "status_updates": [
            {
                "type": "clinical_summary",
                "value": "Post-menopausal bleeding under investigation for suspected endometrial cancer. Initial examination shows bulky uterus requiring urgent investigation."
            },
            {
                "type": "planned_investigation",
                "value": "Urgent transvaginal ultrasound scan next week"
            },
            {
                "type": "planned_investigation",
                "value": "Outpatient hysteroscopy and endometrial biopsy in rapid access clinic"
            },
            {
                "type": "planned_investigation",
                "value": "Blood tests including FBC, U&Es, LFTs, and CA125"
            },
            {
                "type": "follow_up_referral",
                "value": "Review in rapid access clinic in 2 weeks with results"
            }
        ]
    }
}