{
  "content": "Many thanks for referring [redacted name] who I reviewed today with her husband present. Unfortunately she has experienced significant clinical deterioration over the past three weeks.\n\nAs you are aware, she was diagnosed with metastatic adrenocortical carcinoma in January 2024 following investigation of Cushing's syndrome. Initial cortisol was markedly elevated at 1200 nmol/L with associated profound myopathy and osteoporosis. CT staging demonstrated a 12cm right adrenal mass with multiple pulmonery and hepatic metasteses. She initially responded well to mitotane with good biochemical response, though experienced significant gastrointestinal toxcity requiring dose reduction.\n\nUnfortunately, restaging CT last week has shown clear evidence of disease progression with new liver lesions and enlargment of existing pulmonery metastases. Her performance status has declined significantly from PS 1 to PS 3, now spending approximately 70% of the day in bed. She describes worsening fatigue, anorexia, and right upper quadrant discomfort. Her cortisol has risen to 980 nmol/L from a previous nadir of 350 nmol/L, suggesting loss of disease control.\n\nOn examination today, she appears significantly more cachectic with obvious muscle wasting. There is tender hepatomegaly extending 4cm below the costal margin. Oxygen saturations are 92% on room air with reduced air entry at both bases. Blood pressure remains elevated at 168/95 despite escalating anti-hypertensive medication.\n\nI have had a lengthy discussion with [redacted name] and her husband regarding disease progression and treatment options. Given her declining performance status and previous mitotane toxicity, I feel second-line chemotherapy with etoposide/cisplatin/doxorubicin would carry excessive risks. We have therefore agreed to transition to best supportive care with focus on symptom management.\n\nI have commenced dexamethasone 4mg twice daily to help with energy levels and appetite. I have referred urgently to our palliative care team for review of symptoms and community support. She has been prescribed additional breakthrough analgesia and anti-emetics. I will arrange urgent follow-up in our supportive care clinic next week to review response to dexamethasone.\n\nI have explained to [redacted name] and her husband that they can contact our acute oncology service at any time if they have concerns. They understand the situation is serious but appreciate the focus on quality of life and symptom control.",
  "output": {
    "primary_cancer": {
      "site": "adrenal, right",
      "year": 2024,
      "month": 1,
      "metastases": "multiple pulmonary and hepatic metastases",
      "other_stage": "Stage IV",
      "histopathology_status": "adrenocortical carcinoma",
      "biomarker_status": "cortisol 1200 nmol/L at diagnosis",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Initial cortisol markedly elevated at 1200 nmol/L",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT showing 12cm right adrenal mass with multiple pulmonary and hepatic metastases",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started on mitotane",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Mitotane dose reduction required due to significant gastrointestinal toxicity",
          "year": 2024
        },
        {
          "type": "laboratory_finding",
          "value": "Cortisol nadir of 350 nmol/L showing initial response",
          "year": 2024
        },
        {
          "type": "anatomical_finding",
          "value": "CT showing disease progression with new liver lesions and enlarging pulmonary metastases",
          "year": 2024
        },
        {
          "type": "laboratory_finding",
          "value": "Rising cortisol to 980 nmol/L indicating loss of disease control",
          "year": 2024
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated to PS 3, spending 70% of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Worsening fatigue, anorexia, and right upper quadrant discomfort"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with muscle wasting, tender hepatomegaly 4cm below costal margin"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturations 92% on room air with reduced air entry at both bases"
      },
      {
        "type": "examination_finding",
        "value": "Blood pressure elevated at 168/95"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic adrenocortical carcinoma with progressive disease after initial response to mitotane. Significant clinical deterioration with rising cortisol and declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on imaging with rising cortisol from 350 to 980 nmol/L"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Previous significant gastrointestinal toxicity from mitotane requiring dose reduction"
      },
      {
        "type": "update_to_treatment",
        "value": "Transitioning to best supportive care, commenced on dexamethasone 4mg twice daily"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status from PS 1 to PS 3"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and follow-up in supportive care clinic next week"
      }
    ]
  }
}