{
  "content": "Diagnosis:\tRight adrenal pheochromocytoma\n\nManagement:\t12 Apr 2024 Right adrenalectomy\n\nHistology:\tpT2N0 pheochromocytoma, 6.5cm, SDHB mutation positive\n\nCurrent Situation:\tPost-operative review\n\nI reviewed [redacted name] today following her recent right adrenalectomy for SDHB-positive pheochromocytoma. She initially presented with episodes of headaches, palpitations and sweating which led to endocrine referral in January 2024. Biochemical testing revealed significantly elevated plasma metanephrines and normetanephrines. CT and subsequent MIBG scanning confirmed a 6.5cm right adrenal mass with high uptake, without evidence of extra-adrenal disease.\n\nShe underwent successful right adrenalectomy on 12th April 2024 following appropriate alpha and beta blockade. Histology has confirmed a completely excised pT2N0 pheochromocytoma with SDHB mutation detected on genetic testing. Given the SDHB mutation status, she will require long-term surveillance.\n\nOn review today, she reports complete resolution of her previous symptoms. Her blood pressure has normalized and she has been able to discontinue all anti-hypertensive medications. Post-operative plasma metanephrines taken last week have returned to normal range. On examination, her surgical wounds are healing well with no complications.\n\nGiven her SDHB mutation status, I have arranged referral to the clinical genetics service for family counselling. She will require long-term follow-up with annual biochemical screening and periodic imaging. I have arranged repeat plasma metanephrines in 3 months and a follow-up CT scan in 6 months. We will review her again following these investigations.",
  "output": {
    "primary_cancer": {
      "site": "right adrenal",
      "year": 2024,
      "month": 1,
      "metastases": "",
      "tnm_stage": "pT2N0",
      "histopathology_status": "pheochromocytoma, 6.5cm",
      "biomarker_status": "SDHB mutation positive",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Elevated plasma metanephrines and normetanephrines",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT and MIBG scan showing 6.5cm right adrenal mass with high uptake, no extra-adrenal disease",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Right adrenalectomy following alpha and beta blockade",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Post-operative plasma metanephrines returned to normal range",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Complete resolution of previous symptoms of headaches, palpitations and sweating"
      },
      {
        "type": "examination_finding",
        "value": "Surgical wounds healing well with no complications"
      },
      {
        "type": "investigation_finding",
        "value": "Normal post-operative plasma metanephrines"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "SDHB-positive pheochromocytoma successfully treated with surgery. Complete biochemical and symptomatic response achieved."
      },
      {
        "type": "latest_treatment_response",
        "value": "Complete biochemical response with normalization of plasma metanephrines"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued all anti-hypertensive medications post-surgery"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat plasma metanephrines in 3 months and CT scan in 6 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to clinical genetics service for family counselling and arranged follow-up after investigations"
      }
    ]
  }
}