{
  "content": "Diagnosis:\tMetastatic adrenocortical carcinoma\n\tInitial presentation March 2023 with 12cm right adrenal mass\n\tT3N0M1, Ki67 80%, with liver metastases\n\tMitotane commenced April 2023, with initial disease stabilisation\n\nI reviewed [redacted name] today following recent admission with deteriorating symptoms and concerning scan findings. She has unfortunately experienced significant clinical decline over the past 6 weeks, with worsening right upper quadrant pain requiring escalation of opiate analgesia, progressive fatigue, and marked loss of appetite with 7kg weight loss. Her performance status has declined from 1 to 3.\n\nThe CT scan performed during admission shows clear evidence of disease progression with the primary adrenal mass increasing from 14cm to 16.5cm, causing significant mass effect on the liver and right kidney. There are multiple new liver metastases, with the largest lesion in segment 7 measuring 8.2cm compared to 5.5cm previously. Her mitotane levels have remained subtherapeutic despite dose escalation, measuring 12 mg/L (target 14-20 mg/L).\n\nOn examination today, she appears cachectic with marked right upper quadrant tenderness and a palpable mass extending 6cm below the costal margin. There is peripheral edema to mid-calf bilaterally.\n\nI have had a lengthy discussion with [redacted name] and her husband regarding the challenging situation. Given the aggressive disease progression despite mitotane, and her declining performance status, I have explained that further systemic therapy with EDP (etoposide, doxorubicin, and cisplatin) would carry significant risks with limited chance of benefit. We have agreed to focus on symptom management and quality of life.\n\nI have increased her oxycodone to 40mg BD and added metoclopramide for nausea. I have made an urgent referral to the palliative care team for home assessment and support. We will continue mitotane for the moment as sudden withdrawal could precipitate adrenal crisis, but will begin gradual dose reduction.\n\nI will review her next week with the palliative care team present. I have provided emergency contact numbers and explained symptoms that should prompt urgent review. Her husband has my direct contact details should there be any concerns before then.",
  "output": {
    "primary_cancer": {
      "site": "adrenal, right",
      "year": 2023,
      "month": 3,
      "metastases": "liver metastases",
      "tnm_stage": "T3N0M1",
      "biomarker_status": "Ki67 80%",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "12cm right adrenal mass at presentation",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started mitotane",
          "year": 2023,
          "month": 4
        },
        {
          "type": "other_progress_or_event",
          "value": "Initial disease stabilisation on mitotane",
          "year": 2023,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Subtherapeutic mitotane levels at 12 mg/L despite dose escalation",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "Primary adrenal mass increased to 16.5cm with multiple new liver metastases, largest 8.2cm",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3"
      },
      {
        "type": "current_symptom",
        "value": "Worsening right upper quadrant pain requiring escalating opiate analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Progressive fatigue and marked loss of appetite with 7kg weight loss"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with marked right upper quadrant tenderness and palpable mass 6cm below costal margin"
      },
      {
        "type": "examination_finding",
        "value": "Peripheral edema to mid-calf bilaterally"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic adrenocortical carcinoma with rapid progression and clinical deterioration despite mitotane. Disease progression in primary tumor and liver metastases with declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression despite mitotane with increasing size of primary tumor and new liver metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for gradual mitotane dose reduction and transition to palliative care"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant clinical decline with deterioration in performance status from 1 to 3"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team for home assessment and support"
      }
    ]
  }
}