{
  "content": "I reviewed [redacted name] today who attended with his wife following recent CT imaging showing disease progression. He was diagnosed with mixed adenoneuroendocrine carcinoma of the ascending colon in January 2024, initially presenting with T3N1M1 disease with liver metastases and retroperitoneal lymphadenopathy. The tumor demonstrated SSTR2 positivity on Octreotide scan and harbored a KRAS G12D mutation.\n\nHe initially commenced FOLFOX chemotherapy on 15th February 2024 and completed 4 cycles, achieving stable disease on first reassessment CT in April 2024. However, he developed grade 3 peripheral neuropathy requiring dose reduction of oxaliplatin to 75% from cycle 3, and subsequently complete omission from cycle 5. He continued on modified de Gramont 5-FU alone for cycles 5-8, completing treatment on 24th May 2024.\n\nUnfortunately, surveillance CT on 15th June 2024 showed disease progression with enlarging liver metastases (largest lesion increased from 3.2cm to 4.8cm) and new peritoneal nodules. His chromogranin A has also risen from 85 to 245 over the past month. He reports increasing right upper quadrant discomfort requiring regular opioid analgesia, early satiety, and has lost 4kg in weight over 6 weeks despite dietetic support. His performance status has declined from ECOG 1 to ECOG 2.\n\nGiven the dual differentiation pattern of his tumor and strong SSTR2 expression, we discussed treatment options including peptide receptor radionuclide therapy (PRRT) with Lutetium-177 DOTATATE. However, his deteriorating performance status and rapid progression suggest we should first consider second-line systemic chemotherapy with FOLFIRI. I have explained the rationale, procedure and potential side effects in detail.\n\nOn examination today, he has tender hepatomegaly extending 4cm below the costal margin. There is no ascites but early peripheral edema is noted. Blood tests show stable renal function but mildly deranged liver function with bilirubin 32 and ALT 124.\n\nI have arranged urgent CT chest and MRI liver to fully characterize disease extent before commencing second-line treatment. We will also repeat chromogranin A and arrange cardiology review to exclude carcinoid heart disease. I have referred him to palliative care for additional support with symptom management. We will review him next week with scan results to initiate FOLFIRI if appropriate. In the meantime, I have increased his opioid analgesia and prescribed metoclopramide for nausea.\n?\n",
  "output": {
    "primary_cancer": {
      "site": "ascending colon",
      "year": 2024,
      "month": 1,
      "metastases": "liver metastases, retroperitoneal lymphadenopathy, new peritoneal nodules",
      "tnm_stage": "T3N1M1",
      "histopathology_status": "mixed adenoneuroendocrine carcinoma",
      "biomarker_status": "SSTR2 positive on Octreotide scan, KRAS G12D mutation",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started FOLFOX chemotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Oxaliplatin dose reduced to 75% due to grade 3 peripheral neuropathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Oxaliplatin completely omitted from cycle 5, continued on modified de Gramont 5-FU alone",
          "year": 2024,
          "month": 4
        },
        {
          "type": "other_progress_or_event",
          "value": "Achieved stable disease on first reassessment CT",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 8 cycles of chemotherapy",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows disease progression with enlarging liver metastases and new peritoneal nodules",
          "year": 2024,
          "month": 6
        },
        {
          "type": "laboratory_finding",
          "value": "Chromogranin A risen from 85 to 245 over past month",
          "year": 2024,
          "month": 6
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated from ECOG 1 to ECOG 2"
      },
      {
        "type": "current_symptom",
        "value": "Increasing right upper quadrant discomfort requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety"
      },
      {
        "type": "examination_finding",
        "value": "Tender hepatomegaly extending 4cm below costal margin, early peripheral edema, no ascites"
      },
      {
        "type": "investigation_finding",
        "value": "Mildly deranged liver function with bilirubin 32 and ALT 124"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Mixed adenoneuroendocrine carcinoma of colon with liver and peritoneal metastases showing disease progression after first-line FOLFOX chemotherapy with declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with enlarging liver metastases and new peritoneal nodules"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 peripheral neuropathy from oxaliplatin requiring dose reduction and eventual omission"
      },
      {
        "type": "update_to_treatment",
        "value": "Planning to commence second-line FOLFIRI chemotherapy pending new imaging"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status with 4kg weight loss over 6 weeks"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent CT chest and MRI liver, repeat chromogranin A, cardiology review"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week with scan results, referred to palliative care for symptom management"
      }
    ]
  }
}