{
  "content": "Diagnosis:\tBilateral lung squamous cell carcinoma, Stage IV\n\nManagement:\t2023 Oct - Commenced pembrolizumab/carboplatin/paclitaxel\n\t\t2024 Jan - Changed to docetaxel due to disease progression\n\t\t2024 Mar - Commenced alpelisib following PIK3CA mutation detection\n\nHistology:\tPoorly differentiated squamous cell carcinoma, PD-L1 35%\n\nCurrent Situation:\tProgressive disease with deteriorating performance status\n\nI reviewed [redacted name] today who has unfortunately experienced further clinical deterioration. Despite third-line treatment with alpelisib, there has been progression of disease with worsening breathlessness and new onset right-sided chest pain. Performance status has declined to ECOG 3, spending most of the day in bed or chair. Oxygen requirements have increased to 4L/min at rest.\n\nRecent CT chest/abdomen/pelvis (15 Apr 2024) shows increase in size of bilateral lung masses, new pleural effusions, and progression of bone metastases with new T4 vertebral body involvement. Brain MRI shows new small brain metastases.\n\nGiven the deteriorating clinical picture and poor performance status, I have had a detailed discussion with [redacted name] and family about focusing on symptom control. We have agreed to discontinue alpelisib and refer to palliative care. I have prescribed dexamethasone 4mg twice daily for symptomatic brain metastases and arranged urgent palliative radiotherapy assessment for the T4 vertebral metastasis.\n\nI have made an urgent referral to the community palliative care team and hospital palliative care service. [redacted name] will be reviewed by palliative care team tomorrow, and I will review again in one week to ensure adequate symptom control.",
  "output": {
    "primary_cancer": {
      "site": "bilateral lung",
      "year": 2023,
      "metastases": "pleural effusions, bone metastases including T4 vertebra, brain metastases",
      "other_stage": "Stage IV",
      "histopathology_status": "poorly differentiated squamous cell carcinoma",
      "biomarker_status": "PD-L1 35%, PIK3CA mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced pembrolizumab/carboplatin/paclitaxel",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_change",
          "value": "Changed to docetaxel due to disease progression",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced alpelisib following PIK3CA mutation detection",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows increase in bilateral lung masses, new pleural effusions, progression of bone metastases with T4 vertebral involvement",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "Brain MRI shows new small brain metastases",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued alpelisib due to disease progression and deteriorating performance status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, spending most of day in bed or chair"
      },
      {
        "type": "current_symptom",
        "value": "Worsening breathlessness requiring 4L/min oxygen at rest"
      },
      {
        "type": "current_symptom",
        "value": "New onset right-sided chest pain"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IV lung cancer with widespread metastases showing disease progression through three lines of therapy. Now transitioning to palliative care due to clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on alpelisib with new metastases and clinical deterioration"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued alpelisib, commenced dexamethasone 4mg twice daily for brain metastases"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increased oxygen requirements"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to community and hospital palliative care teams, oncology review in one week"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent palliative radiotherapy assessment for T4 vertebral metastasis"
      }
    ]
  }
}