{
  "content": "I reviewed [redacted name] today who attended for urgent assessment during cycle 2 of carboplatin/pemetrexed/tepotinib. Unfortunately she has experienced significant clinical deterioration over the past 10 days with worsening breathlessness, now requiring 4L oxygen at rest compared to 2L previously. She reports increased cough productive of clear sputum and chest tightness. She has also noted reduced appetite and increasing fatigue, now spending most of the day in bed (PS 3). Her husband reports she is struggling with basic activities of daily living.\n\nAs background, she was diagnosed in January 2024 with bilateral lung adenocarcinoma with lymphangitis carcinomatosis pattern. Initial molecular testing identified a MET exon 14 skipping mutation (reported as MET ex14 skip). She commenced first-line carboplatin AUC5, pemetrexed 500mg/m2 and tepotinib 450mg daily on 15/2/24. Cycle 1 was complicated by grade 2 fatigue and grade 1 nausea but otherwise tolerated.\n\nToday's chest x-ray shows significant progression of bilateral interstitial shadowing compared to 2 weeks ago, consistent with worsening lymphangitis. Blood tests show rising inflammatory markers with CRP 156 (was 34) and deteriorating renal function with creatinine 156 (baseline 89).\n\nGiven the rapid clinical deterioration and radiological progression, I have discussed with [redacted name] and family that we need to pause systemic treatment. I have arranged urgent admission for supportive care including IV antibiotics to cover possible superimposed infection, careful fluid management, and enhanced supportive care. We will review treatment options once stabilized but I have explained that the prognosis is now very guarded given the aggressive disease progression on first-line therapy.\n\nI have made an urgent referral to the palliative care team and arranged daily acute oncology review during admission. Her husband understands the severity of the situation and has my direct contact details.",
  "output": {
    "primary_cancer": {
      "site": "bilateral lung",
      "year": 2024,
      "month": 1,
      "metastases": "lymphangitis carcinomatosis",
      "tnm_stage": "T4N3M1c",
      "histopathology_status": "adenocarcinoma",
      "biomarker_status": "MET exon 14 skipping mutation",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "MET exon 14 skipping mutation identified on molecular testing",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started carboplatin AUC5, pemetrexed 500mg/m2 and tepotinib 450mg daily",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Treatment paused due to clinical deterioration and disease progression",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "Chest x-ray shows significant progression of bilateral interstitial shadowing consistent with worsening lymphangitis",
          "year": 2024,
          "month": 2
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 3, spending most of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Worsening breathlessness requiring 4L oxygen at rest"
      },
      {
        "type": "current_symptom",
        "value": "Increased cough productive of clear sputum"
      },
      {
        "type": "current_symptom",
        "value": "Chest tightness"
      },
      {
        "type": "current_symptom",
        "value": "Reduced appetite and increasing fatigue"
      },
      {
        "type": "investigation_finding",
        "value": "Rising inflammatory markers with CRP 156 (was 34) and deteriorating renal function with creatinine 156 (baseline 89)"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Bilateral lung adenocarcinoma with lymphangitis pattern. Rapid clinical deterioration and disease progression during first-line targeted therapy"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 fatigue and grade 1 nausea during cycle 1"
      },
      {
        "type": "update_to_treatment",
        "value": "Systemic treatment paused due to clinical deterioration"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status, now struggling with basic activities of daily living"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent admission arranged for supportive care and IV antibiotics with daily acute oncology review"
      }
    ]
  }
}