{
  "content": "Diagnosis:\tBilateral synchronous primary lung adenocarcinomas\n\nManagement:\t12 Jan 2024 Right VATS lobectomy\n\t\t15 Feb 2024 Left VATS wedge resection\n\nHistology:\tRight lung: pT3 N2 adenocarcinoma, STK11/KEAP1 mutation positive\n\t\tLeft lung: pT1c N0 adenocarcinoma\n\t\tComposite stage pT3(m) N2 IIIC\n\nCurrent Situation:\tScreened for ILLUMINATE-304 trial\n\nI reviewed [redacted name] today following completion of surgical recovery. Both VATS procedures were well tolerated with good functional recovery. Recent CT chest shows expected post-surgical changes with no evidence of disease progression. Mediastinal lymphadenopathy has reduced significantly following surgery.\n\nMolecular results confirm STK11/KEAP1 mutation and PD-L1 expression of 5%. These results, combined with stage IIIC disease, make her eligible for the ILLUMINATE-304 trial comparing novel immunotherapy combinations in the adjuvant setting. I have discussed the trial protocol in detail, including randomization process, treatment schedule, and additional monitoring requirements. [redacted name] understands the commitment required and wishes to proceed.\n\nShe has completed baseline trial assessments including cardiac echo, pulmonary function tests, and required blood work. All parameters are within trial specifications. She will be randomized next week with treatment to commence in 14 days. I have arranged weekly review during the first month of treatment as per protocol.",
  "output": {
    "primary_cancer": {
      "site": "bilateral lungs",
      "year": 2024,
      "month": 1,
      "metastases": "mediastinal lymphadenopathy",
      "tnm_stage": "pT3(m)N2",
      "other_stage": "Stage IIIC",
      "histopathology_status": "synchronous primary adenocarcinomas",
      "biomarker_status": "STK11/KEAP1 mutation positive, PD-L1 5%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right VATS lobectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Left VATS wedge resection",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular results confirm STK11/KEAP1 mutation and PD-L1 expression of 5%",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest shows expected post-surgical changes with no evidence of disease progression. Mediastinal lymphadenopathy has reduced significantly",
          "year": 2024,
          "month": null
        },
        {
          "type": "clinical_trial_update",
          "value": "Completed baseline trial assessments for ILLUMINATE-304 trial including cardiac echo, pulmonary function tests, and blood work",
          "year": 2024,
          "month": null
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "Cardiac echo, pulmonary function tests, and blood work all within trial specifications"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IIIC bilateral lung adenocarcinomas post-surgical resection. Good recovery and eligible for adjuvant immunotherapy trial"
      },
      {
        "type": "latest_treatment_response",
        "value": "Mediastinal lymphadenopathy has reduced significantly following surgery"
      },
      {
        "type": "update_to_treatment",
        "value": "To be randomized for ILLUMINATE-304 trial comparing novel immunotherapy combinations"
      },
      {
        "type": "planned_investigation",
        "value": "To be randomized next week with treatment to commence in 14 days"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review arranged during first month of treatment as per protocol"
      }
    ]
  }
}