{
  "content": "I was very pleased to review [redacted name] today following completion of 6 cycles of gemcitabine and cisplatin chemotherapy for her FGFR2 fusion-positive extrahepatic cholangiocarcinoma. She has shown an excellent partial response to treatment, with the most recent CT scan on 15th April 2024 showing significant reduction in the primary bile duct mass from 4.2cm to 2.1cm, and resolution of previously noted regional lymphadenopathy. Her initial diagnosis was made in January 2024 following investigation of obstructive jaundice, with staging confirming T2N1M0 disease. She underwent successful biliary stenting on 22nd January 2024 which provided good symptomatic relief.\n?\nShe has managed the chemotherapy remarkably well overall, though did require a 20% dose reduction of cisplatin from cycle 4 onwards due to grade 2 tinnitus. She developed grade 1 peripheral neuropathy affecting her fingers which has not progressed since the dose modification. Her performance status remains excellent at ECOG 0-1. She continues to work part-time as a teacher and maintains regular gentle exercise with daily walking.\n?\nGiven her excellent response to first-line treatment and the presence of an FGFR2 fusion, we had detailed discussions today about transitioning to targeted therapy with pemigatinib. I have explained the rationale for this change, including the potential for more sustained disease control with a better side effect profile. We discussed the common side effects including hyperphosphatemia, alopecia, nail changes, and dry eyes. She understands the need for regular phosphate monitoring and dietary modifications.\n?\nShe will therefore commence pemigatinib 13.5mg daily on a 2-weeks-on/1-week-off schedule. I have arranged weekly blood tests for the first month including phosphate levels, and she will see our specialist nurse next week for baseline toxicity assessment and supportive care advice. She has appointments arranged with ophthalmology for baseline assessment and our dietitian for phosphate management advice.\n?\nWe will see her back in clinic in 4 weeks' time to assess tolerability of the new treatment. A CT scan will be arranged at 3 months to assess response. She understands to contact our team if she develops any concerning symptoms in the meantime.",
  "output": {
    "primary_cancer": {
      "site": "extrahepatic bile duct",
      "year": 2024,
      "month": 1,
      "metastases": "regional lymphadenopathy",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "cholangiocarcinoma",
      "biomarker_status": "FGFR2 fusion positive",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Presented with obstructive jaundice",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Underwent biliary stenting with good symptomatic relief",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started on gemcitabine and cisplatin chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cisplatin dose reduced by 20% from cycle 4 due to grade 2 tinnitus",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows reduction in primary bile duct mass from 4.2cm to 2.1cm and resolution of lymphadenopathy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 6 cycles of gemcitabine and cisplatin",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 0-1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 peripheral neuropathy affecting fingers"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 tinnitus"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Working part-time as teacher and maintains daily walking"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "FGFR2 fusion-positive cholangiocarcinoma showing excellent partial response to first-line chemotherapy. Transitioning to targeted therapy with pemigatinib."
      },
      {
        "type": "latest_treatment_response",
        "value": "Excellent partial response with reduction in primary mass and resolution of lymphadenopathy"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 tinnitus and grade 1 peripheral neuropathy from chemotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Changing to pemigatinib 13.5mg daily on 2-weeks-on/1-week-off schedule"
      },
      {
        "type": "planned_investigation",
        "value": "Weekly blood tests including phosphate levels for first month, CT scan at 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Specialist nurse review next week, ophthalmology and dietitian appointments arranged, oncology review in 4 weeks"
      }
    ]
  }
}