{
  "content": "Diagnosis:\tIntrahepatic cholangiocarcinoma, T3N1M1 with widespread nodal disease\n\nI reviewed [redacted name] today for assessment during cycle 4 of gemcitabine/cisplatin combination chemotherapy. She was initially diagnosed in January 2024 following investigation of deranged liver function tests, with CT demonstrating a 6.8cm mass in the right hepatic lobe with extensive porta hepatis and retroperitoneal lymphadenopathy. Biopsy confirmed intrahepatic cholangiocarcinoma, and molecular profiling has identified an IDH2 mutation.\n\nShe commenced first-line systemic therapy with gemcitabine/cisplatin on 15/2/24 following MDT discussion. The first three cycles were complicated by grade 2 fatigue and intermittent nausea, though these have been better controlled with optimized antiemetics. She developed grade 1 peripheral neuropathy after cycle 3, which is being carefully monitored.\n\nRecent CT imaging on 12/4/24 shows encouraging disease stability with the primary mass now measuring 6.5cm (previously 6.8cm) and stable nodal disease. Her CA19-9 has decreased from 1250 to 780 units/ml.\n\nOn review today, her performance status remains 1. She reports improved energy levels compared to last cycle, though still requires afternoon rest periods. Her nausea is better controlled with the current antiemetic regimen. The peripheral neuropathy remains grade 1, limited to mild tingling in her fingertips. Examination shows no new concerns, and her current weight is stable at 64kg.\n\nHer blood tests today show stable liver function with bilirubin 15, ALT 45, ALP 165. Her platelet count is 142 and neutrophils 2.1, adequate for proceeding with cycle 4. Given the radiological stability and overall tolerability, we will continue with the current regimen at full doses. I have prescribed cycle 4 for today.\n\nThe plan is to complete 6 cycles in total, with repeat imaging after cycle 6. We will see her again before cycle 5 in three weeks' time. She has the acute oncology contact details and understands to contact us if any concerns develop in the interim.",
  "output": {
    "primary_cancer": {
      "site": "intrahepatic biliary tract, right hepatic lobe",
      "year": 2024,
      "month": 1,
      "metastases": "extensive porta hepatis and retroperitoneal lymphadenopathy",
      "tnm_stage": "T3N1M1",
      "histopathology_status": "intrahepatic cholangiocarcinoma",
      "biomarker_status": "IDH2 mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT showing 6.8cm mass in right hepatic lobe with extensive lymphadenopathy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "Initial CA19-9 1250 units/ml",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started gemcitabine/cisplatin combination chemotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Antiemetic regimen optimized due to grade 2 nausea",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows primary mass reduced to 6.5cm with stable nodal disease",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 decreased to 780 units/ml",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 peripheral neuropathy with mild tingling in fingertips"
      },
      {
        "type": "current_symptom",
        "value": "Requires afternoon rest periods"
      },
      {
        "type": "investigation_finding",
        "value": "Stable liver function with bilirubin 15, ALT 45, ALP 165"
      },
      {
        "type": "investigation_finding",
        "value": "Platelet count 142 and neutrophils 2.1"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic cholangiocarcinoma showing disease stability on first-line gemcitabine/cisplatin with improving tolerability after antiemetic optimization"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on CT with minor reduction in primary mass size and stable CA19-9 trend"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 peripheral neuropathy and controlled nausea with optimized antiemetics"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing with cycle 4 gemcitabine/cisplatin at full doses"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat imaging planned after cycle 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Review before cycle 5 in three weeks"
      }
    ]
  }
}