{
  "content": "Diagnosis:\tT1N0M0 high grade urothelial carcinoma of bladder\n\nManagement:\t12 Mar 2024 TURBT - complete resection achieved\n\nHistology:\tHigh grade urothelial carcinoma, T1, no lymphovascular invasion\n\tPD-L1 CPS 10\n\nCurrent Situation:\tPost-TURBT assessment\n\n[redacted name] attended clinic today following recent TURBT performed by [redacted name]. Histology confirms high-grade T1 disease with no lymphovascular invasion. Recovery from surgery has been uncomplicated with good urinary function. No current haematuria. Performance status is 0.\n\nI have discussed management options including intravesical BCG versus surveillance. Given the high-grade nature of the disease, I have recommended proceeding with induction BCG. [redacted name] understands the treatment schedule and potential side effects. We will arrange BCG induction to commence in 2 weeks time once the bladder has fully healed.\n\nPlan is for BCG induction followed by maintenance schedule. Will arrange follow-up flexible cystoscopy in 3 months. CT urogram to be scheduled prior to next clinic review.",
  "output": {
    "primary_cancer": {
      "site": "bladder",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "T1N0M0",
      "histopathology_status": "high grade urothelial carcinoma, no lymphovascular invasion",
      "biomarker_status": "PD-L1 CPS 10",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "TURBT with complete resection achieved",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Histology confirms high-grade T1 disease with no lymphovascular invasion",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 0"
      },
      {
        "type": "current_symptom",
        "value": "No current haematuria"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed high-grade T1 bladder cancer following TURBT. Uncomplicated recovery, proceeding to intravesical BCG therapy."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence BCG induction therapy in 2 weeks"
      },
      {
        "type": "planned_investigation",
        "value": "CT urogram and follow-up flexible cystoscopy in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Review following completion of investigations"
      }
    ]
  }
}