{
  "content": "Many thanks for referring [redacted name] for assessment during cycle 2 of the MORPHEUS-UC trial. As you know, she has micropapillary variant urothelial carcinoma of the bladder initially diagnosed in January 2024 following investigation of haematuria. Initial staging showed a T3b tumor with pelvic and para-aortic lymphadenopathy but no distant metastases. She underwent radical cystectomy with extended lymph node dissection on 15 February 2024, with histology confirming micropapillary variant, lymphovascular invasion, and 8/22 positive nodes. Molecular profiling demonstrated mTOR pathway activation.\n\nFollowing post-operative recovery, she was enrolled in the MORPHEUS-UC trial investigating dual mTOR/PD-L1 blockade. She commenced treatment on 1 April 2024 and has completed cycle 1 of the combination regime. Initial tolerance was challenging with grade 2 mucositis and fatigue requiring supportive care, but these have now improved to grade 1.\n\nOn review today, her performance status remains 1. She reports ongoing mild mucositis but is maintaining oral intake. She has developed new onset peripheral oedema, likely treatment-related, and morning fasting glucose has risen to 7.8 mmol/L suggesting early metabolic effects of mTOR inhibition. Trial-mandated CT assessment shows stable disease in the pelvic nodes but concerning new retroperitoneal adenopathy measuring up to 2.2cm. Her trial-specific quality of life scores show deterioration in the fatigue domain but stable scores elsewhere.\n\nGiven the new radiological findings, we have triggered the trial protocol's progression assessment criteria. She will continue on treatment pending central review, with close monitoring of the new nodes. We have arranged the protocol-mandated repeat imaging in 6 weeks. Her next trial visit is scheduled for 13 May 2024.",
  "output": {
    "primary_cancer": {
      "site": "bladder",
      "year": 2024,
      "month": 1,
      "metastases": "pelvic and para-aortic lymphadenopathy",
      "tnm_stage": "T3b",
      "other_stage": "Stage IIIB",
      "histopathology_status": "micropapillary variant urothelial carcinoma with lymphovascular invasion",
      "biomarker_status": "mTOR pathway activation",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial diagnosis following investigation of haematuria",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Radical cystectomy with extended lymph node dissection, 8/22 positive nodes",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular profiling demonstrated mTOR pathway activation",
          "year": 2024,
          "month": 2
        },
        {
          "type": "clinical_trial_update",
          "value": "Enrolled in MORPHEUS-UC trial investigating dual mTOR/PD-L1 blockade",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started combination regime on trial",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable pelvic nodes but new retroperitoneal adenopathy up to 2.2cm",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "current_symptom",
        "value": "Mild mucositis but maintaining oral intake"
      },
      {
        "type": "current_symptom",
        "value": "New onset peripheral oedema"
      },
      {
        "type": "investigation_finding",
        "value": "Morning fasting glucose risen to 7.8 mmol/L"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Deterioration in fatigue domain of QoL scores but stable scores elsewhere"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Micropapillary bladder cancer on MORPHEUS-UC trial. New concerning retroperitoneal nodes on cycle 2 assessment despite stable pelvic disease"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 mucositis and fatigue, improved from grade 2 in cycle 1"
      },
      {
        "type": "latest_treatment_response",
        "value": "Mixed response with stable pelvic nodes but new retroperitoneal adenopathy"
      },
      {
        "type": "planned_investigation",
        "value": "Protocol-mandated repeat imaging in 6 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Next trial visit scheduled for 13 May 2024"
      }
    ]
  }
}