{
  "content": "Diagnosis\n\t1. Muscle invasive bladder cancer with liver and lung metastases\n\n\tDate of diagnosis\n\tApril 2024\n\n\tTreatment aim\n\tPalliative\n\n\tSummary of completed treatment and relevant dates\n\n\tSurgery\n\tTransurethral resection of bladder tumor (TURBT) 12 April 2024\n\n\tChemotherapy\n\tCycle 1-2 Gemcitabine/Cisplatin completed May 2024\n\n\tClinical studies\n\tNone\n\n\tCurrent disease status\n\tProgressive disease with new liver lesions\n\n\tCurrent issues\n\tWorsening renal function, increasing pain, deteriorating performance status\n\n\tSummary of consultation\n\tCase discussed at Urology MDT today. This 68-year-old gentleman was diagnosed with muscle-invasive bladder cancer in April 2024 following investigation of frank hematuria. Initial staging showed a large bladder tumor with local invasion into perivesical fat, regional lymphadenopathy, and multiple liver and lung metastases. HER2 testing on the TURBT specimen was positive (IHC 3+).\n\nHe commenced palliative chemotherapy with Gemcitabine/Cisplatin but recent CT after cycle 2 shows disease progression with 30% increase in liver metastases and new peritoneal deposits. His performance status has deteriorated to ECOG 2-3, with increasing right upper quadrant pain requiring opioid escalation. His renal function has declined with creatinine rising from 120 to 180 μmol/L.\n\nThe MDT recommendations are:\n1. Discontinue current chemotherapy due to disease progression and declining performance status\n2. Switch to second-line treatment with Enfortumab Vedotin given HER2 positivity\n3. Urgent palliative medicine review for pain management\n4. Consider palliative radiotherapy to symptomatic pelvic disease\n\n\tFurther investigations\n\tRepeat renal function in 1 week prior to new treatment\n\n\tMedication prescribed\n\tOxycodone MR increased to 40mg BD\nPregabalin 75mg BD started for neuropathic pain component\n\n\tFollow up\n\tUrgent review in oncology clinic next week\nPalliative care review arranged for tomorrow\n\n\tRequired GP actions\n\tPlease monitor renal function weekly\nIncrease community support given declining performance status",
  "output": {
    "primary_cancer": {
      "site": "bladder with perivesical fat invasion",
      "year": 2024,
      "month": 4,
      "metastases": "regional lymphadenopathy, multiple liver and lung metastases, new peritoneal deposits",
      "tnm_stage": "cT4N1M1",
      "histopathology_status": "muscle invasive bladder cancer",
      "biomarker_status": "HER2 positive (IHC 3+)",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Transurethral resection of bladder tumor (TURBT)",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Gemcitabine/Cisplatin chemotherapy",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows 30% increase in liver metastases and new peritoneal deposits",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing Gemcitabine/Cisplatin due to disease progression and declining performance status",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated to ECOG 2-3"
      },
      {
        "type": "current_symptom",
        "value": "Increasing right upper quadrant pain requiring opioid escalation"
      },
      {
        "type": "investigation_finding",
        "value": "Creatinine risen from 120 to 180 μmol/L"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced bladder cancer with widespread metastases showing disease progression after 2 cycles of first-line chemotherapy with deteriorating clinical status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with 30% increase in liver metastases and new peritoneal deposits"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing Gemcitabine/Cisplatin, plan to switch to Enfortumab Vedotin"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status with increasing pain and worsening renal function"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat renal function in 1 week prior to new treatment"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent oncology review next week and palliative care review tomorrow"
      }
    ]
  }
}