{
  "content": "Diagnosis:\tChoroid plexus carcinoma of right lateral ventricle with leptomeningeal dissemination\n\nI reviewed [redacted name] today in the neuro-oncology clinic, accompanied by his parents. Unfortunately, the latest MRI brain and spine performed on 15 April 2024 shows evidence of progressive disease with new nodular leptomeningeal enhancement along the thoracic cord and cauda equina, despite three cycles of carboplatin/etoposide chemotherapy. The primary right ventricular lesion has also increased in size from 4.2cm to 5.1cm with increased mass effect on the surrounding structures.\n\nThe initial diagnosis was made in January 2024 following presentation with raised intracranial pressure. He underwent partial resection on 28 January 2024, complicated by post-operative hydrocephalus requiring VP shunt insertion. Histology confirmed WHO grade III choroid plexus carcinoma with retained INI1 expression and p53 mutation. Post-operative MRI showed residual disease with early signs of leptomeningeal spread.\n\nHe commenced carboplatin/etoposide chemotherapy in February 2024, receiving three cycles to date. Initially, there was radiological stability after two cycles, but he has developed worsening headaches and back pain over the past three weeks. CSF cytology from 12 April 2024 has confirmed malignant cells, correlating with the MRI findings of disease progression.\n\nGiven the clear evidence of disease progression, we have discussed changing treatment strategy. The plan is to commence high-dose methotrexate-based chemotherapy (Head Start III protocol) with intrathecal chemotherapy. I have explained the increased intensity of this regimen and potential side effects. We will arrange admission next week to commence treatment, with baseline audiology and renal function testing beforehand.\n\nI have requested urgent MRI brain and spine for next week as baseline prior to treatment change. The neuro-oncology CNS specialist will contact the family tomorrow to arrange admission and provide further support. We will also arrange an urgent review with the palliative care team to help with symptom management, particularly the headaches and back pain which are currently suboptimally controlled.",
  "output": {
    "primary_cancer": {
      "site": "brain, right lateral ventricle",
      "year": 2024,
      "month": 1,
      "metastases": "leptomeningeal dissemination, thoracic cord and cauda equina involvement",
      "histopathology_status": "WHO grade III choroid plexus carcinoma",
      "biomarker_status": "INI1 retained, p53 mutant",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Partial resection complicated by post-operative hydrocephalus requiring VP shunt insertion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Post-operative MRI showed residual disease with early signs of leptomeningeal spread",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced carboplatin/etoposide chemotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "CSF cytology confirmed malignant cells",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows progressive disease with new nodular leptomeningeal enhancement and primary tumor growth to 5.1cm",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Worsening headaches and back pain over past three weeks"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Choroid plexus carcinoma with progressive leptomeningeal disease despite initial chemotherapy. Disease progression confirmed on imaging and CSF cytology"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease with increase in primary tumor size and new leptomeningeal disease despite carboplatin/etoposide"
      },
      {
        "type": "update_to_treatment",
        "value": "Changing to high-dose methotrexate-based chemotherapy (Head Start III protocol) with intrathecal chemotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI brain and spine next week as baseline prior to treatment change"
      },
      {
        "type": "follow_up_referral",
        "value": "Arranging admission next week to commence treatment with baseline audiology and renal function testing"
      }
    ]
  }
}