{
  "content": "I reviewed [redacted name] today in the neuro-oncology follow-up clinic. The patient underwent gross total resection of a right lateral ventricle central neurocytoma in January 2023, with histology confirming WHO grade II disease, Ki-67 < 3% and positive synaptophysin staining. Post-operative MRI showed no residual disease, and the patient made an excellent recovery with no neurological deficits.\n\nSurveillance MRI brain performed last week shows stable post-operative changes with no evidence of disease recurrence. The surgical cavity remains stable with expected post-treatment changes. No new lesions are identified.\n\nThe patient continues to do very well with no new neurological symptoms. Seizures remain well-controlled on levetiracetam monotherapy. We will continue with our surveillance protocol of 6-monthly MRI brain imaging for the first two years post-surgery, then annually thereafter if remains stable. Next review will be in 6 months with repeat imaging.",
  "output": {
    "primary_cancer": {
      "site": "brain, right lateral ventricle",
      "year": 2023,
      "month": 1,
      "metastases": null,
      "tnm_stage": null,
      "other_stage": "WHO grade II",
      "histopathology_status": "central neurocytoma",
      "biomarker_status": "Ki-67 < 3%, Synaptophysin positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Gross total resection of right lateral ventricle tumor",
          "year": 2023,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Post-operative MRI showed no residual disease",
          "year": 2023,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Surveillance MRI brain shows stable post-operative changes with no evidence of disease recurrence",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Seizures on levetiracetam"
      },
      {
        "type": "examination_finding",
        "value": "No neurological deficits"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "WHO grade II central neurocytoma post complete resection. Stable disease on surveillance imaging with no clinical concerns"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable post-operative changes on MRI with no evidence of recurrence"
      },
      {
        "type": "follow_up_referral",
        "value": "Continue 6-monthly MRI surveillance, next review in 6 months with imaging"
      }
    ]
  }
}