{
  "content": "I reviewed [redacted name] today in our neuro-oncology clinic, accompanied by his parents. Unfortunately, his clinical condition has deteriorated significantly over the past three weeks with worsening ataxia, diplopia, and new onset dysphagia requiring nasogastric feeding. His performance status has declined from ECOG 2 to 3.\n\nAs you are aware, [redacted name] was diagnosed with H3K27M-mutant diffuse midline glioma in March 2024 following investigation of progressive cranial nerve palsies. Initial MRI demonstrated an infiltrative brainstem lesion with associated mass effect and early signs of leptomeningeal spread. Molecular analysis confirmed HIST1H3B mutation. He commenced treatment with radiotherapy (54Gy in 30 fractions) with concurrent temozolomide, completing this in April 2024. Unfortunately, follow-up imaging showed disease progression with extensive leptomeningeal dissemination.\n\nHe subsequently commenced second-line therapy with weekly vinblastine, which was initially well-tolerated. However, recent MRI shows further disease progression with new areas of enhancement and increasing mass effect. His dexamethasone requirements have increased significantly to 12mg daily to manage symptoms.\n\nGiven the clear evidence of disease progression and declining clinical status, we have discussed treatment options at length with [redacted name] and his family. We have agreed to discontinue vinblastine and transition to a palliative approach focusing on symptom control. I have increased his dexamethasone to 16mg daily and commenced regular ondansetron. We have made an urgent referral to the palliative care team for home support.\n\nExamination today shows new left-sided facial weakness, increased ataxia, and bilateral sixth nerve palsies. Urgent MRI has been arranged for next week to monitor disease progression and guide symptom management. We will review him again following the scan with the palliative care team present to coordinate ongoing care.\n\nI have explained to the family that the prognosis is now measured in weeks rather than months. They have expressed a clear preference for home-based care where possible, and we are arranging appropriate community support.",
  "output": {
    "primary_cancer": {
      "site": "brain stem",
      "year": 2024,
      "month": 3,
      "metastases": "leptomeningeal dissemination",
      "histopathology_status": "diffuse midline glioma",
      "biomarker_status": "H3K27M-mutant, HIST1H3B mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Initial MRI showed infiltrative brainstem lesion with mass effect and early leptomeningeal spread",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular analysis confirmed HIST1H3B mutation",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent chemoradiation with temozolomide",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed radiotherapy 54Gy in 30 fractions",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "Follow-up imaging showed disease progression with extensive leptomeningeal dissemination",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced second-line therapy with weekly vinblastine",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "Recent MRI shows further progression with new enhancement and increasing mass effect",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued vinblastine due to disease progression and clinical deterioration",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, deteriorated from PS 2"
      },
      {
        "type": "current_symptom",
        "value": "Worsening ataxia, diplopia, and dysphagia requiring nasogastric feeding"
      },
      {
        "type": "examination_finding",
        "value": "New left-sided facial weakness, increased ataxia, and bilateral sixth nerve palsies"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "H3K27M-mutant diffuse midline glioma with leptomeningeal spread showing rapid progression despite two lines of therapy. Significant clinical deterioration with transition to palliative care."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on MRI with new enhancement and increasing mass effect"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued vinblastine and increased dexamethasone to 16mg daily with regular ondansetron"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration with new neurological deficits and requiring nasogastric feeding"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI arranged for next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and arranging community support"
      }
    ]
  }
}