{
  "content": "Diagnosis:\tDiffuse intrinsic pontine glioma (DIPG), H3K27M-mutant, TP53 mutated\n\nManagement:\t24 Feb 2024 Commenced focal radiotherapy 54Gy in 30 fractions\n\t\t15 Mar 2024 Started on Dexamethasone 4mg bd\n\nCurrent Situation:\tProgressive neurological symptoms despite completed radiotherapy\n\nI reviewed [redacted name] today following completion of focal radiotherapy to the brainstem. Unfortunately, there has been clinical deterioration over the past week with worsening diplopia, progressive right-sided weakness, and new onset dysphagia requiring modification of diet consistency. The initial improvement in symptoms seen during radiotherapy has not been sustained.\n\nMRI brain performed yesterday shows increased T2 signal change throughout the pons with new areas of enhancement and increased mass effect on the fourth ventricle. This represents disease progression despite recent completion of radiotherapy.\n\nOn examination today, there is new right facial nerve palsy (grade 3), worsening of right-sided hemiparesis (power grade 3/5 in right arm and leg compared to 4/5 two weeks ago), and evidence of bulbar dysfunction with weak palatal movement and delayed swallow reflex. Cranial nerve VI palsy persists bilaterally.\n\nI have had a detailed discussion with [redacted name] and family regarding disease progression and treatment options. Given the rapid progression and poor response to first-line therapy, I have recommended enrollment in the phase I clinical trial of novel H3K27M-targeted therapy (DIPG-001) which is currently open at our center. I have explained the experimental nature of this treatment and potential risks/benefits.\n\nThe plan is to:\n1. Increase dexamethasone to 4mg tds with PPI cover\n2. Urgent referral to speech and language therapy for swallow assessment\n3. Complete trial screening investigations next week including functional assessment and updated MRI\n4. Review in combined neuro-oncology clinic next week with trial team\n5. Continue current supportive medications including ondansetron and prophylactic co-trimoxazole\n\nI have also made an urgent referral to the palliative care team for support with symptom management and advanced care planning discussions.",
  "output": {
    "primary_cancer": {
      "site": "brain stem, pons",
      "year": 2024,
      "month": 2,
      "metastases": null,
      "tnm_stage": null,
      "other_stage": null,
      "histopathology_status": "Diffuse intrinsic pontine glioma (DIPG)",
      "biomarker_status": "H3K27M-mutant, TP53 mutated",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Commenced focal radiotherapy 54Gy in 30 fractions",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started on Dexamethasone 4mg bd",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows increased T2 signal change throughout pons with new enhancement and mass effect on fourth ventricle",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Clinical deterioration with worsening diplopia, progressive right-sided weakness, and new onset dysphagia",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "New right facial nerve palsy (grade 3)"
      },
      {
        "type": "examination_finding",
        "value": "Right-sided hemiparesis (power grade 3/5 in right arm and leg)"
      },
      {
        "type": "examination_finding",
        "value": "Bulbar dysfunction with weak palatal movement and delayed swallow reflex"
      },
      {
        "type": "examination_finding",
        "value": "Bilateral cranial nerve VI palsy"
      },
      {
        "type": "current_symptom",
        "value": "Diplopia, right-sided weakness, dysphagia requiring modified diet"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "DIPG showing progression despite recent completion of radiotherapy with new neurological deficits. Initial improvement during radiotherapy not sustained."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on MRI with clinical deterioration despite completed radiotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Increasing dexamethasone to 4mg tds with PPI cover"
      },
      {
        "type": "planned_investigation",
        "value": "Trial screening investigations including functional assessment and updated MRI"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in combined neuro-oncology clinic next week with trial team, urgent referral to speech and language therapy and palliative care"
      }
    ]
  }
}