{
  "content": "I reviewed [redacted name] today in the neuro-oncology clinic, accompanied by his wife and daughter. Unfortunately, his latest MRI from 15th April 2024 shows significant disease progression with expansion of the right temporal lobe mass and new periventricular enhancement, particularly affecting the right lateral ventricle. The original lesion has increased from 4.2cm to 5.8cm in maximal diameter, with increasing mass effect and midline shift of 8mm (previously 4mm). There is new enhancement along the ependymal surface of the right lateral ventricle suggesting CSF dissemination.\n\nHe was initially diagnosed in December 2023 with a right temporal lobe giant cell glioblastoma, IDH-wildtype, showing ATRX loss and p53 mutation. He completed the Stupp protocol of chemoradiation with concurrent temozolomide in February 2024, followed by one cycle of adjuvant temozolomide which was complicated by grade 4 thrombocytopenia requiring platelet transfusion.\n\nHis clinical condition has deteriorated over the past three weeks. His left-sided weakness has worsened, now affecting both upper and lower limbs (MRC grade 3/5 in left arm and 4/5 in left leg). He reports increased frequency of focal seizures despite recent increase in levetiracetam to 1500mg BD. His wife notes increasing confusion and personality changes. Performance status has declined to ECOG 3.\n\nOn examination today, he is alert but disorientated to time. There is obvious left-sided neglect and homonymous hemianopia. Left-sided weakness is confirmed as noted above, with increased tone and brisk reflexes. Gait is unsteady requiring two-person assistance.\n\nI have discussed the situation at length with [redacted name] and his family. Given the rapid progression and poor tolerance of first-line therapy, I have recommended second-line treatment with lomustine (CCNU). I have explained the modest chances of response but potential for disease stabilization. The family understand the poor prognosis but wish to pursue further active treatment.\n\nI have increased his dexamethasone to 8mg BD and added a PPI for gastric protection. The seizure frequency will need close monitoring - I have provided advice about when to seek urgent medical attention. I have arranged urgent referral to the hospital palliative care team for support with symptom management, and physiotherapy assessment for mobility support.\n\nHe will start lomustine 110mg/m2 next week, with weekly blood count monitoring. I will review him again in 2 weeks, with repeat imaging planned for 6 weeks' time to assess response. The acute oncology team are aware of his situation and will provide additional support as needed.",
  "output": {
    "primary_cancer": {
      "site": "brain, right temporal lobe",
      "year": 2023,
      "month": 12,
      "metastases": "CSF dissemination with periventricular enhancement, right lateral ventricle involvement",
      "histopathology_status": "giant cell glioblastoma, IDH-wildtype",
      "biomarker_status": "ATRX loss, p53 mutation",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Stupp protocol chemoradiation with concurrent temozolomide",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed one cycle adjuvant temozolomide complicated by grade 4 thrombocytopenia requiring platelet transfusion",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows progression with right temporal mass increased to 5.8cm from 4.2cm, new periventricular enhancement and CSF dissemination",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3"
      },
      {
        "type": "current_symptom",
        "value": "Left-sided weakness MRC grade 3/5 arm and 4/5 leg"
      },
      {
        "type": "current_symptom",
        "value": "Increased focal seizures"
      },
      {
        "type": "current_symptom",
        "value": "Confusion and personality changes"
      },
      {
        "type": "examination_finding",
        "value": "Left-sided neglect and homonymous hemianopia"
      },
      {
        "type": "examination_finding",
        "value": "Unsteady gait requiring two-person assistance"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Giant cell glioblastoma with rapid progression after first-line therapy and significant clinical deterioration. Planning second-line lomustine despite poor prognosis"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 4 thrombocytopenia with temozolomide requiring platelet transfusion"
      },
      {
        "type": "update_to_treatment",
        "value": "Increased dexamethasone to 8mg BD, added PPI, maintaining increased levetiracetam 1500mg BD"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in mobility, cognition and left-sided weakness"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat imaging in 6 weeks to assess response"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks, urgent palliative care and physiotherapy referrals made"
      }
    ]
  }
}