{
  "content": "Diagnosis:\tWHO Grade I subependymoma of fourth ventricle\n\nManagement:\t15 March 2023 - Subtotal resection\n\t\tApril-May 2023 - Post-operative radiotherapy 54Gy in 30 fractions\n\nCurrent Situation:\tRoutine surveillance\n\nI reviewed [redacted name] in the neuro-oncology follow-up clinic today. She remains clinically stable at 14 months post-completion of treatment. Her main symptoms of headache and dizziness have completely resolved. She reports good energy levels and has returned to work full-time as an accountant. No new neurological symptoms reported.\n\nOn examination, she is alert and fully oriented. Cranial nerves intact. No cerebellar signs. Gait normal.\n\nMRI brain performed last week shows stable post-treatment appearances with no evidence of disease progression. The small residual disease remains unchanged in size at 8mm.\n\nPlan is to continue surveillance with next MRI brain in 6 months and clinical review thereafter. Patient understands to contact us sooner if any new symptoms develop.",
  "output": {
    "primary_cancer": {
      "site": "brain, fourth ventricle",
      "year": 2023,
      "month": 3,
      "metastases": null,
      "tnm_stage": null,
      "other_stage": "WHO Grade I",
      "histopathology_status": "subependymoma",
      "biomarker_status": null,
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Subtotal resection",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Post-operative radiotherapy 54Gy in 30 fractions",
          "year": 2023,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows stable post-treatment appearances with residual disease unchanged at 8mm",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "quality_of_life_finding",
        "value": "Returned to work full-time as an accountant"
      },
      {
        "type": "examination_finding",
        "value": "Alert and fully oriented, cranial nerves intact, no cerebellar signs, normal gait"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "WHO Grade I subependymoma with small stable residual disease following surgery and radiotherapy. Clinically well at 14 months post-treatment with resolution of initial symptoms."
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable post-treatment appearances on MRI with unchanged 8mm residual disease"
      },
      {
        "type": "planned_investigation",
        "value": "MRI brain in 6 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinical review following MRI"
      }
    ]
  }
}