{
  "content": "Diagnosis:\tAnaplastic ganglioglioma WHO grade III, BRAF V600E mutant, TP53 mutant\n\tInitial diagnosis January 2024 with multifocal disease in right temporal and parietal lobes\n\tProgressive disease March 2024 with new left frontal lesion\n?\n[redacted name] is a 42-year-old gentleman with anaplastic ganglioglioma who has unfortunately shown disease progression despite initial treatment. He was diagnosed following presentation with focal seizures in January 2024, with MRI showing multiple lesions in the right temporal and parietal regions. Initial molecular profiling confirmed BRAF V600E and TP53 mutations. He underwent subtotal resection of the dominant right temporal lesion on 15/1/24, followed by concurrent chemoradiation with temozolomide which completed on 1/3/24.\n?\nUnfortunately, his surveillance MRI on 25/3/24 has shown enlargement of the residual right parietal lesion from 2.1cm to 3.4cm, with a new 1.8cm left frontal lesion. There is extensive surrounding FLAIR signal change and mass effect with 4mm midline shift. His dexamethasone requirement has increased from 4mg daily to 8mg daily over the past two weeks due to worsening headaches.\n?\nGiven the presence of the BRAF V600E mutation, I have discussed his case with the neuro-oncology MDT and we recommend commencing targeted therapy with Dabrafenib and Trametinib. I have explained the rationale, administration schedule and potential side effects in detail. We will arrange baseline cardiac assessment including echocardiogram and ECG prior to starting treatment.\n?\nThe plan is to proceed with combination targeted therapy once baseline investigations are complete, with close monitoring of clinical and radiological response. I have arranged weekly blood tests for the first month of treatment and a repeat MRI in 6 weeks. We will see him back in clinic in 2 weeks with his baseline cardiac investigations, and I have given clear instructions about side effects requiring urgent medical attention.\n?\nI have made a referral to the neuro-oncology specialist nurse team for additional support and education about the new treatment regimen. His anti-epileptic medications remain unchanged with good seizure control on levetiracetam 1g BD.",
  "output": {
    "primary_cancer": {
      "site": "brain, right temporal and parietal lobes",
      "year": 2024,
      "month": 1,
      "metastases": "new left frontal lesion",
      "other_stage": "WHO grade III",
      "histopathology_status": "anaplastic ganglioglioma",
      "biomarker_status": "BRAF V600E mutation positive, TP53 mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "subtotal resection of right temporal lesion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "commenced concurrent chemoradiation with temozolomide",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "completed concurrent chemoradiation with temozolomide",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows enlargement of residual right parietal lesion from 2.1cm to 3.4cm, new 1.8cm left frontal lesion, 4mm midline shift",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "worsening headaches requiring increased dexamethasone"
      },
      {
        "type": "investigation_finding",
        "value": "MRI 25/3/24 shows disease progression with extensive FLAIR signal change and mass effect"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "WHO grade III anaplastic ganglioglioma with progression after initial surgery and chemoradiation. New plan for targeted therapy based on BRAF mutation status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on MRI with enlarging and new lesions"
      },
      {
        "type": "update_to_treatment",
        "value": "Dexamethasone increased to 8mg daily from 4mg daily"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline cardiac assessment with echocardiogram and ECG, weekly blood tests, repeat MRI in 6 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with cardiac investigation results, referral to neuro-oncology nurse specialist team"
      }
    ]
  }
}