{
  "content": "I reviewed [redacted name] today in our neuro-oncology clinic following completion of cycle 4 of temozolomide chemotherapy. She was initially diagnosed in January 2024 following presentation with focal seizures, when MRI demonstrated multiple intracerebral lesions. Histopathological analysis of the right frontal lesion biopsy confirmed WHO grade IV astroblastoma with MN1 gene alteration detected on molecular analysis.\n\nFollowing maximal safe resection of the right frontal lesion on 15th January 2024, she completed a six-week course of concurrent chemoradiotherapy with temozolomide (60Gy in 30 fractions) which concluded on March 1st 2024. She then commenced adjuvant temozolomide at 150mg/m2 D1-5 q28 days from March 22nd 2024.\n\nI am pleased to report that she has tolerated treatment remarkably well. Her initial fatigue during the concurrent phase has largely resolved, and she has experienced only grade 1 nausea with the adjuvant cycles, well-controlled with standard antiemetics. Her seizures remain well-controlled on levetiracetam 1g BD. She describes occasional mild headaches but no new neurological symptoms. Her most recent MRI on April 15th 2024 showed stable disease with no enhancement of the surgical cavity and stable appearance of the other lesions. Her performance status remains excellent at ECOG 1.\n\nOn examination today, she is alert and fully oriented. Her cranial nerve examination is normal. There is mild right-sided weakness (power 4+/5) which is unchanged from previous reviews. Coordination and gait are normal.\n\nHer blood results today show stable full blood count with platelets 156, neutrophils 2.8, and satisfactory renal and liver function. Given her excellent tolerance and stable disease, we will proceed with cycle 5 of adjuvant temozolomide at the same dose. She will have a further MRI brain prior to cycle 6, and we will review her again in 4 weeks with these results to determine the optimal duration of adjuvant therapy.",
  "output": {
    "primary_cancer": {
      "site": "brain, multiple lesions including right frontal lobe",
      "year": 2024,
      "month": 1,
      "metastases": "multiple intracerebral lesions",
      "other_stage": "WHO grade IV",
      "histopathology_status": "astroblastoma",
      "biomarker_status": "MN1 gene alteration detected",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Presented with focal seizures",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Maximal safe resection of right frontal lesion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent chemoradiotherapy with temozolomide",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed radiotherapy 60Gy in 30 fractions with concurrent temozolomide",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant temozolomide 150mg/m2 D1-5 q28 days",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows stable disease with no enhancement of surgical cavity and stable appearance of other lesions",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 1"
      },
      {
        "type": "current_symptom",
        "value": "Occasional mild headaches"
      },
      {
        "type": "examination_finding",
        "value": "Alert and fully oriented, normal cranial nerves, mild right-sided weakness (power 4+/5), normal coordination and gait"
      },
      {
        "type": "investigation_finding",
        "value": "Stable blood count with platelets 156, neutrophils 2.8, satisfactory renal and liver function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "WHO grade IV astroblastoma with multiple brain lesions. Stable disease on adjuvant temozolomide with good tolerability"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 nausea well-controlled with antiemetics"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 5 adjuvant temozolomide at same dose"
      },
      {
        "type": "planned_investigation",
        "value": "MRI brain prior to cycle 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 4 weeks with MRI results to determine optimal duration of adjuvant therapy"
      }
    ]
  }
}