{
  "content": "Diagnosis:\tWHO Grade III clear cell ependymoma with ventricular dissemination\n\nInitially diagnosed March 2023 following presentation with hydrocephalus. Primary tumour in posterior fossa with spread to lateral and third ventricles on initial imaging. L1CAM positive on molecular testing. Initial treatment with posterior fossa craniotomy and tumour debulking April 2023, followed by CSI radiotherapy 36Gy in 20 fractions with posterior fossa boost completed June 2023.\n\n[redacted name] has unfortunately shown evidence of progressive disease over the past 8 weeks with worsening ataxia, headaches, and intermittent confusion. Recent MRI from 15/4/24 shows new nodular enhancement along the ependymal surface of both lateral ventricles with associated mass effect and early signs of hydrocephalus. There is also progression of residual disease in the posterior fossa.\n\nShe has deteriorated significantly since our last review 3 weeks ago. Her performance status has declined from 1 to 3, now spending most of the day in bed or chair. She requires assistance with most activities of daily living and reports severe fatigue. Her husband has taken leave from work to help with her care. She is experiencing daily headaches despite increased dexamethasone (now on 8mg bd), with associated steroid-induced diabetes requiring metformin.\n\nOn examination today, there is marked truncal ataxia with broad-based gait requiring two-person assistance. New bilateral papilloedema is present. Cranial nerve examination shows new right sixth nerve palsy. Mini mental state examination score is 22/30 (previously 28/30).\n\nI have discussed her case with our neuro-oncology MDT. Given the aggressive progression and poor response to first-line treatment, we recommend consideration of salvage chemotherapy with temozolomide. I have had a detailed discussion with [redacted name] and her husband about the aims of further treatment, likely prognosis, and importance of quality of life. They wish to proceed with chemotherapy while maintaining realistic expectations.\n\nPlan:\n1. Commence temozolomide 150mg/m2 D1-5 q28 days\n2. Urgent neurosurgical review regarding possible VP shunt for hydrocephalus\n3. Referral to hospital palliative care team for symptom management\n4. Increase dexamethasone to 12mg bd with PPI cover\n5. Weekly blood sugar monitoring by GP\n6. MRI brain in 8 weeks to assess response\n7. Review in 2 weeks with blood results prior to cycle 2",
  "output": {
    "primary_cancer": {
      "site": "brain, posterior fossa",
      "year": 2023,
      "month": 3,
      "metastases": "spread to lateral and third ventricles",
      "other_stage": "WHO Grade III",
      "histopathology_status": "clear cell ependymoma",
      "biomarker_status": "L1CAM positive",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial presentation with hydrocephalus",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Posterior fossa craniotomy and tumour debulking",
          "year": 2023,
          "month": 4
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed CSI radiotherapy 36Gy in 20 fractions with posterior fossa boost",
          "year": 2023,
          "month": 6
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows new nodular enhancement along ependymal surface of both lateral ventricles with mass effect and early hydrocephalus, progression of posterior fossa disease",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Plan to commence temozolomide 150mg/m2 D1-5 q28 days",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 3, spending most of day in bed or chair"
      },
      {
        "type": "current_symptom",
        "value": "Daily headaches despite dexamethasone 8mg bd"
      },
      {
        "type": "current_symptom",
        "value": "Severe fatigue requiring assistance with most activities"
      },
      {
        "type": "examination_finding",
        "value": "Marked truncal ataxia with broad-based gait requiring two-person assistance"
      },
      {
        "type": "examination_finding",
        "value": "Bilateral papilloedema and right sixth nerve palsy"
      },
      {
        "type": "examination_finding",
        "value": "Mini mental state examination score 22/30"
      },
      {
        "type": "comorbidity",
        "value": "Steroid-induced diabetes requiring metformin"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "WHO Grade III ependymoma showing aggressive progression with new ventricular disease and clinical deterioration. Transitioning to salvage chemotherapy with concurrent palliative care support."
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status from 1 to 3 over past 3 weeks"
      },
      {
        "type": "update_to_treatment",
        "value": "Increasing dexamethasone to 12mg bd with PPI cover"
      },
      {
        "type": "planned_investigation",
        "value": "MRI brain in 8 weeks to assess response"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent neurosurgical review for possible VP shunt, referral to hospital palliative care team, review in 2 weeks pre-cycle 2"
      }
    ]
  }
}