{
  "content": "Diagnosis:\tGrade 4 gliosarcoma with multiple intracranial lesions\n\nI reviewed [redacted name] today in the neuro-oncology clinic, accompanied by his wife and daughter. Unfortunately, his most recent MRI from 15th April 2024 shows significant progression of disease with enlargement of the right temporal lesion from 4.2cm to 5.8cm, despite completing 6 weeks of concurrent chemoradiation with temozolomide in February 2024. There are also two new enhancing lesions in the right parietal lobe measuring 2.1cm and 1.8cm respectively.\n\nHis clinical condition has deteriorated significantly over the past three weeks. His left-sided weakness has worsened, now affecting both upper and lower limbs (MRC grade 3/5), and he requires a wheelchair for mobility outside the house. His speech remains fluent but he reports increasing word-finding difficulties. He is experiencing more frequent headaches despite increasing his dexamethasone to 8mg twice daily two weeks ago. His wife reports he is sleeping more during the day and becoming increasingly confused in the evenings.\n\nHis performance status has declined from 1 to 3. On examination today, he is alert but disorientated to time. There is obvious left-sided facial weakness and pronounced left hemiparesis. Reflexes are brisk on the left with positive Babinski sign. Recent blood tests show stable renal and liver function, though his random glucose has been elevated at 11.2 due to the increased steroid dose.\n\nGiven the rapid progression through first-line treatment and declining performance status, I have had a detailed discussion with [redacted name] and his family about changing our approach. We have agreed to commence second-line treatment with lomustine (CCNU) chemotherapy at a dose of 110mg/m2 every 6 weeks. I have explained this is less intensive than the previous regimen but still carries risks of myelosuppression and fatigue. The aims are to slow disease progression and manage symptoms, though I have been clear about the guarded prognosis.\n\nI have arranged weekly blood count monitoring through our community team and referred to the palliative care team for additional support with symptom management. I have also increased his levetiracetam to 1g twice daily given his recent focal seizures. We will repeat his MRI after two cycles of lomustine to assess response. I will review him again in 3 weeks' time, sooner if needed.\n?\n",
  "output": {
    "primary_cancer": {
      "site": "brain, right temporal lobe",
      "histopathology_status": "Grade 4 gliosarcoma",
      "biomarker_status": "EGFR amplified; p53 mutant",
      "metastases": "multiple intracranial lesions including two right parietal lesions",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Completed 6 weeks concurrent chemoradiation with temozolomide",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows progression with right temporal lesion increased from 4.2cm to 5.8cm, two new right parietal lesions 2.1cm and 1.8cm",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Switching to second-line lomustine (CCNU) 110mg/m2 every 6 weeks due to disease progression",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3"
      },
      {
        "type": "current_symptom",
        "value": "Left-sided weakness MRC grade 3/5 affecting upper and lower limbs"
      },
      {
        "type": "current_symptom",
        "value": "Word-finding difficulties"
      },
      {
        "type": "current_symptom",
        "value": "Increasing headaches despite dexamethasone 8mg twice daily"
      },
      {
        "type": "current_symptom",
        "value": "Evening confusion"
      },
      {
        "type": "examination_finding",
        "value": "Alert but disorientated to time, left-sided facial weakness, left hemiparesis, brisk reflexes on left with positive Babinski"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal and liver function, elevated random glucose 11.2"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Grade 4 gliosarcoma progressing through first-line chemoradiation with significant clinical deterioration. Switching to second-line lomustine with palliative intent"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on MRI despite completing concurrent chemoradiation"
      },
      {
        "type": "update_to_treatment",
        "value": "Commencing lomustine 110mg/m2 every 6 weeks, increased levetiracetam to 1g twice daily"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline requiring wheelchair use, increasing confusion and neurological deficits"
      },
      {
        "type": "planned_investigation",
        "value": "Weekly blood count monitoring and MRI after two cycles of lomustine"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 3 weeks, referred to palliative care team for symptom management"
      }
    ]
  }
}