{
  "content": "Diagnosis:\tRight breast adenoid cystic carcinoma, triple negative, BRCA1 positive\n\nManagement:\t2023 Primary systemic chemotherapy - FEC-T\n\t\tJan 2024 Right mastectomy and axillary clearance\n\t\tMarch 2024 Commenced carboplatin/gemcitabine\n\nHistology:\tGrade 3 adenoid cystic carcinoma, triple negative breast cancer\n\t\tpT4 N3 (12/15 nodes positive)\n\t\tLymphovascular invasion present\n\nCurrent Situation:\tProgressive liver metastases on cycle 2 carboplatin/gemcitabine\n\nI reviewed [redacted name] today who attended with her sister. Unfortunately, she has experienced significant clinical deterioration over the past three weeks. Her performance status has declined from 1 to 3, and she now requires assistance with most daily activities. She describes worsening right upper quadrant pain requiring increased doses of oxycodone, now taking 40mg every 4 hours. She has developed peripheral edema extending to her thighs, and her appetite has significantly decreased with 4kg weight loss over 2 weeks.\n\nHer latest CT scan from 15/4/24 shows progressive disease with increase in size and number of liver metastases, largest lesion now measuring 8.2cm compared to 5.6cm six weeks ago. There is also new moderate volume ascites. Blood tests show deteriorating liver function with bilirubin 45, ALT 156, ALP 432.\n\nGiven the rapid progression through platinum-based chemotherapy and declining performance status, I have had a detailed discussion with [redacted name] about focusing on symptom control and quality of life. We have agreed to discontinue systemic anti-cancer therapy and I have made an urgent referral to the palliative care team. I have increased her oxycodone to 60mg every 4 hours and added metoclopramide for nausea.\n\nI have arranged admission to [redacted name] Hospice for symptom management and support. The palliative care team will review her tomorrow, and I have provided my direct contact details to the hospice team. I have also referred to the ascitic drainage service for consideration of therapeutic paracentesis if clinically appropriate.\n\nI have explained the situation carefully to [redacted name] and her sister, who understand that the focus of care is now on comfort and symptom control. They have my direct contact details if needed before the hospice admission is arranged.",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "year": 2023,
      "histopathology_status": "Grade 3 adenoid cystic carcinoma",
      "tnm_stage": "pT4N3",
      "other_stage": "Stage 3c",
      "biomarker_status": "Triple negative, BRCA1 positive",
      "metastases": "Progressive liver metastases with ascites",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced primary systemic chemotherapy FEC-T",
          "year": 2023
        },
        {
          "type": "treatment_surgery",
          "value": "Right mastectomy and axillary clearance, 12/15 nodes positive with lymphovascular invasion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced carboplatin/gemcitabine",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progressive liver metastases, largest lesion increased from 5.6cm to 8.2cm, new moderate volume ascites",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Deteriorating liver function with bilirubin 45, ALT 156, ALP 432",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued systemic anti-cancer therapy due to disease progression and declining performance status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3, requiring assistance with most daily activities"
      },
      {
        "type": "current_symptom",
        "value": "Worsening right upper quadrant pain requiring oxycodone 40mg every 4 hours"
      },
      {
        "type": "current_symptom",
        "value": "Peripheral edema extending to thighs"
      },
      {
        "type": "current_symptom",
        "value": "Decreased appetite with 4kg weight loss over 2 weeks"
      },
      {
        "type": "investigation_finding",
        "value": "CT 15/4/24 shows progressive liver metastases and new ascites"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Triple negative breast cancer with rapidly progressive liver metastases. Disease progression through platinum-based chemotherapy with significant clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease with increasing liver metastases and new ascites"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued systemic anti-cancer therapy, increased oxycodone to 60mg every 4 hours, added metoclopramide"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status, now requiring assistance with most daily activities"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and arranged admission to hospice for symptom management"
      }
    ]
  }
}