{
  "content": "Diagnosis:\tBilateral inflammatory breast cancer - spindle cell carcinoma\n\nManagement:\tJan 2024 - Started carboplatin/gemcitabine/pembrolizumab\n\t\tFeb 2024 - Whole brain radiotherapy for multiple cerebral metastases\n\t\tMarch 2024 - Changed to weekly paclitaxel due to disease progression\n\nHistology:\tGrade 3 spindle cell carcinoma, T4d N3c M1\n\tPDL1 positive (85% CPS), LAG3 positive, high TILs?\n\nCurrent Situation:\tProgressive disease with deteriorating symptoms\n\nI met with [redacted name] today, who was accompanied by her daughter and husband. I am deeply concerned about her rapid clinical deterioration over the past three weeks. Despite initially showing some response to carboplatin/gemcitabine/pembrolizumab, she has unfortunately developed progressive disease across multiple sites. The inflammatory changes in both breasts have worsened significantly, with increased erythema and skin nodularity. She is experiencing increasing breathlessness due to progressive liver metastases and pleural effusions, requiring oxygen support at 2L/min at rest.\n\nHer main symptoms are severe bone pain affecting her thoracic spine and left hip, requiring recent increases in her opiate medications. She is now taking MST 60mg twice daily and using Oramorph frequently for breakthrough pain. The brain metastases are causing increasing headaches despite completing whole brain radiotherapy in February, though thankfully there are no focal neurological deficits.\n\nUnfortunately, her recent CT scan from last week shows clear disease progression with increasing size and number of liver metastases, new pulmonary nodules, and progression of bone metastases. Her performance status has declined to ECOG 3, spending more than 50% of time in bed. She is requiring increasing support at home with activities of daily living.\n\nAfter careful discussion with [redacted name] and her family, we have agreed to commence weekly paclitaxel as third-line therapy, with appropriate dose reduction given her current performance status. I have arranged urgent referral to our palliative care team for optimization of symptom control, particularly her pain management. We have also discussed hospice support, which she would like to explore.\n\nI have organized weekly review in our nurse-led clinic during treatment, with medical review in 3 weeks. The acute oncology team are aware of her situation and will provide additional support as needed. I have also arranged urgent CT brain to assess intracranial disease progression given her worsening headaches.\n\nPlease do not hesitate to contact us if there are any concerns in the interim.",
  "output": {
    "primary_cancer": {
      "site": "breast bilateral",
      "year": 2024,
      "month": 1,
      "metastases": "brain, bone, liver, pulmonary nodules, pleural effusions",
      "tnm_stage": "T4d N3c M1",
      "other_stage": null,
      "histopathology_status": "Grade 3 spindle cell carcinoma",
      "biomarker_status": "PDL1 positive (85% CPS), LAG3 positive, high TILs",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started carboplatin/gemcitabine/pembrolizumab",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Whole brain radiotherapy for multiple cerebral metastases",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Changed to weekly paclitaxel due to disease progression",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows increasing size and number of liver metastases, new pulmonary nodules, and progression of bone metastases",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, spending more than 50% of time in bed"
      },
      {
        "type": "current_symptom",
        "value": "Severe bone pain affecting thoracic spine and left hip"
      },
      {
        "type": "current_symptom",
        "value": "Increasing breathlessness requiring oxygen support at 2L/min at rest"
      },
      {
        "type": "current_symptom",
        "value": "Increasing headaches from brain metastases"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requiring increasing support at home with activities of daily living"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Bilateral inflammatory breast cancer with widespread metastases showing rapid progression despite initial immunotherapy. Significant clinical deterioration with worsening symptoms requiring treatment change"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease across multiple sites including liver, lungs, and bones"
      },
      {
        "type": "update_to_treatment",
        "value": "Commencing weekly paclitaxel with dose reduction as third-line therapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing dependence on others"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent CT brain to assess intracranial disease progression"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly nurse-led clinic during treatment with medical review in 3 weeks, urgent palliative care referral made"
      }
    ]
  }
}