{
  "content": "Many thanks for referring [redacted name] for MDT discussion regarding management of her metastatic breast adenomyoepithelioma. She was initially diagnosed in January 2024 following investigation of a right breast mass with associated skin changes and axillary lymphadenopathy. Core biopsy confirmed adenomyoepithelioma, grade 3, with immunohistochemistry showing strong ER (8/8) and PR (7/8) positivity, HER2 negative. Molecular testing has identified a PIK3CA mutation. Initial staging showed extensive right axillary and supraclavicular nodal involvement, and a solitary bone metastasis in the T8 vertebral body.\n\nShe commenced primary endocrine therapy with Letrozole and the PIK3CA inhibitor Alpelisib in February. She experienced significant mucositis requiring temporary dose reduction of Alpelisib to 200mg daily, but has now been re-escalated to full dose with good tolerance. Recent clinical assessment shows excellent response in the breast primary with softening of the mass and resolution of skin changes. CT imaging last week demonstrated partial response in nodal disease with reduction in size of all target lesions, and stable appearance of the T8 vertebral metastasis.\n\nThe case was discussed at today's Breast MDT with input from medical oncology, clinical oncology, breast surgery, and radiology teams. The consensus recommendation, given the excellent response to current therapy, is to continue with Letrozole and Alpelisib. We would recommend consideration of consolidation radiotherapy to the T8 vertebral metastasis, and the breast and nodal regions, once maximal response to systemic therapy has been achieved. The patient will be reviewed in combined clinic next week to discuss these recommendations.\n\nBlood tests show stable renal and liver function. Recent bone density scan shows osteopenia but no evidence of other bone metastases. She continues to experience grade 1 mucositis which is managed with regular mouth care, but otherwise tolerating treatment well with maintenance of good performance status.\n\nThe plan is to continue current systemic therapy with monthly reviews, repeat CT chest/abdomen/pelvis in 3 months, and consideration of radiotherapy planning at that point if continued good response. We will keep you informed of her progress.",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "year": 2024,
      "month": 1,
      "metastases": "extensive right axillary and supraclavicular nodal involvement, solitary T8 vertebral body metastasis",
      "other_stage": "Stage 3c",
      "tnm_stage": "T4N3",
      "histopathology_status": "adenomyoepithelioma, grade 3",
      "biomarker_status": "ER positive (8/8), PR positive (7/8), HER2 negative, PIK3CA mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Presentation with right breast mass with skin changes and axillary lymphadenopathy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "Core biopsy confirms adenomyoepithelioma, ER/PR positive, HER2 negative, PIK3CA mutation",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Letrozole and Alpelisib",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Alpelisib dose reduced to 200mg daily due to mucositis",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Alpelisib re-escalated to full dose with improved tolerance",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows partial response in nodal disease, stable T8 vertebral metastasis",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 1 mucositis managed with regular mouth care"
      },
      {
        "type": "investigation_finding",
        "value": "Bone density scan shows osteopenia without other bone metastases"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal and liver function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic breast adenomyoepithelioma showing good response to Letrozole and Alpelisib with partial response in breast and nodes, stable bone metastasis"
      },
      {
        "type": "latest_treatment_response",
        "value": "Excellent response in breast primary with softening of mass and resolution of skin changes, partial response in nodal disease"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Ongoing grade 1 mucositis, managed with mouth care"
      },
      {
        "type": "update_to_treatment",
        "value": "Continue Letrozole and full-dose Alpelisib"
      },
      {
        "type": "planned_investigation",
        "value": "CT chest/abdomen/pelvis in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in combined clinic next week to discuss MDT recommendations including potential consolidation radiotherapy"
      }
    ]
  }
}