{
  "content": "Diagnosis\n\t1. Right breast cancer - clear cell variant\n\tDate of diagnosis\n\tJanuary 2024\n\n\tTreatment aim\n\tCurative\n\n\tSummary of completed treatment and relevant dates\n\n\tSurgery\n\t15 Jan 2024 Right wide local excision and sentinel lymph node biopsy\n\n\tChemotherapy\n\tCommenced TCHP protocol 01 Feb 2024\n\n\tClinical studies\n\tNone\n\n\tCurrent disease status\n\tNo evidence of disease\n\n\tCurrent issues\n\tGrade 3 diarrhea, Grade 2 peripheral neuropathy\n\n\tSummary of consultation\n\tI was very pleased to review [redacted name] today who has been managing remarkably well with her treatment journey despite some significant challenges. She has completed 4 cycles of TCHP (Docetaxel, Carboplatin, Trastuzumab, Pertuzumab) chemotherapy for her HER2-positive breast cancer. While she has shown tremendous resilience throughout, she has unfortunately developed quite severe diarrhea (Grade 3) over the past week, requiring temporary hospital admission for IV fluids. She has also noticed increasing tingling and numbness in her fingers and toes (Grade 2 peripheral neuropathy).\n\nOn examination today, she appears somewhat dehydrated but maintaining oral intake. There is no evidence of local recurrence in the right breast. The surgical site has healed well. Her performance status remains 1 despite these toxicities.\n\nGiven these significant side effects, and after careful discussion with [redacted name] and the breast MDT, we have agreed to modify her treatment plan. We will discontinue the Docetaxel and Carboplatin components but continue with the targeted therapies (Trastuzumab and Pertuzumab) to complete her planned 6 cycles.\n\n\tFurther investigations\n\tECHO arranged for 25 April 2024\n\n\tMedication prescribed\n\tLoperamide for diarrhea management\n\n\tFollow up\n\tNext oncology follow up in 3 weeks with ECHO results\n\n\tRequired GP actions\n\tWeekly monitoring of U&Es until diarrhea resolves\n\n\tSummary of information given to the patient\n\tDiscussed treatment modification plan and management of current side effects. Written information provided regarding peripheral neuropathy management.",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "year": 2024,
      "month": 1,
      "histopathology_status": "clear cell variant",
      "tnm_stage": "T2N1miM0",
      "biomarker_status": "ER negative, PR negative, HER2 positive (3+), LAG3 positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right wide local excision and sentinel lymph node biopsy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started TCHP protocol (Docetaxel, Carboplatin, Trastuzumab, Pertuzumab)",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing Docetaxel and Carboplatin components due to Grade 3 diarrhea and Grade 2 peripheral neuropathy, continuing Trastuzumab and Pertuzumab",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "examination_finding",
        "value": "Appears somewhat dehydrated, surgical site well healed, no evidence of local recurrence"
      },
      {
        "type": "current_symptom",
        "value": "Grade 3 diarrhea requiring hospital admission"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 peripheral neuropathy affecting fingers and toes"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "HER2+ breast cancer on neoadjuvant TCHP. Treatment modification required due to significant toxicities after 4 cycles."
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 diarrhea requiring hospital admission, Grade 2 peripheral neuropathy"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing Docetaxel and Carboplatin, continuing Trastuzumab and Pertuzumab to complete planned 6 cycles"
      },
      {
        "type": "planned_investigation",
        "value": "ECHO arranged for 25 April 2024"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 3 weeks with ECHO results"
      }
    ]
  }
}