{
  "content": "Diagnosis:\t\tLeft breast cancer - mixed tubular/lobular carcinoma\n\nManagement:\t\tDiagnostic core biopsy 15 Apr 2024\n\nHistology:\t\tGrade 2 mixed tubular/lobular carcinoma\n\t\tER 2/8, PR 0/8, HER2 negative\n\t\tStage pT1c (18mm) N0 M0\n\nCurrent situation:\tNew diagnosis, for discussion of adjuvant therapy\n\n[redacted name] attended breast oncology clinic today following recent diagnosis of early breast cancer. She underwent diagnostic biopsy on 15/4/24 following screening mammogram. She is otherwise well with no significant past medical history. Performance status is 0. She takes no regular medications and has no drug allergies. The surgical plan is for wide local excision and sentinel node biopsy, scheduled for 2/5/24.\n\nI have discussed the role of adjuvant therapy. Given the low ER expression and negative PR/HER2 status, chemotherapy would be recommended following surgery. We will review her again with final surgical pathology to confirm the treatment plan. I have provided written information about chemotherapy today.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 4,
      "metastases": "",
      "tnm_stage": "pT1cN0M0",
      "other_stage": "Stage IB",
      "histopathology_status": "Grade 2 mixed tubular/lobular carcinoma",
      "biomarker_status": "ER 2/8 positive, PR negative, HER2 negative",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Diagnostic core biopsy confirms Grade 2 mixed tubular/lobular carcinoma, 18mm, ER 2/8, PR 0/8, HER2 negative",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 0"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "New diagnosis of early stage left breast cancer. Initial assessment for adjuvant therapy planning."
      },
      {
        "type": "update_to_treatment",
        "value": "Planned for wide local excision and sentinel node biopsy on 2/5/24"
      },
      {
        "type": "follow_up_referral",
        "value": "To review following surgery with final pathology to confirm adjuvant treatment plan"
      }
    ]
  }
}