{
  "content": "Diagnosis:\tLeft breast cancer - mixed tubular/cribriform carcinoma, Grade 1, pT2N0M0 (Stage IIA)\n\tER 95%, PR 90%, HER2 2+ (FISH negative)\n\tDiagnosed March 2024\n\nI reviewed [redacted name] today for assessment during her adjuvant chemotherapy. She underwent left wide local excision and sentinel lymph node biopsy on 15/3/24, followed by completion axillary dissection on 28/3/24 after finding a positive sentinel node on frozen section. Final histology showed a 2.8cm Grade 1 mixed tubular/cribriform carcinoma with 1/4 positive sentinel nodes but 0/12 additional nodes on completion dissection.\n\nShe is currently receiving adjuvant FEC chemotherapy and has completed 2 cycles. The first cycle was complicated by grade 2 neutropenia requiring a 5-day delay to cycle 2, but otherwise she has managed well with only grade 1 nausea and mild fatigue. Her surgical wounds have healed well with no evidence of lymphoedema. She continues gentle arm exercises as advised by the physiotherapist.\n\nOn examination today there is no evidence of local recurrence. The left breast surgical site shows expected post-operative changes. There is good shoulder movement and no axillary lymphadenopathy.\n\nBlood results show recovery of neutrophils to 1.8 and normal liver function. The plan is to proceed with cycle 3 FEC today at 100% doses with primary GCSF prophylaxis. We will review again before cycle 4, with cardiac MUGA scan booked prior to switching to Docetaxel. Following chemotherapy she will proceed to adjuvant radiotherapy and then start endocrine therapy with Letrozole.\n\nI have prescribed antiemetics and provided written information about GCSF administration. [redacted name] understands to contact the acute oncology service if she develops fever or other concerning symptoms.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 3,
      "tnm_stage": "pT2N0M0",
      "other_stage": "Stage IIA",
      "histopathology_status": "Grade 1 mixed tubular/cribriform carcinoma",
      "biomarker_status": "ER 95%, PR 90%, HER2 2+ (FISH negative)",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Left wide local excision and sentinel lymph node biopsy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Completion axillary dissection - 0/12 additional nodes",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "1/4 positive sentinel nodes on frozen section",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant FEC chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cycle 2 delayed by 5 days due to grade 2 neutropenia",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 1 nausea and mild fatigue"
      },
      {
        "type": "examination_finding",
        "value": "No evidence of local recurrence, expected post-operative changes, good shoulder movement, no axillary lymphadenopathy"
      },
      {
        "type": "investigation_finding",
        "value": "Neutrophils 1.8, normal liver function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early stage breast cancer post-surgery, currently receiving adjuvant FEC chemotherapy with initial neutropenia but otherwise good tolerance"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 neutropenia with first cycle, grade 1 nausea"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 3 FEC at 100% doses with primary GCSF prophylaxis"
      },
      {
        "type": "planned_investigation",
        "value": "Cardiac MUGA scan before switching to Docetaxel"
      },
      {
        "type": "follow_up_referral",
        "value": "Review before cycle 4 chemotherapy"
      }
    ]
  }
}