{
  "content": "Diagnosis:\tInvasive ductal carcinoma right breast with associated DCIS\n\nManagement:\t12 Apr 2024 Wide local excision and sentinel lymph node biopsy\n\nHistology:\tGrade 2 invasive ductal carcinoma, 8mm focus with surrounding intermediate grade DCIS. Complete excision with clear margins (>5mm). 0/2 sentinel nodes involved. Stage pT1aN0M0.\n\tER 8/8, PR 7/8, HER2 positive (3+), Ki67 30%\n\nCurrent Situation:\tPost-operative review and treatment planning\n\nI reviewed [redacted name] today following her recent breast surgery. She has made an excellent recovery from her operation with good wound healing and no post-operative complications. The surgical site shows minimal tenderness and good cosmetic outcome. She has regained full range of movement in her right arm with no evidence of lymphoedema or axillary complications.\n\nWe had a detailed discussion about adjuvant treatment recommendations. Given her HER2 positive status and relatively high Ki67 despite the small tumor size, I have recommended adjuvant chemotherapy with docetaxel/carboplatin plus trastuzumab and pertuzumab (TCHP regimen). This would comprise 6 cycles of chemotherapy followed by completion of one year of anti-HER2 therapy. Following this, she would benefit from 5 years of endocrine therapy given the strong hormone receptor positivity.\n\nShe will also require adjuvant radiotherapy to the right breast, which will be arranged following completion of chemotherapy. I have explained the rationale and timing of these treatments, along with potential side effects and supportive measures available.\n\n[redacted name] was understandably anxious about starting chemotherapy but expressed good understanding of the recommendations. She has good support from her husband who attended today's consultation.\n\nThe plan is to proceed with cardiac assessment and PICC line insertion next week. Provided these are satisfactory, we will commence cycle 1 TCHP chemotherapy in 10 days' time. I have arranged review with our breast care nurse specialist tomorrow for further support and practical arrangements.\n\nWe will see her again prior to cycle 1 chemotherapy to address any remaining questions and provide written information about the treatment plan.",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "year": 2024,
      "month": 4,
      "metastases": null,
      "tnm_stage": "pT1aN0M0",
      "histopathology_status": "Grade 2 invasive ductal carcinoma, 8mm focus with surrounding intermediate grade DCIS, clear margins >5mm, 0/2 sentinel nodes",
      "biomarker_status": "ER 8/8, PR 7/8, HER2 positive (3+), Ki67 30%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision and sentinel lymph node biopsy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Grade 2 invasive ductal carcinoma, 8mm with clear margins. 0/2 nodes. ER/PR positive, HER2 positive",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Good wound healing, minimal tenderness at surgical site"
      },
      {
        "type": "examination_finding",
        "value": "Full range of movement in right arm, no lymphoedema"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early stage HER2+ breast cancer post successful surgery. Planning to commence adjuvant TCHP chemotherapy followed by anti-HER2 therapy and radiotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for 6 cycles TCHP chemotherapy followed by completion of one year anti-HER2 therapy and 5 years endocrine therapy"
      },
      {
        "type": "planned_investigation",
        "value": "Cardiac assessment and PICC line insertion next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Breast care nurse specialist review tomorrow, oncology review pre-cycle 1 chemotherapy in 10 days"
      }
    ]
  }
}