{
  "content": "Many thanks for referring [redacted name] who I reviewed today with her husband present. She has unfortunately experienced disease progression of her bilateral breast cancer, initially diagnosed in January 2024. The original presentation was with inflammatory changes affecting both breasts, more marked on the right, with associated axillary and supraclavicular lymphadenopathy. Biopsies confirmed bilateral adenomyoepithelial carcinoma, triple positive with high Ki67 of 85%. Initial staging demonstrated widespread pulmonary metastases.\n\nShe commenced treatment with dual HER2-targeted therapy (Pertuzumab/Trastuzumab) combined with Docetaxel in February 2024. Unfortunately, after cycle 2, she developed significant dyspnoea requiring emergency admission. CT demonstrated disease progression with increasing pulmonary metastases and new pleural effusions. Treatment was changed to TDM-1 in March 2024, but she experienced grade 3 hepatotoxicity requiring dose reduction. Despite this modification, repeat imaging in April 2024 showed further progression.\n\nOf note, she also has a history of papillary thyroid cancer treated with total thyroidectomy in 2018, currently in remission on thyroid replacement.\n\nShe presents today with worsening breathlessness, now requiring 3L oxygen at rest. Her performance status has deteriorated to ECOG 3. Examination reveals decreased air entry bilaterally with dullness to percussion at both bases. The inflammatory changes in both breasts have worsened, with marked skin thickening and erythema. There is now fixed lymphadenopathy in both axillae and supraclavicular regions.\n\nGiven the rapid progression through two lines of HER2-directed therapy and declining performance status, we had a detailed discussion about treatment options. We have agreed to commence oral Capecitabine with continued Trastuzumab, at a reduced starting dose given her current condition. I have arranged urgent pleural aspiration for symptom relief and referred to the palliative care team for additional support with symptom management. We will review her weekly initially to monitor tolerability.\n\nI have also requested repeat CT chest/abdomen/pelvis to fully re-stage disease and arranged for her to see our lymphoedema specialist given the marked arm swelling. She understands to contact us immediately if she experiences increasing breathlessness or new symptoms.",
  "output": {
    "primary_cancer": {
      "site": "breast bilateral",
      "year": 2024,
      "month": 1,
      "metastases": "widespread pulmonary metastases, pleural effusions, axillary and supraclavicular lymphadenopathy",
      "tnm_stage": "T4dN3",
      "histopathology_status": "adenomyoepithelial carcinoma",
      "biomarker_status": "triple positive, Ki67 85%",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Pertuzumab/Trastuzumab with Docetaxel",
          "year": 2024,
          "month": 2
        },
        {
          "type": "other_progress_or_event",
          "value": "Emergency admission with dyspnoea",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT showing disease progression with increasing pulmonary metastases and new pleural effusions",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Changed to TDM-1 due to disease progression",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "TDM-1 dose reduction required due to grade 3 hepatotoxicity",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Imaging showing further disease progression",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [
      {
        "site": "thyroid",
        "year": 2018,
        "histopathology_status": "papillary thyroid cancer",
        "latest_situation": "in remission on thyroid replacement following total thyroidectomy"
      }
    ],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3"
      },
      {
        "type": "current_symptom",
        "value": "worsening breathlessness requiring 3L oxygen at rest"
      },
      {
        "type": "examination_finding",
        "value": "decreased air entry bilaterally with dullness to percussion at both bases"
      },
      {
        "type": "examination_finding",
        "value": "worsened inflammatory changes in both breasts with marked skin thickening and erythema"
      },
      {
        "type": "examination_finding",
        "value": "fixed lymphadenopathy in both axillae and supraclavicular regions"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Bilateral inflammatory breast cancer with pulmonary metastases showing rapid progression through two lines of HER2-directed therapy with declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on TDM-1 with worsening pulmonary disease and inflammatory breast changes"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 hepatotoxicity with TDM-1 requiring dose reduction"
      },
      {
        "type": "update_to_treatment",
        "value": "Starting Capecitabine with continued Trastuzumab at reduced dose"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing oxygen requirements"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent pleural aspiration and repeat CT chest/abdomen/pelvis"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review arranged, referral to palliative care and lymphoedema specialist"
      }
    ]
  }
}