{
  "content": "Many thanks for referring [redacted name] who I reviewed today with her daughter present. She has unfortunately experienced disease progression of her triple negative myoepithelial breast cancer, originally diagnosed in January 2024. The initial presentation was with a 6.5cm left breast mass with axillary lymphadenopathy, and staging investigations revealed synchronous liver and bone metastases. Molecular profiling showed AR positivity, FGFR amplification, and HER2 positivity (3+ on IHC), with negative ER/PR status.\n\nShe initially commenced first-line treatment with docetaxel/trastuzumab/pertuzumab in February 2024, completing 4 cycles before evidence of progression in April 2024 with new liver lesions and rising tumor markers. Treatment was changed to trastuzumab-deruxtecan but unfortunately after 2 cycles, CT imaging on 15 May 2024 showed further progression with increase in liver metastases and new bone lesions in T4 and L2 vertebrae.\n\nOf particular relevance, she also has a history of papillary thyroid cancer treated with total thyroidectomy in 2019, currently in remission on TSH suppression.\n\nShe presents today with deteriorating symptoms, notably increased right upper quadrant pain requiring escalation of analgesia, and new onset dyspnea on minimal exertion. Her performance status has declined to ECOG 2-3. Clinical examination reveals tender hepatomegaly extending 4cm below the costal margin, and reduced air entry at the right lung base.\n\nGiven the aggressive disease progression and declining performance status, we have had a detailed discussion about moving to third-line therapy. We have discussed the role of erdafitinib given the FGFR amplification, though noting the limited evidence in breast cancer. I have also outlined the option of clinical trial participation, specifically the phase 1b basket study of novel AR-targeted therapy combined with trastuzumab.\n\nI have arranged urgent MRI spine to assess for cord compression risk given the new vertebral lesions, and referred to the palliative care team for specialist input with symptom management. We will review her next week with the MRI results and clinical trial screening investigations to finalize the treatment plan.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 1,
      "metastases": "liver metastases, bone metastases including T4 and L2 vertebrae",
      "tnm_stage": "T3N2M1",
      "histopathology_status": "myoepithelial carcinoma",
      "biomarker_status": "AR positive, FGFR amplified, HER2 positive (3+ IHC), ER/PR negative",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "6.5cm left breast mass with axillary lymphadenopathy, liver and bone metastases at presentation",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started docetaxel/trastuzumab/pertuzumab first-line therapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "Disease progression with new liver lesions",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Rising tumor markers",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Changed to second-line trastuzumab-deruxtecan due to disease progression",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows further progression with increase in liver metastases and new bone lesions in T4 and L2 vertebrae",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "other_cancers": [
      {
        "site": "thyroid",
        "year": 2019,
        "histopathology_status": "papillary carcinoma",
        "latest_situation": "in remission on TSH suppression"
      }
    ],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2-3"
      },
      {
        "type": "current_symptom",
        "value": "Increased right upper quadrant pain requiring escalation of analgesia"
      },
      {
        "type": "current_symptom",
        "value": "New onset dyspnea on minimal exertion"
      },
      {
        "type": "examination_finding",
        "value": "Tender hepatomegaly extending 4cm below costal margin"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry at right lung base"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Triple negative myoepithelial breast cancer with liver and bone metastases showing rapid progression through two lines of therapy. Significant clinical deterioration with declining performance status."
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on trastuzumab-deruxtecan with increasing liver metastases and new bone lesions"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in performance status to ECOG 2-3 with increasing symptoms"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI spine to assess for cord compression risk"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to palliative care team and review next week with MRI results"
      }
    ]
  }
}