{
  "content": "Diagnosis:\tInvasive sebaceous carcinoma of right breast with associated ductal carcinoma in situ (DCIS)\n\tDiagnosed March 2024\n\tStage pT2N0M0 (Stage IIA)\n\tTriple positive disease (ER 8/8, PR 7/8, HER2 3+), mTOR mutation detected\n?\n[redacted name] is a 62-year-old lady who has recently been diagnosed with right breast cancer following routine screening mammogram. The initial imaging showed a 2.8cm mass in the upper outer quadrant of the right breast, and subsequent core biopsy confirmed invasive sebaceous carcinoma with associated high-grade DCIS. She underwent wide local excision and sentinel lymph node biopsy on 15/3/24.\n?\nThe final histopathology confirms a 2.8cm Grade 2 invasive sebaceous carcinoma with associated intermediate-grade DCIS. The margins are clear (>5mm), and all three sentinel nodes are negative. Immunohistochemistry shows strong positivity for ER (8/8) and PR (7/8), with HER2 3+ on immunohistochemistry. Molecular testing has identified an activating mTOR mutation.\n?\nIn her past medical history, she has well-controlled hypertension and osteoarthritis of both knees. Her current medications include amlodipine 5mg daily and paracetamol as required. She has no known drug allergies.\n?\nOn examination today, her right breast surgical wound is healing well with no evidence of infection or seroma. There is no palpable residual mass or lymphadenopathy. Her performance status is 0.\n?\nI have discussed the results with [redacted name] and explained the good prognostic features including clear margins and negative nodes. Given the triple positive disease status, I have recommended adjuvant treatment with chemotherapy followed by dual HER2-targeted therapy (Trastuzumab and Pertuzumab) concurrent with endocrine therapy. We discussed the specific chemotherapy regimen of docetaxel, carboplatin and trastuzumab (TCH-P), including common and rare side effects.\n?\nThe plan is to proceed with 6 cycles of TCH-P chemotherapy followed by maintenance Trastuzumab/Pertuzumab for one year in total. She will also commence endocrine therapy with an aromatase inhibitor after chemotherapy completion. I have arranged baseline cardiac echo, routine blood tests, and PICC line insertion. We will see her next week to commence treatment.",
  "output": {
    "primary_cancer": {
      "site": "breast, right, upper outer quadrant",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "pT2N0M0",
      "other_stage": "Stage IIA",
      "histopathology_status": "Grade 2 invasive sebaceous carcinoma with intermediate-grade DCIS, clear margins >5mm",
      "biomarker_status": "ER positive (8/8), PR positive (7/8), HER2 3+, mTOR mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Screening mammogram shows 2.8cm mass in right upper outer quadrant",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Core biopsy confirms invasive sebaceous carcinoma with high-grade DCIS",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Wide local excision and sentinel lymph node biopsy, three nodes negative",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Hypertension, well-controlled"
      },
      {
        "type": "comorbidity",
        "value": "Osteoarthritis of both knees"
      },
      {
        "type": "examination_finding",
        "value": "Right breast surgical wound healing well, no infection or seroma"
      },
      {
        "type": "performance_status",
        "value": "PS 0"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed triple positive right breast cancer following screening. Post-surgical assessment shows favorable features with clear margins and negative nodes."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for 6 cycles TCH-P chemotherapy followed by one year Trastuzumab/Pertuzumab maintenance and aromatase inhibitor"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged baseline cardiac echo, routine blood tests, and PICC line insertion"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week to commence treatment"
      }
    ]
  }
}