{
  "content": "Diagnosis:\tTriple negative breast cancer, right breast\n\nStage:\t\tT2N1M1 (lung metastases)\n\nHistology:\tGlycogen-rich carcinoma, grade 3\n\tER/PR negative, HER2 negative\n\tPDL1 CPS 80\n\nTreatment:\tCompleted 6 cycles carboplatin/paclitaxel March-August 2023\n\tPartial response in primary and lung metastases\n\nCurrent:\tScreening for Phase II TNBC-PDL1 trial\n\n[redacted name] attended clinic today for trial screening assessment. Her disease remains stable following first-line chemotherapy with last imaging on 15/9/23 showing partial response maintained in both primary breast mass (now 2.8cm from 4.2cm) and pulmonary metastases (largest nodule 1.2cm from 2.5cm). Performance status remains 1. She has recovered well from previous chemotherapy with resolution of peripheral neuropathy. Blood results, cardiac echo and pulmonary function tests all meet trial eligibility criteria.\n\nI have discussed the trial protocol in detail including randomisation between pembrolizumab monotherapy versus pembrolizumab/nab-paclitaxel combination. She understands the requirement for 3-weekly visits, regular CT imaging, and potential side effects including immune-related toxicities. She has signed the consent form after reviewing the patient information sheet.\n\nPlan is to complete remaining screening investigations next week including brain MRI and repeat CT chest/abdomen/pelvis. If eligible, she will be randomised and commence trial treatment in 2 weeks. She has been given the trial team contact details and understands to report any new symptoms promptly.",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "metastases": "lung metastases",
      "tnm_stage": "T2N1M1",
      "histopathology_status": "Glycogen-rich carcinoma, grade 3",
      "biomarker_status": "ER/PR negative, HER2 negative, PDL1 CPS 80",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started carboplatin/paclitaxel chemotherapy",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 6 cycles carboplatin/paclitaxel",
          "year": 2023,
          "month": 8
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows partial response maintained - primary breast mass reduced to 2.8cm from 4.2cm, largest lung nodule reduced to 1.2cm from 2.5cm",
          "year": 2023,
          "month": 9
        },
        {
          "type": "clinical_trial_update",
          "value": "Screening for Phase II TNBC-PDL1 trial - signed consent for pembrolizumab monotherapy versus pembrolizumab/nab-paclitaxel combination",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "investigation_finding",
        "value": "Blood results, cardiac echo and pulmonary function tests all meet trial eligibility criteria"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Triple negative breast cancer with lung metastases, stable disease following first-line chemotherapy, now screening for immunotherapy trial"
      },
      {
        "type": "latest_treatment_response",
        "value": "Maintained partial response in primary breast mass and lung metastases"
      },
      {
        "type": "planned_investigation",
        "value": "Brain MRI and repeat CT chest/abdomen/pelvis for trial screening"
      },
      {
        "type": "follow_up_referral",
        "value": "Plan to commence trial treatment in 2 weeks if screening successful"
      }
    ]
  }
}