{
  "content": "Diagnosis:\nTriple negative breast cancer (signet ring carcinoma)\nLeft breast T1cN1mi(sn)M0, diagnosed March 2024\nAndrogen receptor positive\n\nPrevious Treatment:\nWide local excision and sentinel node biopsy 15 April 2024\nCommenced adjuvant dose-dense AC-T chemotherapy 10 May 2024\n\nCurrent medications:\nOndansetron 8mg prn\nPegfilgrastim monthly\nMetoclopramide 10mg prn\n\nCurrent situation:\nPre cycle 3 of 4 AC chemotherapy\n\nI was very pleased to see [redacted name] in clinic today who is managing remarkably well with her chemotherapy treatment. She continues to show great resilience and maintains a positive outlook. Her main challenges have been fatigue in the week following treatment and some mild nausea, though this is well controlled with anti-emetics. She has experienced partial hair loss but is coping well with this using a wig provided by our specialist nurse team.\n\nOn examination today, her surgical wound has healed beautifully with no concerns. There is no lymphoedema or restricted movement. Her observations are stable and she has maintained her weight at 68kg.\n\nHer blood results show adequate neutrophils at 2.8 and normal liver function. We can therefore proceed with cycle 3 AC as planned today. She will then have her final AC cycle in 2 weeks before moving onto weekly paclitaxel.\n\nThe plan is to see her again before cycle 4 AC. I have provided information about the transition to paclitaxel and what to expect. She understands to contact our acute oncology service if she develops any concerning symptoms in the meantime.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 3,
      "tnm_stage": "T1cN1mi(sn)M0",
      "histopathology_status": "signet ring carcinoma",
      "biomarker_status": "Triple negative, Androgen receptor positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision and sentinel node biopsy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started dose-dense AC-T chemotherapy",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Fatigue in week following treatment and mild nausea, controlled with anti-emetics"
      },
      {
        "type": "examination_finding",
        "value": "Surgical wound well healed, no lymphoedema or restricted movement"
      },
      {
        "type": "investigation_finding",
        "value": "Neutrophils 2.8, normal liver function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early stage triple negative breast cancer, tolerating adjuvant AC chemotherapy well with manageable side effects"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1-2 fatigue, mild nausea, partial alopecia"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 3 AC chemotherapy at full dose"
      },
      {
        "type": "planned_investigation",
        "value": "Blood tests before cycle 4"
      },
      {
        "type": "follow_up_referral",
        "value": "Review before cycle 4 AC chemotherapy in 2 weeks"
      }
    ]
  }
}