{
  "content": "Diagnosis:\tRight breast cancer - fibromatosis-like metaplastic carcinoma, initially stage T3N2M0 (Stage IIIA), now with widespread bone metastases. ER/PR negative, HER2 positive (3+).\n\nInitial treatment with neoadjuvant TCH-P completed March 2024, followed by right mastectomy and axillary clearance April 2024. Subsequent adjuvant radiotherapy completed June 2024. Disease progression noted August 2024 with new bone metastases.\n\n[redacted name] has unfortunately experienced significant clinical deterioration over the past 4 weeks. She describes worsening bone pain affecting her thoracic spine, pelvis, and left femur, requiring increasing doses of opioid analgesia. Her mobility has declined significantly, and she now requires a wheelchair for anything more than short distances. Her performance status has declined from 1 to 3.\n\nThe recent CT scan (15/9/24) shows extensive progression of bone metastases throughout the axial skeleton with new lytic lesions in T4, T7, and L2 vertebrae. There is also evidence of pathological fracture in the left femoral neck requiring urgent orthopaedic assessment.\n\nBlood tests show declining haemoglobin at 98 g/L (previously 115), rising alkaline phosphatase at 456 U/L, and deteriorating renal function with eGFR 45 (previously 65).\n\nI have discussed these findings in detail with [redacted name] and her daughter today. Given the clear evidence of disease progression on T-DM1, we have agreed to switch treatment to combination therapy with Capecitabine and Tucatinib. I have explained the rationale for this change, including the evidence base for this combination in HER2-positive breast cancer with brain metastasis risk.\n\nShe will require urgent MRI spine to assess for cord compression risk, and orthopaedic review regarding the femoral lesion. I have arranged urgent zoledronic acid infusion today.\n\nWe will commence Capecitabine 1000mg/m2 BD days 1-14 q21 with Tucatinib 300mg BD continuous, pending final renal function review. She will continue on denosumab 120mg monthly.\n\nI have referred to the acute oncology team for support with pain management, and arranged weekly review during the first cycle of treatment.",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "year": 2024,
      "metastases": "widespread bone metastases, including T4, T7, L2 vertebrae, left femoral neck",
      "tnm_stage": "T3N2M0",
      "other_stage": "Stage IIIA",
      "histopathology_status": "fibromatosis-like metaplastic carcinoma",
      "biomarker_status": "ER/PR negative, HER2 positive (3+)",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced neoadjuvant TCH-P",
          "year": 2024
        },
        {
          "type": "treatment_surgery",
          "value": "Right mastectomy and axillary clearance",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed adjuvant radiotherapy",
          "year": 2024,
          "month": 6
        },
        {
          "type": "anatomical_finding",
          "value": "Disease progression with new bone metastases",
          "year": 2024,
          "month": 8
        },
        {
          "type": "laboratory_finding",
          "value": "Declining haemoglobin 98 g/L, rising alkaline phosphatase 456 U/L, deteriorating renal function eGFR 45",
          "year": 2024,
          "month": 9
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows extensive progression of bone metastases with new lytic lesions and pathological fracture in left femoral neck",
          "year": 2024,
          "month": 9
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing T-DM1 due to disease progression, switching to Capecitabine and Tucatinib combination",
          "year": 2024,
          "month": 9
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3"
      },
      {
        "type": "current_symptom",
        "value": "Worsening bone pain affecting thoracic spine, pelvis, and left femur"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires wheelchair for anything more than short distances"
      },
      {
        "type": "investigation_finding",
        "value": "Pathological fracture in left femoral neck"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "HER2-positive breast cancer with progressive bone metastases. Disease progression on T-DM1 with significant clinical deterioration requiring treatment change"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on T-DM1 with extensive new bone metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Switching to Capecitabine 1000mg/m2 BD days 1-14 q21 with Tucatinib 300mg BD continuous"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in mobility and performance status, now PS 3"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI spine to assess for cord compression risk"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during first cycle, urgent orthopaedic assessment, acute oncology referral for pain management"
      }
    ]
  }
}