{
  "content": "Many thanks for referring [redacted name] who I reviewed today with her daughter present. She has unfortunately experienced disease progression on her current chemotherapy regimen for metastatic triple negative breast cancer. Originally diagnosed with left breast cancer in January 2024, initially presenting as a 6.5cm mass with axillary nodal involvement. Histology confirmed grade 3 metaplastic matrix-producing carcinoma, triple negative with PDL1 90%. Staging investigations revealed widespread metastatic disease affecting lungs, liver, and bones including T7 vertebral body.\n\nInitial treatment with carboplatin/gemcitabine/pembrolizumab was commenced in February 2024 but discontinued after 2 cycles due to grade 3 neutropenia despite GCSF support. Treatment was changed to weekly paclitaxel with continued pembrolizumab, which she received for 6 weeks until recent admission with increasing breathlessness.\n\nCT chest performed during admission shows significant progression with increase in pulmonary metastases, new pleural effusions, and enlarging liver lesions. Her performance status has deteriorated to ECOG 3, now spending most of the day in bed. She requires oxygen 3L/min at rest and has increasing right upper quadrant pain requiring oxycodone 20mg 4-hourly.\n\nOn examination today, she appears cachectic with obvious breathlessness at rest. Chest examination reveals reduced air entry bilaterally with dullness to percussion at both bases. The liver edge is palpable 4cm below the costal margin and tender. The left breast mass is unchanged clinically at 8cm.\n\nGiven her rapid disease progression and declining performance status, I have had a detailed discussion with [redacted name] and her daughter about moving to a palliative approach. We have arranged urgent referral to the palliative care team for symptom management and community support. She will be reviewed by the pleural team tomorrow regarding therapeutic aspiration of effusions. I have prescribed additional breakthrough analgesia and anti-emetics, and arranged weekly review through our enhanced supportive care clinic.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 1,
      "metastases": "widespread metastatic disease affecting lungs, liver, and bones including T7 vertebral body",
      "tnm_stage": "T3N2M1",
      "other_stage": null,
      "histopathology_status": "grade 3 metaplastic matrix-producing carcinoma",
      "biomarker_status": "triple negative, PDL1 90%",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "6.5cm mass with axillary nodal involvement",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started carboplatin/gemcitabine/pembrolizumab",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued carboplatin/gemcitabine/pembrolizumab after 2 cycles due to grade 3 neutropenia despite GCSF support",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_start",
          "value": "Changed to weekly paclitaxel with continued pembrolizumab",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression with increase in pulmonary metastases, new pleural effusions, and enlarging liver lesions",
          "year": 2024,
          "month": null
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, spending most of the day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Requires oxygen 3L/min at rest"
      },
      {
        "type": "current_symptom",
        "value": "Increasing right upper quadrant pain requiring oxycodone 20mg 4-hourly"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with obvious breathlessness at rest"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry bilaterally with dullness to percussion at both bases"
      },
      {
        "type": "examination_finding",
        "value": "Liver edge palpable 4cm below costal margin and tender"
      },
      {
        "type": "examination_finding",
        "value": "Left breast mass unchanged clinically at 8cm"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic triple negative breast cancer with rapid progression through two lines of systemic therapy. Significant clinical deterioration with symptomatic progression in lungs and liver"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on imaging with increasing pulmonary metastases, new pleural effusions, and enlarging liver lesions"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing oxygen requirements and pain"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and pleural team, weekly review in enhanced supportive care clinic"
      }
    ]
  }
}