{
  "content": "Diagnosis:\n\nMetastatic left breast cancer - pleomorphic lobular carcinoma\nDiagnosed January 2024\nER/PR positive, HER2 negative\nESR1 and PIK3CA mutations detected on ctDNA March 2024\n\nPrevious medical history:\nHypertension\nOsteoarthritis\n\nCurrent medications:\nLetrozole 2.5mg daily\nPalbociclib 100mg daily (reduced from 125mg)\nDenosumab 120mg monthly\nZolendronic acid 4mg IV monthly\nOxycodone MR 40mg BD\nOxycodone IR 5-10mg PRN\n\nAllergies:\nNone known\n\nCurrent situation:\nProgressive disease on second-line endocrine therapy\n\nI reviewed [redacted name] today who is unfortunately experiencing increasing symptoms from her widespread metastatic breast cancer. She was initially diagnosed in January 2024 with de novo metastatic disease presenting with back pain and pathological T8 vertebral fracture. Initial staging showed extensive bone metastases throughout the axial and appendicular skeleton.\n\nShe commenced first-line letrozole and palbociclib but developed progressive disease after 2 months. Circulating tumor DNA testing revealed ESR1 and PIK3CA mutations. She switched to fulvestrant with continued palbociclib in March 2024, requiring dose reduction to 100mg due to grade 3 neutropenia.\n\nUnfortunately, her most recent CT scan from 15 April 2024 shows further progression with new bone lesions and increasing size of existing deposits. Her performance status has declined from 1 to 3 over the past month. She now requires wheelchair assistance and is spending >50% of time in bed due to severe fatigue and bone pain.\n\nHer pain has significantly worsened despite recent increases in oxycodone. She describes new onset right hip pain radiating down her leg, raising concern for nerve root compression. She has also developed new onset breathlessness at rest.\n\nOn examination today, she appears cachectic with obvious distress from pain. There is marked tenderness over the right hip and lumbar spine. Chest examination reveals reduced air entry at both bases. Neurological examination shows new right leg weakness (power 4/5) with preserved reflexes.\n\nI have arranged urgent MRI spine and pelvis to assess for cord/nerve root compression. I have referred to the acute oncology team for urgent assessment and admission for pain control. We will discontinue current systemic therapy given clear evidence of progression. Once her symptoms are better controlled, we will discuss further treatment options including alpelisib (given PIK3CA mutation) versus chemotherapy. I have also referred to palliative care for ongoing support with symptom management.\n\nI will review her again next week, sooner if needed based on investigation results. The acute oncology team will coordinate her inpatient admission today.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 1,
      "metastases": "extensive bone metastases throughout axial and appendicular skeleton, pathological T8 vertebral fracture",
      "tnm_stage": "T4N3M1",
      "histopathology_status": "pleomorphic lobular carcinoma",
      "biomarker_status": "ER/PR positive, HER2 negative, ESR1 mutation positive, PIK3CA mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Presenting with pathological T8 vertebral fracture and extensive bone metastases",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line letrozole and palbociclib",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "ctDNA testing revealed ESR1 and PIK3CA mutations",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Switched to fulvestrant with continued palbociclib due to disease progression",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Palbociclib dose reduced to 100mg due to grade 3 neutropenia",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows further progression with new bone lesions and increasing size of existing deposits",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Osteoarthritis"
      },
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3, requiring wheelchair assistance"
      },
      {
        "type": "current_symptom",
        "value": "Severe bone pain requiring oxycodone"
      },
      {
        "type": "current_symptom",
        "value": "New onset right hip pain radiating down leg"
      },
      {
        "type": "current_symptom",
        "value": "New onset breathlessness at rest"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic appearance, marked tenderness over right hip and lumbar spine"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry at both lung bases"
      },
      {
        "type": "examination_finding",
        "value": "Right leg weakness (power 4/5) with preserved reflexes"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic breast cancer with extensive bone involvement showing rapid progression through two lines of endocrine therapy. Significant clinical deterioration with new concerning neurological symptoms."
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on second-line endocrine therapy with fulvestrant and palbociclib"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Previous grade 3 neutropenia requiring palbociclib dose reduction"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing current systemic therapy due to disease progression"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration requiring wheelchair, spending >50% time in bed"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI spine and pelvis to assess for cord/nerve root compression"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to acute oncology for urgent admission, palliative care referral made, review again next week"
      }
    ]
  }
}