{
  "content": "Diagnosis:\tBilateral breast cancer with liver metastases\n\tRight breast: T4N2M0 mixed ductal/lobular carcinoma, triple negative with high TILs (80%)\n\tLeft breast: T2N1M0 mixed morphology, ER/PR negative, HER2 positive\n?\nUnfortunately [redacted name]'s disease has shown significant progression despite recent therapeutic interventions. She completed 6 cycles of carboplatin/gemcitabine for right breast disease in March 2024, having previously received 4 cycles of dose-reduced TCH-P for left breast cancer (stopped January 2024 due to grade 3 hepatotoxicity). CT scan on 15/4/24 shows marked progression of liver metastases with increase in size and number of lesions - largest lesion now 8.2cm compared to 5.4cm in February. There is also new ascites and peritoneal nodularity suggesting peritoneal disease.?\n?\nShe has experienced significant clinical deterioration over the past 3 weeks with increasing abdominal discomfort, early satiety, and peripheral edema. Her performance status has declined from ECOG 1 to ECOG 3. She requires assistance with most activities of daily living and is now spending >50% of time in bed.?\n?\nOn examination today, there is marked hepatomegaly extending 6cm below costal margin with moderate ascites. The right breast mass appears larger clinically at 8cm (previously 6cm) with extensive skin involvement and satellite nodules. Bilateral axillary lymphadenopathy is unchanged.?\n?\nBlood tests show deteriorating liver function with bilirubin 45, ALT 156, ALP 445. Albumin has dropped to 28. Her previous grade 2 thrombocytopenia has worsened to grade 3 with platelets now 45.?\n?\nI have had a lengthy discussion with [redacted name] today regarding disease progression and poor prognosis. Given her declining performance status and organ dysfunction, I do not feel further systemic anti-cancer therapy would be appropriate or safe at this time. We have agreed to focus on symptom management with increased supportive care input.?\n?\nI have arranged urgent palliative care review and prescribed dexamethasone 8mg daily with PPI cover. Drainage of ascites will be considered if symptoms worsen. I have completed a referral to the hospice team for community support and made an urgent referral to our psychology service. We will review her next week to reassess symptoms and ensure adequate support is in place. The acute oncology team are aware and will provide additional support as needed.",
  "output": {
    "primary_cancer": {
      "site": "breast, bilateral",
      "year": 2024,
      "metastases": "liver metastases, peritoneal disease, ascites",
      "tnm_stage": "Right: T4N2M0, Left: T2N1M0",
      "histopathology_status": "mixed ductal/lobular carcinoma",
      "biomarker_status": "Right: triple negative with TILs 80%, Left: ER/PR negative, HER2 positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_change",
          "value": "TCH-P stopped due to grade 3 hepatotoxicity",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Completed 6 cycles carboplatin/gemcitabine for right breast disease",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression of liver metastases, largest lesion 8.2cm from 5.4cm, new ascites and peritoneal nodularity",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Deteriorating liver function - bilirubin 45, ALT 156, ALP 445, albumin 28, platelets 45",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, spending >50% time in bed"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal discomfort, early satiety, peripheral edema"
      },
      {
        "type": "examination_finding",
        "value": "Hepatomegaly 6cm below costal margin, moderate ascites, right breast mass 8cm with skin involvement and satellite nodules, bilateral axillary lymphadenopathy"
      },
      {
        "type": "investigation_finding",
        "value": "Grade 3 thrombocytopenia, deranged liver function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Bilateral breast cancer with progressive liver metastases despite multiple lines of therapy. Significant clinical deterioration with declining performance status and organ dysfunction"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with increasing liver metastases, new peritoneal disease, and enlarging breast mass"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration from ECOG 1 to ECOG 3 over 3 weeks, now requiring assistance with most activities"
      },
      {
        "type": "update_to_treatment",
        "value": "Decision to stop systemic therapy due to poor performance status and organ dysfunction"
      },
      {
        "type": "planned_investigation",
        "value": "Weekly clinical review to assess symptoms"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referrals to palliative care, hospice team, and psychology service"
      }
    ]
  }
}