{
  "content": "Many thanks for referring [redacted name] for discussion at our Breast MDT. She is a 42 year old lady who underwent left breast wide local excision and sentinel lymph node biopsy on 15th March 2024 for a screen-detected lesion. Histology confirms a 22mm secretory carcinoma with associated high-grade DCIS, and one positive sentinel node out of 15 sampled. The tumor shows high TIL expression with PD-L1 positivity of 95%. Margins are clear at >5mm.\n\nThe case was discussed in detail at today's MDT with review of all imaging and pathology. Given the node positive disease, the consensus recommendation is for completion axillary clearance. Following surgery, she will require adjuvant chemotherapy with 6 cycles of FEC-T, followed by whole breast radiotherapy with boost to the tumor bed. Given the high PD-L1 expression, we will also recommend adjuvant pembrolizumab for one year.\n\nI have arranged to see her in clinic next week to discuss these recommendations in detail. She will also be reviewed by our breast care nurse specialist for ongoing support. We will arrange baseline cardiac assessment and staging CT chest/abdomen/pelvis prior to commencing systemic therapy.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 3,
      "metastases": "one positive sentinel lymph node",
      "tnm_stage": "N1",
      "histopathology_status": "22mm secretory carcinoma with associated high-grade DCIS, margins clear >5mm",
      "biomarker_status": "PD-L1 positive (95%), high TIL expression",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "left breast wide local excision and sentinel lymph node biopsy, one positive node out of 15",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "screen-detected breast lesion"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Node positive left breast secretory carcinoma with high PD-L1 expression, post initial surgery requiring further treatment"
      },
      {
        "type": "update_to_treatment",
        "value": "MDT recommendation for completion axillary clearance followed by FEC-T chemotherapy, radiotherapy, and adjuvant pembrolizumab"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline cardiac assessment and staging CT chest/abdomen/pelvis"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinic review next week with breast care nurse specialist support"
      }
    ]
  }
}