{
  "content": "Diagnosis:\tLeft breast cancer - metaplastic squamous cell carcinoma\n\nManagement:\t15 Jan 2024 Left mastectomy and axillary clearance\n\t\t12 Feb 2024 Commenced adjuvant dose-dense AC chemotherapy\n\nHistology:\tGrade 3 metaplastic squamous cell carcinoma\n\tpT3 (85mm) N1 (2/12 nodes) M0\n\tER/PR/HER2 negative, PDL1 IHC 95%?\n\nCurrent Situation:\tPre cycle 3 dose-dense AC\n\nI reviewed [redacted name] today who is currently undergoing adjuvant dose-dense AC chemotherapy. Unfortunately, she has experienced significant toxicity from her treatment thus far. Following cycle 2, she developed grade 3 neutropenia (neutrophils 0.8) requiring a 5-day delay and prophylactic GCSF support. She has also experienced persistent grade 2 nausea despite optimal antiemetic therapy, leading to a 4kg weight loss over the past month. Her current weight is 62kg, down from her pre-treatment baseline of 66kg.\n\nShe describes significant fatigue, rated as 7/10, which is impacting her ability to care for her young children. Her mother has moved in temporarily to provide additional support. She has developed grade 1 peripheral neuropathy affecting her fingertips, though this is not currently limiting her activities.\n\nOn examination today, her ECOG performance status has declined to 2 from a baseline of 0. There is good healing of her left mastectomy scar. No evidence of local recurrence. Her blood results today show improvement in neutrophils to 1.8, though hemoglobin has dropped to 98 g/L.\n\nGiven the significant toxicity experienced, we have discussed modifying her treatment plan. We will proceed with cycle 3 at 80% dose reduction with continued GCSF support. I have also prescribed additional antiemetic support with a netupitant/palonosetron combination and arranged weekly telephone support from our chemotherapy nurse specialists.\n\nShe will return in 2 weeks for pre-cycle 4 assessment. I have requested urgent CT chest/abdomen/pelvis given her marked decline in performance status to ensure no evidence of early disease progression, though I note this would be unusual in the adjuvant setting.",
  "output": {
    "primary_cancer": {
      "site": "breast, left",
      "year": 2024,
      "month": 1,
      "metastases": "2/12 axillary nodes positive",
      "tnm_stage": "pT3N1M0",
      "histopathology_status": "Grade 3 metaplastic squamous cell carcinoma, 85mm tumor size",
      "biomarker_status": "ER/PR/HER2 negative, PDL1 IHC 95%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Left mastectomy and axillary clearance",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced adjuvant dose-dense AC chemotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "5-day delay after cycle 2 due to grade 3 neutropenia, GCSF support added",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Dose reduction to 80% for cycle 3 due to cumulative toxicity",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG performance status 2, declined from baseline of 0"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 nausea despite optimal antiemetic therapy"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 peripheral neuropathy affecting fingertips"
      },
      {
        "type": "current_symptom",
        "value": "Significant fatigue rated 7/10"
      },
      {
        "type": "examination_finding",
        "value": "Good healing of left mastectomy scar, no evidence of local recurrence"
      },
      {
        "type": "investigation_finding",
        "value": "Neutrophils improved to 1.8, hemoglobin dropped to 98 g/L"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early breast cancer receiving adjuvant chemotherapy. Significant treatment toxicity requiring dose modification and additional supportive care"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 neutropenia, grade 2 nausea, fatigue, and grade 1 peripheral neuropathy"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 3 at 80% dose with GCSF support and enhanced antiemetic regime"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "4kg weight loss and decline in performance status from ECOG 0 to 2"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent CT chest/abdomen/pelvis requested due to decline in performance status"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks for pre-cycle 4 assessment"
      }
    ]
  }
}