{
  "content": "Diagnosis:\n\nMetastatic right breast cancer - initial diagnosis March 2023 with locally advanced disease, now with progressive liver and bone metastases\n\nPrevious Treatment:\nMarch 2023 - Right mastectomy and axillary clearance\nApril-September 2023 - Adjuvant FEC-T chemotherapy\nOctober 2023 - Started letrozole and palbociclib\nJanuary 2024 - Palliative radiotherapy to T7 vertebra\n\nPrevious medical history:\nBRCA1 mutation carrier\nHypertension\nType 2 diabetes\n\nCurrent medications:\nLetrozole 2.5mg daily\nPalbociclib 125mg daily (3 weeks on, 1 week off)\nDenosumab 120mg monthly\nMetformin 1g BD\nRamipril 5mg daily\n\nCurrent situation:\nProgressive disease with rising tumor markers and new liver lesions\n\nI reviewed [redacted name] today who attended with her daughter. Unfortunately, she has experienced significant clinical deterioration over the past 6 weeks with worsening fatigue, right upper quadrant pain, and new onset bone pain affecting her right hip. Her performance status has declined from 1 to 2-3, and she now requires assistance with most activities of daily living.\n\nRecent CT imaging shows progression of liver metastases with the largest lesion increasing from 2.3cm to 4.1cm, and multiple new satellite lesions. There are also new bone metastases in the right acetabulum and left humeral head. Her CA15-3 has risen from 120 to 345 over 8 weeks.\n\nGiven the clear evidence of disease progression on first-line endocrine therapy, I have discussed changing treatment to second-line chemotherapy with weekly paclitaxel. I have explained the aims of treatment and potential side effects. [redacted name] understands this is palliative treatment aimed at controlling her disease and improving symptoms. She is keen to proceed despite the risks.\n\nI have arranged urgent referral to the palliative care team for optimization of pain control, and physiotherapy assessment for mobility support. She will start weekly paclitaxel next week, with initial dose reduction to 80mg/m2 given her reduced performance status. We will review her after cycle 1 to assess tolerability.\n\nPlan:\n1. Start weekly paclitaxel 80mg/m2\n2. Continue denosumab but discontinue palbociclib and letrozole\n3. Urgent palliative care review for pain management\n4. CT scan after 3 cycles to assess response\n5. Review in 2 weeks with blood tests",
  "output": {
    "primary_cancer": {
      "site": "breast, right",
      "year": 2023,
      "month": 3,
      "metastases": "progressive liver metastases, bone metastases in T7 vertebra, right acetabulum and left humeral head",
      "other_stage": "Stage IIB at diagnosis, now metastatic",
      "histopathology_status": "lobular carcinoma",
      "biomarker_status": "BRCA1 mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right mastectomy and axillary clearance",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant FEC-T chemotherapy",
          "year": 2023,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started letrozole and palbociclib",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Palliative radiotherapy to T7 vertebra",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "CA15-3 risen from 120 to 345 over 8 weeks",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression of liver metastases with largest lesion increasing from 2.3cm to 4.1cm, multiple new satellite lesions, new bone metastases in right acetabulum and left humeral head",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing palbociclib and letrozole due to disease progression",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "BRCA1 mutation carrier"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "current_symptom",
        "value": "Worsening fatigue, right upper quadrant pain, and new onset bone pain affecting right hip"
      },
      {
        "type": "performance_status",
        "value": "Performance status declined from 1 to 2-3, requiring assistance with most activities of daily living"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic breast cancer with progressive disease in liver and bones following first-line endocrine therapy. Significant clinical deterioration with worsening symptoms and declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on letrozole and palbociclib with increasing liver metastases and new bone lesions"
      },
      {
        "type": "update_to_treatment",
        "value": "Changing to second-line weekly paclitaxel at reduced dose of 80mg/m2 due to poor performance status"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status, now requiring assistance with most activities"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan after 3 cycles of paclitaxel to assess response"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with blood tests, urgent palliative care review arranged for pain management"
      }
    ]
  }
}