{
  "content": "Diagnosis:\tMetastatic cecal adenocarcinoma with signet ring features\n\nManagement:\t15 Jan 2024 Right hemicolectomy with en-bloc small bowel resection\n\t\t12 Feb 2024 Commenced FOLFOX/Trastuzumab\n\nHistology:\tpT4b N2 (6/15) M1c poorly differentiated adenocarcinoma with signet ring features\n\t\tHER2 positive (IHC 3+), MMR proficient\n\nCurrent Situation:\tProgressive disease after cycle 4 FOLFOX/Trastuzumab\n\nI reviewed [redacted name] today who attended with his wife. Unfortunately, he has experienced significant clinical deterioration over the past three weeks. His performance status has declined from ECOG 1 to ECOG 3, and he now requires assistance with most activities of daily living. He reports worsening abdominal distension, early satiety, and has lost a further 4kg since last review (now 62kg from baseline 78kg). He describes increasing abdominal pain requiring regular oxycodone, though this is providing reasonable control.\n\nHis most recent CT scan from 15/4/24 shows clear evidence of disease progression with extensive peritoneal carcinomatosis, new ascites, and several small bowel loops showing evidence of partial obstruction. There is also new omental cake formation. The previous target lesions in the peritoneum have increased in size by approximately 40% since baseline imaging.\n\nBlood tests show deteriorating liver function with new hypoalbuminaemia (28 g/L) and rising ALP (345 U/L). His CA19-9 has increased significantly from 450 to 1200 U/mL over the past month.\n\nGiven the clear evidence of disease progression and declining performance status, we have discussed discontinuing FOLFOX/Trastuzumab. I have explained that the focus of care needs to shift toward symptom management and quality of life. We have discussed second-line treatment options including FOLFIRI with continuation of Trastuzumab, but agreed to defer any decisions until his symptoms are better controlled and performance status improves.\n\nI have arranged urgent paracentesis for symptom relief and referred to the palliative care team for optimization of pain management. I have also organized home oxygen assessment given his increasing breathlessness on exertion. His wife has been provided with contact details for our acute oncology service.\n\nWe will review him again in one week after paracentesis, with consideration of second-line therapy if his performance status improves. I have also arranged weekly blood tests including liver function and electrolytes.",
  "output": {
    "primary_cancer": {
      "site": "cecum",
      "year": 2024,
      "month": 1,
      "metastases": "peritoneal carcinomatosis with ascites, omental cake",
      "tnm_stage": "pT4bN2M1c",
      "histopathology_status": "poorly differentiated adenocarcinoma with signet ring features",
      "biomarker_status": "HER2 positive (IHC 3+), MMR proficient",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right hemicolectomy with en-bloc small bowel resection",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced FOLFOX/Trastuzumab",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows disease progression with extensive peritoneal carcinomatosis, new ascites, partial small bowel obstruction and omental cake",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 increased from 450 to 1200 U/mL",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing FOLFOX/Trastuzumab due to disease progression and declining performance status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, deteriorated from ECOG 1"
      },
      {
        "type": "current_symptom",
        "value": "Worsening abdominal distension and early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Abdominal pain requiring regular oxycodone"
      },
      {
        "type": "current_symptom",
        "value": "Increasing breathlessness on exertion"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating liver function with hypoalbuminaemia (28 g/L) and rising ALP (345 U/L)"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires assistance with most activities of daily living"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic cecal cancer with rapid progression through first-line therapy. Significant clinical deterioration with declining performance status requiring shift to supportive care"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with 40% increase in peritoneal target lesions and new ascites"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing FOLFOX/Trastuzumab due to disease progression"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status from ECOG 1 to 3 with 4kg further weight loss"
      },
      {
        "type": "planned_investigation",
        "value": "Weekly blood tests including liver function and electrolytes"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in one week after paracentesis, urgent palliative care team referral, home oxygen assessment"
      }
    ]
  }
}