{
  "content": "Diagnosis:\tCerebellar hemangioblastoma\n\nSurgery:\t\t15 March 2023 - Complete resection of right cerebellar hemangioblastoma\n\nI reviewed [redacted name] in neurosurgical follow-up clinic today. She has made an excellent recovery following her surgery last year with complete resolution of her presenting symptoms of headache and ataxia. She reports no new neurological symptoms and has returned to her previous activities including regular swimming.\n\nOn examination today, she demonstrates normal cerebellar function with no nystagmus, normal finger-nose testing, and steady heel-shin testing. Her gait is normal and Romberg's test is negative. The surgical wound has healed well.\n\nThe surveillance MRI brain performed last week shows no evidence of recurrence at the surgical site and no new lesions elsewhere in the posterior fossa. Given these reassuring findings, we will arrange repeat imaging in 6 months with clinical review thereafter.\n\nI have explained that while the outlook remains favorable given the complete resection achieved, ongoing surveillance is important. She understands to contact us if she develops any new symptoms in the interim.",
  "output": {
    "primary_cancer": {
      "site": "cerebellum, right",
      "year": 2023,
      "month": 3,
      "histopathology_status": "hemangioblastoma",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Complete resection of right cerebellar hemangioblastoma",
          "year": 2023,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Surveillance MRI brain shows no evidence of recurrence at surgical site and no new lesions in posterior fossa",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Normal cerebellar function with no nystagmus, normal finger-nose testing, and steady heel-shin testing"
      },
      {
        "type": "examination_finding",
        "value": "Normal gait and negative Romberg's test"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Returned to previous activities including regular swimming"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Right cerebellar hemangioblastoma status post complete surgical resection. Excellent recovery with no evidence of recurrence on surveillance imaging"
      },
      {
        "type": "latest_treatment_response",
        "value": "Complete resolution of presenting symptoms of headache and ataxia following surgery"
      },
      {
        "type": "planned_investigation",
        "value": "Surveillance MRI brain in 6 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinical review following next MRI"
      }
    ]
  }
}