{
  "content": "Diagnosis:\tCervical clear cell carcinoma, Stage IVB with pulmonary metastases\n\nManagement:\t15 Jan 2024 - Radical chemoradiotherapy with weekly cisplatin\n\t\t20 Mar 2024 - Commenced pembrolizumab/paclitaxel/carboplatin\n\nHistology:\tClear cell adenocarcinoma, HNF1B positive\n\nCurrent Situation:\tProgressive disease following cycle 3 immunotherapy combination\n\nI reviewed [redacted name] today who unfortunately has evidence of disease progression. Her most recent CT scan from 15/5/24 shows enlargement of pulmonary metastases with new pleural effusions. She reports worsening breathlessness on minimal exertion and increasing fatigue, now spending approximately 70% of the day resting. Her performance status has declined to ECOG 3. She has developed a troublesome dry cough and requires 2L/min oxygen at rest to maintain saturations above 92%.\n\nShe has experienced grade 2 peripheral neuropathy from the paclitaxel component, mainly affecting her feet, though this has not worsened since dose reduction at cycle 2. Her main symptoms are the breathlessness and fatigue, along with poor appetite resulting in 4kg weight loss over the past month despite nutritional supplements.\n\nOn examination today, there are reduced breath sounds at both bases with dullness to percussion. Oxygen saturations are 94% on 2L/min oxygen. She is cachectic with evident muscle wasting.\n\nI have had a detailed discussion with [redacted name] and her husband regarding the change in her condition. Given the clear evidence of disease progression and declining performance status, I have recommended discontinuing systemic anti-cancer therapy. We have discussed focusing on symptom management and quality of life. I have made an urgent referral to the palliative care team and arranged for community oxygen assessment.\n\nI have prescribed dexamethasone 4mg twice daily with PPI cover to help with breathlessness and appetite. We will arrange pleural aspiration if effusions become more symptomatic. She will be reviewed by the palliative care team next week and I will see her again in 2 weeks' time to review her symptoms.",
  "output": {
    "primary_cancer": {
      "site": "cervix",
      "year": 2024,
      "month": 1,
      "metastases": "pulmonary metastases, new pleural effusions",
      "other_stage": "Stage IVB",
      "histopathology_status": "clear cell adenocarcinoma",
      "biomarker_status": "HNF1B positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started radical chemoradiotherapy with weekly cisplatin",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced pembrolizumab/paclitaxel/carboplatin combination therapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Paclitaxel dose reduction at cycle 2 due to peripheral neuropathy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows enlargement of pulmonary metastases with new pleural effusions",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing systemic anti-cancer therapy due to disease progression and declining performance status",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, spending 70% of day resting"
      },
      {
        "type": "current_symptom",
        "value": "Worsening breathlessness on minimal exertion requiring 2L/min oxygen"
      },
      {
        "type": "current_symptom",
        "value": "Troublesome dry cough"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 peripheral neuropathy affecting feet"
      },
      {
        "type": "current_symptom",
        "value": "Poor appetite with 4kg weight loss over past month"
      },
      {
        "type": "examination_finding",
        "value": "Reduced breath sounds at both bases with dullness to percussion"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturations 94% on 2L/min oxygen"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with evident muscle wasting"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IVB cervical clear cell carcinoma with progressive pulmonary metastases. Disease progression on immunotherapy combination with significant clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease with enlarging pulmonary metastases and new pleural effusions"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 peripheral neuropathy from paclitaxel"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing systemic anti-cancer therapy, starting dexamethasone 4mg twice daily"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing oxygen requirements"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team, review in 2 weeks"
      },
      {
        "type": "planned_investigation",
        "value": "Community oxygen assessment arranged"
      }
    ]
  }
}