{
  "content": "Diagnosis:\tClear cell carcinoma of cervix, Stage IVB with lung and bone metastases\n\nI reviewed [redacted name] today in the Phase II ATHENA trial clinic. She was diagnosed in January 2024 with clear cell carcinoma of cervix with multiple bilateral pulmonary metastases and extensive bone involvement including T8 vertebral body. Initial PET-CT on 15/1/24 demonstrated an FDG-avid 6.2cm cervical mass with right pelvic sidewall extension, multiple bilateral pulmonary nodules up to 2.8cm, and widespread bone metastases. Molecular testing confirmed PD-L1 CPS of 80.\n\nShe was enrolled in the ATHENA trial on 1/2/24 and randomised to Arm A, receiving combination immunotherapy with experimental agent BX-102 plus pembrolizumab. She has completed 4 cycles of treatment. Her most recent CT assessment on 15/4/24 shows stable disease by RECIST 1.1 criteria with no new sites of disease. Her bone pain has significantly improved with concurrent palliative radiotherapy (20Gy in 5 fractions) to T8 completed on 1/3/24.\n\nShe has experienced immune-related thyroiditis requiring commencement of levothyroxine, but has otherwise tolerated treatment well with PS 1. Today's thyroid function tests show good biochemical control. Her main symptoms are mild fatigue and occasional dry cough. She continues to work part-time and maintains good mobility.\n\nOn examination today, chest is clear with no added sounds. Abdomen is soft and non-tender. No peripheral edema. Latest trial-mandated blood tests, including liver function, renal function and inflammatory markers are all within normal range.\n\nThe plan is to continue with cycle 5 of trial treatment today. She understands to contact the trial team if she develops any new symptoms. Her next trial assessment will be in 3 weeks with repeat CT scan scheduled for cycle 6 response assessment. She will also have quality of life questionnaires and trial-specific blood samples taken as per protocol.",
  "output": {
    "primary_cancer": {
      "site": "cervix",
      "year": 2024,
      "month": 1,
      "metastases": "multiple bilateral pulmonary metastases up to 2.8cm, widespread bone metastases including T8 vertebral body",
      "other_stage": "Stage IVB",
      "histopathology_status": "clear cell carcinoma",
      "biomarker_status": "PD-L1 CPS 80",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "PET-CT shows 6.2cm cervical mass with right pelvic sidewall extension, multiple bilateral pulmonary nodules, widespread bone metastases",
          "year": 2024,
          "month": 1
        },
        {
          "type": "clinical_trial_update",
          "value": "Enrolled in ATHENA trial Arm A - BX-102 plus pembrolizumab",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed palliative radiotherapy 20Gy in 5 fractions to T8 vertebra",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT assessment shows stable disease by RECIST 1.1 criteria with no new sites of disease",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "current_symptom",
        "value": "mild fatigue and occasional dry cough"
      },
      {
        "type": "examination_finding",
        "value": "chest clear with no added sounds, abdomen soft and non-tender, no peripheral edema"
      },
      {
        "type": "investigation_finding",
        "value": "liver function, renal function and inflammatory markers all within normal range"
      },
      {
        "type": "quality_of_life_finding",
        "value": "continues to work part-time and maintains good mobility"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IVB clear cell cervical cancer with lung and bone metastases. Stable disease on ATHENA trial immunotherapy with good symptom control"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on CT with improved bone pain following radiotherapy"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Immune-related thyroiditis requiring levothyroxine, now biochemically controlled"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing with cycle 5 of trial treatment BX-102 plus pembrolizumab"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 3 weeks with CT scan for cycle 6 response assessment"
      }
    ]
  }
}