{
  "content": "Diagnosis:\tCervical cancer - adenosquamous carcinoma, FIGO stage IIA1, p16 positive, HPV 16 positive.\n\nPresenting with post-coital bleeding since January 2024. Examination revealed a 2.8cm exophytic lesion on the anterior lip of cervix. MRI pelvis 15 March 2024 confirmed FIGO stage IIA1 disease with minimal parametrial extension but no lymph node involvement. CT chest/abdomen/pelvis 20 March 2024 showed no evidence of distant metastatic disease.\n\n[redacted name] is a 42-year-old lady who was referred following abnormal cervical screening. She is generally fit and well with no significant past medical history apart from mild asthma controlled on salbutamol inhaler. She has never smoked and drinks minimal alcohol. She lives with her husband and two teenage children, and works as a primary school teacher.\n\nOn examination today, ECOG performance status is 0. Vital signs are stable. Abdominal examination is unremarkable with no palpable lymphadenopathy. Vaginal examination confirms the anterior cervical lesion with no obvious parametrial involvement.\n\nI have discussed her case at length with [redacted name] and her husband today. We have explained the diagnosis and treatment options. Given her stage and good performance status, we recommend concurrent chemoradiotherapy with weekly cisplatin. I have outlined the expected side effects and likely outcomes. She will require baseline blood tests, EDTA clearance, and dental assessment prior to starting treatment.\n\nThe plan is to proceed with radiotherapy planning CT next week, aiming to commence treatment in 2 weeks' time. We will arrange weekly reviews during treatment. I have provided written information about chemoradiotherapy and contact details for our specialist nursing team.",
  "output": {
    "primary_cancer": {
      "site": "cervix, anterior lip",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "",
      "other_stage": "FIGO stage IIA1",
      "histopathology_status": "adenosquamous carcinoma",
      "biomarker_status": "p16 positive, HPV 16 positive",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Presenting with post-coital bleeding",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "MRI pelvis shows 2.8cm exophytic lesion with minimal parametrial extension, no lymph node involvement",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest/abdomen/pelvis shows no evidence of distant metastatic disease",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 0"
      },
      {
        "type": "comorbidity",
        "value": "Mild asthma controlled on salbutamol inhaler"
      },
      {
        "type": "examination_finding",
        "value": "Anterior cervical lesion with no obvious parametrial involvement"
      },
      {
        "type": "examination_finding",
        "value": "No palpable lymphadenopathy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed stage IIA1 cervical adenosquamous carcinoma. Initial assessment for planned concurrent chemoradiotherapy."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence concurrent chemoradiotherapy with weekly cisplatin"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline blood tests, EDTA clearance, and dental assessment"
      },
      {
        "type": "follow_up_referral",
        "value": "Radiotherapy planning CT next week, weekly reviews during treatment"
      }
    ]
  }
}