{
  "content": "Diagnosis:\nSquamous cell carcinoma of cervix, FIGO stage IB2\nInitial diagnosis March 2024\nPD-L1 CPS 70\n\nPrevious treatment:\nCycle 1-2 cisplatin-based chemoradiation completed with good tolerance\n\nCurrent medications:\nOndansetron 8mg prn\nMetoclopramide 10mg prn\n\nCurrent situation:\nReview during week 4 of radiotherapy with concurrent cisplatin\n\nI reviewed [redacted name] today who is progressing well through chemoradiation treatment. She has completed 18 of 25 planned fractions of external beam radiotherapy and received 2 cycles of weekly cisplatin without significant complications. Her main side effects have been grade 1 nausea, well controlled with anti-emetics, and mild fatigue which is not impacting her daily activities. She continues to work part-time and maintains good nutrition and hydration.\n\nOn examination today, performance status remains 0. She is clinically well with stable vital signs. Blood results show stable renal function with creatinine 78, normal electrolytes, and adequate haematological parameters for continued treatment.\n\nThe plan is to proceed with cycle 3 cisplatin today. She will continue with daily radiotherapy and we will review her again next week before cycle 4. She understands to contact the team if she develops any concerning symptoms in the interim.",
  "output": {
    "primary_cancer": {
      "site": "cervix",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "",
      "other_stage": "FIGO stage IB2",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "PD-L1 CPS 70",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent cisplatin-based chemoradiation",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 2 cycles weekly cisplatin with good tolerance",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed 18 of 25 planned fractions of external beam radiotherapy",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 nausea, controlled with anti-emetics"
      },
      {
        "type": "current_symptom",
        "value": "Mild fatigue not impacting daily activities"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal function with creatinine 78, normal electrolytes, adequate haematological parameters"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IB2 cervical cancer progressing well through concurrent chemoradiation with good tolerance of treatment"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 nausea controlled with anti-emetics, mild fatigue"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 3 cisplatin and continuing daily radiotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week before cycle 4 cisplatin"
      }
    ]
  }
}