{
  "content": "Diagnosis:\tEndometrial cancer - Grade 1 endometrioid adenocarcinoma, FIGO stage IA\n\nManagement:\t15 Jan 2024 Total laparoscopic hysterectomy and bilateral salpingo-oophorectomy\n\nHistology:\tGrade 1 endometrioid adenocarcinoma, FIGO stage IA. Depth of invasion 2mm in 14mm wall. LVSI negative. PTEN loss and MLH1 methylation detected.\n\nI reviewed [redacted name] today for her end of treatment assessment following completion of her surgical management for early stage endometrial cancer. She has made an excellent recovery from her surgery with complete resolution of her previous abnormal bleeding. Her post-operative period was uncomplicated and her wound sites have healed well.\n\nOn examination today, the vault appears well-healed with no concerning features. She reports no pelvic pain or pressure symptoms. Her mobility has returned to baseline and she has resumed her usual daily activities including regular walking.\n\nGiven the final histology showing Grade 1 disease with minimal myometrial invasion, negative LVSI status, and clear surgical margins, no adjuvant treatment is indicated. I have explained that her prognosis is excellent with very low risk of recurrence.\n\nThe plan is for clinical follow-up every 4 months for the first two years. I have provided written information about potential symptoms of recurrence and contact details for the CNS team. She understands to report any new vaginal bleeding, unexplained pelvic pain, or other concerning symptoms.\n\nWe will see her for her next follow-up appointment in 4 months' time. A CT chest/abdomen/pelvis will be arranged for her 1-year surveillance point as per protocol.",
  "output": {
    "primary_cancer": {
      "site": "endometrium",
      "year": 2024,
      "month": 1,
      "metastases": null,
      "tnm_stage": null,
      "other_stage": "FIGO stage IA",
      "histopathology_status": "Grade 1 endometrioid adenocarcinoma, depth of invasion 2mm in 14mm wall, LVSI negative",
      "biomarker_status": "PTEN loss and MLH1 methylation detected",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Total laparoscopic hysterectomy and bilateral salpingo-oophorectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "Grade 1 endometrioid adenocarcinoma, FIGO stage IA, depth of invasion 2mm in 14mm wall, LVSI negative",
          "year": 2024,
          "month": 1
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Vault appears well-healed with no concerning features"
      },
      {
        "type": "current_symptom",
        "value": "No pelvic pain or pressure symptoms"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Mobility returned to baseline, resumed usual daily activities including regular walking"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early stage endometrial cancer treated with surgery alone. Excellent recovery with very low risk of recurrence based on favorable pathological features"
      },
      {
        "type": "latest_treatment_response",
        "value": "Complete resolution of abnormal bleeding following surgery"
      },
      {
        "type": "update_to_treatment",
        "value": "No adjuvant treatment indicated given favorable pathological features"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinical follow-up every 4 months for first two years"
      },
      {
        "type": "planned_investigation",
        "value": "CT chest/abdomen/pelvis arranged for 1-year surveillance"
      }
    ]
  }
}