{
  "content": "Diagnosis:\tEndometrial cancer - Grade 2 endometrioid adenocarcinoma, FIGO stage IB (pT1bN0M0)\n\nInitial treatment:\tTotal laparoscopic hysterectomy and bilateral salpingo-oophorectomy March 2024\n\nI reviewed [redacted name] today in the gynae-oncology follow-up clinic. She has completed her course of adjuvant vaginal vault brachytherapy (21Gy in 3 fractions) which finished on 15 May 2024. She tolerated the treatment well with only mild vaginal irritation which has now resolved. She reports no current symptoms of concern and has maintained good energy levels throughout.\n\nOn examination today, her vault appears well-healed with no evidence of disease recurrence. Her abdomen is soft and non-tender with well-healed laparoscopy port sites. There is no lymphadenopathy and her chest is clear.\n\nI have explained that given her stage, grade, and complete surgical resection, her prognosis remains favorable. We will continue with our standard follow-up protocol. I have arranged to see her again in 3 months' time with a CT scan beforehand to establish her baseline imaging. She understands to contact us sooner if she develops any concerning symptoms in the interim.",
  "output": {
    "primary_cancer": {
      "site": "endometrium",
      "year": 2024,
      "month": 3,
      "metastases": null,
      "tnm_stage": "pT1bN0M0",
      "other_stage": "FIGO stage IB",
      "histopathology_status": "Grade 2 endometrioid adenocarcinoma",
      "biomarker_status": null,
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Total laparoscopic hysterectomy and bilateral salpingo-oophorectomy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed adjuvant vaginal vault brachytherapy 21Gy in 3 fractions",
          "year": 2024,
          "month": 5
        },
        {
          "type": "other_progress_or_event",
          "value": "Post-treatment examination shows well-healed vault with no evidence of disease recurrence",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Vault well-healed with no evidence of disease recurrence"
      },
      {
        "type": "examination_finding",
        "value": "Abdomen soft and non-tender with well-healed laparoscopy port sites"
      },
      {
        "type": "examination_finding",
        "value": "No lymphadenopathy and chest clear"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early stage endometrial cancer post surgery and brachytherapy. No evidence of disease recurrence on examination with good treatment tolerance"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Mild vaginal irritation from brachytherapy which has resolved"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 3 months with baseline CT scan beforehand"
      }
    ]
  }
}