{
  "content": "Diagnosis:\tExtensive stage small cell carcinoma of esophagus with liver, lung and mediastinal nodal metastases\n\nI reviewed [redacted name] today in the acute oncology assessment unit following admission with increasing dysphagia, fatigue, and right upper quadrant pain. Unfortunately, his recent CT scan on 15 April 2024 has shown clear evidence of disease progression with enlarging liver metastases, new pulmonary nodules, and increasing mediastinal lymphadenopathy despite two cycles of carboplatin and etoposide. The largest liver lesion has increased from 4.2cm to 6.8cm, and there are multiple new sub-centimetre lung nodules. His performance status has deteriorated to ECOG 3, spending more than 50% of the day in bed.\n\nHis initial diagnosis was made in January 2024 following investigation of progressive dysphagia. Endoscopic biopsy confirmed small cell carcinoma with Ki67 of 95%. PET-CT demonstrated a 5cm primary esophageal tumor with extensive liver metastases, mediastinal lymphadenopathy, and two lung nodules. He commenced first-line carboplatin and etoposide on 1 February 2024, requiring a 20% dose reduction from cycle 2 due to grade 3 neutropenia despite G-CSF support.\n\nOn examination today, he appears cachectic with obvious weight loss. There is tender hepatomegaly extending 4cm below the costal margin. Chest examination reveals reduced air entry at both bases. Blood tests show deteriorating liver function with bilirubin 45, ALT 156, ALP 445. His albumin has dropped to 28.\n\nGiven his clear clinical and radiological progression on first-line platinum-based chemotherapy, deteriorating performance status, and worsening liver function, I have had a detailed discussion with [redacted name] and his wife about moving to second-line treatment with oral topotecan. I have explained the modest benefits and risks of second-line therapy in this setting. They understand that the focus is now on symptom control and quality of life. I have made an urgent referral to the palliative care team for review of his dysphagia and pain management.\n\nWe will commence oral topotecan at a reduced dose of 1.8mg/m2 days 1-5 given his performance status. I have arranged weekly blood tests and clinical review. The acute oncology team will maintain close telephone contact.",
  "output": {
    "primary_cancer": {
      "site": "esophagus",
      "year": 2024,
      "month": 1,
      "metastases": "liver metastases, mediastinal lymphadenopathy, lung nodules",
      "other_stage": "Extensive stage",
      "histopathology_status": "small cell carcinoma",
      "biomarker_status": "Ki67 95%",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "PET-CT showed 5cm primary esophageal tumor with extensive liver metastases, mediastinal lymphadenopathy, and two lung nodules",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line carboplatin and etoposide",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "20% dose reduction of carboplatin/etoposide due to grade 3 neutropenia despite G-CSF support",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows disease progression with enlarging liver metastases (largest 6.8cm), new pulmonary nodules, and increasing mediastinal lymphadenopathy",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, spending more than 50% of the day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Increasing dysphagia, fatigue, and right upper quadrant pain"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with tender hepatomegaly extending 4cm below costal margin, reduced air entry at both bases"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating liver function with bilirubin 45, ALT 156, ALP 445, albumin 28"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Extensive stage small cell carcinoma of esophagus progressing on first-line chemotherapy with clinical deterioration. Transitioning to second-line topotecan with palliative focus"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on carboplatin/etoposide with enlarging liver metastases and new pulmonary nodules"
      },
      {
        "type": "update_to_treatment",
        "value": "Switching to second-line oral topotecan at reduced dose of 1.8mg/m2 days 1-5"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing symptoms and organ dysfunction"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care referral for dysphagia and pain management, weekly blood tests and clinical review"
      }
    ]
  }
}