{
  "content": "Diagnosis:\tLocally advanced esophageal adenocarcinoma with liver and lung metastases\n\tEndoscopy and biopsy 15 March 2024 - Siewert type II adenocarcinoma at gastro-esophageal junction\n\tCT staging 20 March 2024 - T4aN2 disease with multiple liver and lung metastases\n\tPET-CT 25 March 2024 - FDG-avid primary tumor and metastases\n?\n[redacted name] is a 67-year-old gentleman who has unfortunately been diagnosed with metastatic esophageal adenocarcinoma. His symptoms began approximately four months ago with progressive dysphagia, initially for solids and now also affecting liquids. He reports significant weight loss of 12kg over this period and describes new onset right upper quadrant discomfort. His performance status has declined from 1 to 2 over the past month, and he now requires assistance with activities of daily living.\n?\nEndoscopy revealed a 6cm circumferential mass at the gastro-esophageal junction, confirmed as adenocarcinoma on biopsy. Molecular analysis has shown HER2 positivity (IHC 3+) with normal FGFR2 expression. Staging CT and subsequent PET-CT have demonstrated a T4aN2 primary tumor with multiple liver metastases (largest 4.2cm in segment 7) and bilateral pulmonary nodules up to 1.5cm.\n?\nIn his past medical history, he has ischemic heart disease with previous NSTEMI in 2020 requiring two coronary stents, type 2 diabetes, and chronic kidney disease (eGFR 45). His current medications include aspirin 75mg od, bisoprolol 2.5mg od, ramipril 5mg od, atorvastatin 40mg od, and metformin 1g bd. He has recently started using liquid morphine 10mg/5ml for breakthrough pain.\n?\nHe lives with his wife who provides excellent support. He is an ex-smoker having quit 10 years ago with a 40 pack-year history. He previously worked as an electrician and retired 2 years ago.\n?\nOn examination today, he appears cachectic with evident muscle wasting. His WHO performance status is 2. There is dullness to percussion in the right lung base and tender hepatomegaly palpable 4cm below the costal margin. No peripheral edema is present.\n?\nI have discussed his case in detail with both [redacted name] and the patient. Given his HER2 positive status, we would recommend combination chemotherapy with cisplatin, 5-FU and trastuzumab. However, given his cardiac history and reduced renal function, we will need careful cardiac monitoring and dose modifications. I have arranged an urgent ECHO, baseline audiometry, and EDTA clearance prior to starting treatment.\n?\nWe have also referred him urgently to the dietetic team for nutritional support and assessment for feeding tube placement. The palliative care team will be involved early for optimization of his dysphagia and pain management.\n?\nHe will be discussed at next week's Upper GI MDT. We plan to see him again in one week with all test results to initiate systemic therapy. I have provided both verbal and written information about the proposed treatment plan, including potential side effects and red flag symptoms.",
  "output": {
    "primary_cancer": {
      "site": "esophagus, gastro-esophageal junction, Siewert type II",
      "year": 2024,
      "month": 3,
      "metastases": "multiple liver metastases (largest 4.2cm in segment 7), bilateral pulmonary nodules up to 1.5cm",
      "tnm_stage": "T4aN2",
      "other_stage": "Stage IVA",
      "histopathology_status": "adenocarcinoma",
      "biomarker_status": "HER2 positive (IHC 3+), FGFR2 normal",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Endoscopy shows 6cm circumferential mass at gastro-esophageal junction",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsy confirms adenocarcinoma, HER2 positive (IHC 3+)",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT staging shows T4aN2 disease with multiple liver and lung metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT confirms FDG-avid primary tumor and metastases",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "WHO performance status 2, declined from PS 1 over past month"
      },
      {
        "type": "current_symptom",
        "value": "Progressive dysphagia affecting both solids and liquids"
      },
      {
        "type": "current_symptom",
        "value": "Right upper quadrant discomfort"
      },
      {
        "type": "current_symptom",
        "value": "Weight loss of 12kg over four months"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with muscle wasting, dullness in right lung base, tender hepatomegaly 4cm below costal margin"
      },
      {
        "type": "comorbidity",
        "value": "Ischemic heart disease with previous NSTEMI in 2020 requiring two coronary stents"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Chronic kidney disease (eGFR 45)"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed metastatic HER2 positive esophageal adenocarcinoma with liver and lung metastases. Progressive symptoms with declining performance status requiring urgent treatment initiation."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for cisplatin, 5-FU and trastuzumab combination therapy pending cardiac assessment"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged ECHO, baseline audiometry, and EDTA clearance"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to dietetic team and palliative care team"
      }
    ]
  }
}