{
  "content": "Diagnosis:\tMetastatic adenocarcinoma of esophagus (T4aN2M1)\n\nManagement:\t2023 Oct - Dec: 6 cycles EOX chemotherapy\n\t\t2024 Jan: Second-line FOLFIRI commenced\n\t\t2024 Mar: Palliative radiotherapy to T8 vertebra\n\nHistology:\tPoorly differentiated adenocarcinoma, HER2 negative, MMR proficient\n\nCurrent Situation:\tProgressive disease with deteriorating performance status\n\nI reviewed [redacted name] today who attended with his daughter. Unfortunately, his condition has significantly deteriorated over the past three weeks. His performance status has declined from ECOG 2 to ECOG 3, and he now requires assistance with most activities of daily living. He reports worsening dysphagia, now struggling with even liquids, and has lost a further 4kg since last review (total weight loss now 15kg from baseline). His bone pain has increased despite the recent palliative radiotherapy to T8, and he describes new right upper quadrant discomfort.\n\nThe CT scan performed last week shows clear disease progression with increase in size of both liver metastases (largest lesion now 8.2cm from 6.5cm) and development of new pulmonary nodules. There is also progression of bone metastases with new lesions in T4 and L2 vertebrae. The primary esophageal tumor shows local progression with increasing circumferential wall thickening and adjacent lymphadenopathy.\n\nBlood tests show deteriorating liver function with bilirubin now 45 μmol/L (previously 28) and albumin 28 g/L. His renal function remains stable but hemoglobin has dropped to 98 g/L.\n\nGiven the clear clinical and radiological progression on second-line chemotherapy, coupled with his declining performance status, I have had a detailed discussion with [redacted name] and his daughter about changing our approach to focus on symptom control. We have agreed to discontinue systemic therapy and I have made an urgent referral to the palliative care team. I have prescribed additional analgesia (increased MST to 30mg BD and breakthrough oxycodone), and arranged urgent dietetic review for consideration of feeding tube placement.\n\nI have also referred him to our specialist nurse team for additional support and arranged weekly telephone follow-up. He will be reviewed by the palliative care team next week, and I will see him again in clinic in two weeks' time, or sooner if needed. His daughter has our acute oncology contact details if there are any concerns in the meantime.",
  "output": {
    "primary_cancer": {
      "site": "esophagus",
      "year": 2023,
      "tnm_stage": "T4aN2M1",
      "histopathology_status": "Poorly differentiated adenocarcinoma",
      "biomarker_status": "HER2 negative, MMR proficient",
      "metastases": "liver, lung, and bone metastases including T8, T4 and L2 vertebrae",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started EOX chemotherapy",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced second-line FOLFIRI",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Palliative radiotherapy to T8 vertebra",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression of liver metastases (largest 8.2cm from 6.5cm), new pulmonary nodules, new bone metastases in T4 and L2, progression of primary tumor",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Deteriorating liver function with bilirubin 45 μmol/L, albumin 28 g/L, hemoglobin 98 g/L",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued systemic therapy due to disease progression and declining performance status",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated from ECOG 2 to ECOG 3, requiring assistance with most activities of daily living"
      },
      {
        "type": "current_symptom",
        "value": "Worsening dysphagia, struggling with liquids"
      },
      {
        "type": "current_symptom",
        "value": "Increasing bone pain despite palliative radiotherapy"
      },
      {
        "type": "current_symptom",
        "value": "New right upper quadrant discomfort"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight loss of 15kg from baseline, further 4kg lost in past three weeks"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic esophageal cancer with progressive disease on second-line chemotherapy and significant clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on imaging with enlarging liver metastases, new pulmonary nodules, and new bone metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued systemic therapy, increased MST to 30mg BD and breakthrough oxycodone"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status from ECOG 2 to 3 with increasing symptom burden"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team, dietetic review, and specialist nurse support"
      },
      {
        "type": "planned_investigation",
        "value": "Clinical review in two weeks, weekly telephone follow-up"
      }
    ]
  }
}