{
  "content": "Diagnosis:\tHigh grade serous carcinoma of fallopian tube with peritoneal metastases\n\nManagement:\t2023 Primary debulking surgery - bilateral salpingo-oophorectomy, omentectomy, peritoneal stripping\n\t\tAdjuvant carboplatin/paclitaxel completed December 2023\n\t\tMaintenance olaparib commenced January 2024\n\nHistology:\tHigh grade serous carcinoma, Stage IIIA, germline BRCA1 mutation carrier\n\nCurrent Situation:\tDisease progression on maintenance therapy\n\nI reviewed [redacted name] today who has unfortunately experienced disease progression while on olaparib maintenance therapy. Recent CT imaging from 15th April 2024 shows new peritoneal deposits in the right paracolic gutter measuring up to 2.1cm, with small volume ascites. This is accompanied by a rise in CA125 from 45 to 189 over the past six weeks.\n\nShe reports increasing abdominal discomfort and early satiety over the past month. Her appetite has reduced significantly and she has lost 4kg in weight. She describes new onset peripheral edema affecting both ankles. Her performance status has declined from 1 to 2, though she remains independent with activities of daily living.\n\nOn examination today, there is moderate ascites with shifting dullness. There is tenderness in the right iliac fossa corresponding to the location of new disease. No supraclavicular lymphadenopathy. Oxygen saturations 98% on air.\n\nI have had a detailed discussion with [redacted name] regarding disease progression and treatment options. Given her germline BRCA1 status and the duration of her initial platinum-free interval (4 months), I have recommended second-line combination therapy with carboplatin and pegylated liposomal doxorubicin. We discussed the aims of treatment and potential side effects including fatigue, myelosuppression, palmar-plantar syndrome, and cardiac monitoring requirements.\n\nI have arranged for baseline cardiac echo, blood tests, and PICC line insertion next week. She will commence chemotherapy once these are completed. I have also referred to the palliative care team for additional support with symptom management, particularly the abdominal discomfort. We will see her again in clinic prior to cycle 1 chemotherapy.",
  "output": {
    "primary_cancer": {
      "site": "fallopian tube",
      "year": 2023,
      "metastases": "peritoneal deposits in right paracolic gutter, small volume ascites",
      "other_stage": "Stage IIIA",
      "histopathology_status": "High grade serous carcinoma",
      "biomarker_status": "germline BRCA1 mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Primary debulking surgery - bilateral salpingo-oophorectomy, omentectomy, peritoneal stripping",
          "year": 2023
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced adjuvant carboplatin/paclitaxel",
          "year": 2023
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed carboplatin/paclitaxel",
          "year": 2023,
          "month": 12
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started maintenance olaparib",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 risen from 45 to 189 over six weeks",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows new peritoneal deposits in right paracolic gutter up to 2.1cm with small volume ascites",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status declined from 1 to 2"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal discomfort and early satiety"
      },
      {
        "type": "current_symptom",
        "value": "New onset peripheral edema affecting both ankles"
      },
      {
        "type": "examination_finding",
        "value": "Moderate ascites with shifting dullness, tenderness in right iliac fossa"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturations 98% on air"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "High grade serous carcinoma of fallopian tube with disease progression on olaparib maintenance therapy. New peritoneal disease with symptomatic ascites."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on olaparib with new peritoneal deposits and rising CA125"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence second-line carboplatin and pegylated liposomal doxorubicin"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Declining performance status with 4kg weight loss but maintaining independence"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged baseline cardiac echo and blood tests"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to palliative care team for symptom management, review in clinic prior to cycle 1 chemotherapy"
      }
    ]
  }
}