{
  "content": "Diagnosis:\tHigh grade serous carcinoma of fallopian tube with liver metastases\n\nManagement:\t12 Jan 2024 Primary debulking surgery - Total abdominal hysterectomy, bilateral salpingo-oophorectomy, omentectomy\n\t\t15 Feb - 20 Mar 2024 Carboplatin/Paclitaxel 3 cycles\n\nHistology:\tHigh grade serous carcinoma, RAD51D mutation positive, HRD score 42\n\nCurrent Situation:\tScreening for ATHENA-MONO trial\n\nI reviewed [redacted name] today to discuss participation in the ATHENA-MONO trial. She has completed 3 cycles of first-line carboplatin/paclitaxel with good partial response, showing approximately 40% reduction in liver metastases on recent CT imaging. She has tolerated treatment well with only grade 1 peripheral neuropathy and manageable fatigue.?\n\nWe discussed the trial in detail, which will randomize between rucaparib maintenance and placebo following completion of platinum-based chemotherapy. I explained the rationale for PARP inhibition particularly given her RAD51D mutation and high HRD score. We reviewed the schedule of visits, additional blood tests and scans required, and potential side effects including fatigue, nausea, and impact on blood counts.?\n\nShe meets all eligibility criteria with adequate organ function, no contraindicated medications, and confirmed partial response to platinum therapy. Her recent blood results show Hb 118, WCC 4.8, Platelets 245, normal renal and liver function. CA125 has decreased from 450 to 125.?\n\nAfter thorough discussion of risks and benefits, [redacted name] is keen to participate. We have completed informed consent process today. She will complete cycles 4-6 of standard chemotherapy, then undergo end of treatment CT scan and baseline trial assessments before randomization. I have arranged screening blood tests, ECG, and updated CT chest/abdomen/pelvis.?\n\nThe plan is to review her again in 2 weeks with screening results and proceed with randomization if all criteria are met. She will continue under regular follow-up in the clinical trials unit.",
  "output": {
    "primary_cancer": {
      "site": "fallopian tube",
      "year": 2024,
      "month": 1,
      "metastases": "liver metastases",
      "histopathology_status": "high grade serous carcinoma",
      "biomarker_status": "RAD51D mutation positive, HRD score 42",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Primary debulking surgery - Total abdominal hysterectomy, bilateral salpingo-oophorectomy, omentectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Carboplatin/Paclitaxel chemotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 decreased from 450 to 125",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT showing 40% reduction in liver metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "clinical_trial_update",
          "value": "Screening for ATHENA-MONO trial of rucaparib maintenance therapy",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "grade 1 peripheral neuropathy"
      },
      {
        "type": "current_symptom",
        "value": "manageable fatigue"
      },
      {
        "type": "investigation_finding",
        "value": "Hb 118, WCC 4.8, Platelets 245, normal renal and liver function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "High grade serous carcinoma of fallopian tube with liver metastases, showing good partial response to first-line chemotherapy. Being screened for PARP inhibitor maintenance trial."
      },
      {
        "type": "latest_treatment_response",
        "value": "40% reduction in liver metastases, CA125 decreased from 450 to 125"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 peripheral neuropathy and manageable fatigue from chemotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "To complete cycles 4-6 of carboplatin/paclitaxel before potential trial randomization"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged screening blood tests, ECG, and updated CT chest/abdomen/pelvis"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with screening results for trial randomization"
      }
    ]
  }
}