{
  "content": "I reviewed [redacted name] today who attended with her sister. Unfortunately, her most recent CT scan from 15th April 2024 shows evidence of disease progression with increasing peritoneal disease and new small volume liver metastases, despite initial good response to platinum-based therapy. To recap, she was diagnosed with BRCA2-positive stage IIIC high grade serous carcinoma of the fallopian tube in September 2023, initially presenting with abdominal distension and early satiety. She underwent primary debulking surgery on 28th September 2023 achieving complete macroscopic clearance, followed by 6 cycles of carboplatin and paclitaxel completed in February 2024. She had an excellent initial response but developed recurrent disease just 6 weeks after completing first-line treatment.\n\nShe has experienced significant deterioration in her symptoms over the past month. Her main issues are increasing abdominal discomfort, particularly after eating, and worsening fatigue affecting her ability to care for herself. She has lost 4kg in weight over the past 6 weeks despite maintaining reasonable oral intake. She describes early satiety and occasional nausea, though denies vomiting. Her performance status has declined from 1 to 2.\n\nOn examination today, there is moderate ascites with shifting dullness and tender hepatomegaly extending 4cm below the costal margin. Her CA125 has risen significantly from 45 to 380 over the past 6 weeks. Given her BRCA2 mutation status and the short platinum-free interval, we have discussed second-line treatment options including the potential role of PARP inhibitors. However, given her current symptoms and the pace of disease progression, I have recommended re-challenge with weekly paclitaxel initially, with consideration of maintenance PARP inhibitor therapy if she achieves disease response.\n\nI have arranged for therapeutic paracentesis next week to help manage her symptoms, and we will commence weekly paclitaxel once her ascites is better controlled. I have also referred her to our palliative care team for additional support with symptom management. We will see her again in clinic in 2 weeks' time to review her response to paracentesis and commence chemotherapy if appropriate. Her sister raised some concerns about psychological support, and I have therefore also made a referral to our clinical psychologist.",
  "output": {
    "primary_cancer": {
      "site": "fallopian tube",
      "year": 2023,
      "month": 9,
      "metastases": "peritoneal disease, new small volume liver metastases",
      "tnm_stage": "",
      "other_stage": "Stage IIIC",
      "histopathology_status": "high grade serous carcinoma",
      "biomarker_status": "BRCA2 positive germline",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "primary debulking surgery achieving complete macroscopic clearance",
          "year": 2023,
          "month": 9
        },
        {
          "type": "treatment_systemic_start",
          "value": "commenced carboplatin and paclitaxel chemotherapy",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_change",
          "value": "completed 6 cycles of carboplatin and paclitaxel",
          "year": 2024,
          "month": 2
        },
        {
          "type": "other_progress_or_event",
          "value": "developed recurrent disease 6 weeks after completing first-line treatment",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 risen from 45 to 380 over 6 weeks",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows increasing peritoneal disease and new small volume liver metastases",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "performance status declined from 1 to 2"
      },
      {
        "type": "current_symptom",
        "value": "increasing abdominal discomfort, particularly after eating"
      },
      {
        "type": "current_symptom",
        "value": "early satiety and occasional nausea"
      },
      {
        "type": "current_symptom",
        "value": "worsening fatigue affecting ability to care for herself"
      },
      {
        "type": "examination_finding",
        "value": "moderate ascites with shifting dullness and tender hepatomegaly extending 4cm below the costal margin"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IIIC BRCA2-positive fallopian tube cancer with early relapse after first-line therapy. Progressive disease with deteriorating symptoms requiring urgent symptom management and second-line treatment"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on CT with rising CA125 despite initial good response to platinum therapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status with 4kg weight loss over 6 weeks and increasing fatigue"
      },
      {
        "type": "planned_investigation",
        "value": "Therapeutic paracentesis arranged for next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks after paracentesis to commence weekly paclitaxel if appropriate"
      }
    ]
  }
}