{
  "content": "Many thanks for referring [redacted name] regarding management of her gallbladder cancer. She was initially diagnosed in January 2024 following investigation of right upper quadrant pain, with CT showing a 4.2cm gallbladder mass and regional lymphadenopathy. She underwent radical cholecystectomy with lymph node dissection on February 15th 2024, confirming a T2N1M0 moderately differentiated adenocarcinoma with 2/8 positive nodes. Immunohistochemistry demonstrated HER2 positivity (IHC 3+).\n\nShe commenced adjuvant gemcitabine/cisplatin on March 20th 2024 and has completed 3 cycles. While radiologically stable on recent imaging, she has experienced significant toxicity including grade 3 neutropenia requiring two hospital admissions and grade 2 peripheral neuropathy. Her performance status has declined from PS 0 to PS 2.\n\nGiven her HER2 positive status and ongoing chemotherapy toxicity, we have discussed modifying her treatment to incorporate trastuzumab. The plan is to continue gemcitabine at 75% dose with the addition of trastuzumab, dropping cisplatin due to cumulative neurotoxicity. She understands the rationale and potential benefits/risks of this approach. Cardiac assessment including echocardiogram has been arranged prior to starting trastuzumab.\n\nShe will require weekly reviews initially to monitor tolerance of the modified regimen. Her next CT scan is scheduled for July 2024 to assess disease status. She has been given clear instructions regarding neutropenic sepsis and has direct contact numbers for the acute oncology team.",
  "output": {
    "primary_cancer": {
      "site": "gallbladder",
      "year": 2024,
      "month": 1,
      "metastases": "regional lymphadenopathy, 2/8 positive nodes",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "moderately differentiated adenocarcinoma",
      "biomarker_status": "HER2 positive (IHC 3+)",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT showing 4.2cm gallbladder mass and regional lymphadenopathy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "radical cholecystectomy with lymph node dissection",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "commenced adjuvant gemcitabine/cisplatin",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "treatment modification due to toxicity - continuing gemcitabine at 75% dose with addition of trastuzumab, stopping cisplatin",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2, declined from PS 0"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 peripheral neuropathy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "HER2 positive gallbladder cancer post surgery, experiencing significant toxicity from adjuvant chemotherapy requiring treatment modification"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "grade 3 neutropenia requiring two hospital admissions and grade 2 peripheral neuropathy"
      },
      {
        "type": "update_to_treatment",
        "value": "modifying treatment to gemcitabine 75% dose plus trastuzumab, stopping cisplatin due to neurotoxicity"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan scheduled for July 2024, cardiac assessment and echocardiogram arranged"
      },
      {
        "type": "follow_up_referral",
        "value": "weekly reviews to monitor tolerance of modified regimen"
      }
    ]
  }
}