{
  "content": "Diagnosis:\tGallbladder adenosquamous carcinoma T4N2M1, diagnosed March 2024\n\tInitial CT 15/03/24 - 8.2cm gallbladder mass with extensive local invasion, multiple liver metastases, peritoneal deposits and retroperitoneal lymphadenopathy\n\tBiopsy confirmed adenosquamous carcinoma, MMR proficient, p53 mutation detected\n?\n[redacted name] is a 62-year-old lady who was diagnosed with advanced gallbladder cancer in March 2024 following presentation with right upper quadrant pain and significant weight loss. She initially commenced on gemcitabine/cisplatin chemotherapy but unfortunately developed rapid clinical deterioration after two cycles with rising bilirubin and new onset ascites. CT imaging on 15/5/24 showed disease progression with increasing size of liver metastases and new pulmonary nodules.\n\nShe has been admitted twice in the past month with symptoms related to disease progression, most recently requiring therapeutic paracentesis for symptomatic ascites. Her performance status has declined significantly from PS 1 at diagnosis to current PS 3. She is now spending most of the day in bed and requires assistance with all activities of daily living.\n\nOn examination today, she appears cachectic with marked peripheral edema. There is a firm, tender hepatomegaly extending 6cm below the costal margin. Chest examination reveals dullness at both bases consistent with small pleural effusions. Ascites is again clinically apparent.\n\nHer blood tests show deteriorating liver function with bilirubin now 98 μmol/L, ALT 156 U/L, ALP 546 U/L. Albumin has dropped to 28 g/L despite supplementation. CA19-9 has risen dramatically from 1200 to 4500 U/mL over the past month.\n\nI have had a lengthy discussion with [redacted name] and her family today about the significant change in her condition. Given her poor performance status and rapidly progressive disease despite first-line chemotherapy, I have explained that further systemic anti-cancer therapy would carry significant risks with little likelihood of benefit. We have discussed focusing on symptom control and quality of life.\n\nI have made an urgent referral to the palliative care team for review of symptom management, particularly her pain and breathlessness. I have prescribed additional breakthrough analgesia and increased her regular MST to 30mg BD. She will be reviewed by our specialist nurse tomorrow for assessment of additional support needs at home. We will arrange weekly community palliative care follow-up and I have provided the acute oncology hotline number for any urgent concerns.",
  "output": {
    "primary_cancer": {
      "site": "gallbladder",
      "year": 2024,
      "month": 3,
      "metastases": "multiple liver metastases, peritoneal deposits, retroperitoneal lymphadenopathy, pulmonary nodules",
      "tnm_stage": "T4N2M1",
      "histopathology_status": "adenosquamous carcinoma",
      "biomarker_status": "MMR proficient, p53 mutation detected",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT shows 8.2cm gallbladder mass with extensive local invasion, multiple liver metastases, peritoneal deposits and retroperitoneal lymphadenopathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started gemcitabine/cisplatin chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows disease progression with increasing liver metastases and new pulmonary nodules",
          "year": 2024,
          "month": 5
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 risen from 1200 to 4500 U/mL",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing systemic therapy due to disease progression and declining performance status",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 3, spending most of day in bed, requires assistance with all activities"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with marked peripheral edema, hepatomegaly 6cm below costal margin, bilateral pleural effusions, ascites"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating liver function - bilirubin 98 μmol/L, ALT 156 U/L, ALP 546 U/L, albumin 28 g/L"
      },
      {
        "type": "current_symptom",
        "value": "Pain requiring regular MST and breakthrough analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Breathlessness"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced gallbladder cancer with rapid progression through first-line chemotherapy and significant clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on imaging with rising tumor markers despite first-line chemotherapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status from PS 1 to PS 3 with increasing care needs"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing systemic therapy and transitioning to palliative care focus"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care team referral, weekly community palliative care follow-up arranged"
      }
    ]
  }
}