{
  "content": "Diagnosis:\n\nGallbladder squamous cell carcinoma, T3N2M1 with peritoneal and liver metastases\n\nPrevious treatment:\nCycle 1-3 Gemcitabine/Cisplatin March-May 2024\nPalliative ascitic drain 15 May 2024\n\nMolecular profile:\np53 mutation positive\nMicrosatellite stable (MSS)\n\nCurrent medications:\nOxycodone MR 40mg BD\nPregabalin 75mg BD\nDexamethasone 4mg OD\nAprepitant PRN\n\nCurrent situation:\nProgressive disease on imaging\nWorsening ascites and pain\nPS 2-3\n\nI reviewed [redacted name] today who has unfortunately shown clear evidence of disease progression. Recent CT performed on 1 June 2024 shows increase in peritoneal disease with new nodules, progression of liver metastases, and re-accumulation of ascites despite recent drainage. Her performance status has declined significantly over the past 3 weeks, now spending most of the day resting and requiring assistance with daily activities.\n\nShe describes worsening right upper quadrant and epigastric pain, partially controlled on current analgesia but requiring increasing breakthrough doses. Her appetite remains poor despite dexamethasone, with early satiety due to ascites. Weight has dropped by 4kg since last review.\n\nGiven her declining performance status and clear evidence of progression through first-line chemotherapy, we have had a detailed discussion about prognosis and future care options. While second-line treatment options exist, including FOLFOX chemotherapy, the likelihood of benefit must be weighed against potential toxicity. [redacted name] wishes to take time to consider her options.\n\nI have increased her oxycodone to 60mg BD and arranged urgent referral to palliative care for symptom management support. We will review her again in one week to discuss treatment decisions. I have provided emergency contact details and arranged for port flush next week.",
  "output": {
    "primary_cancer": {
      "site": "gallbladder",
      "year": 2024,
      "month": 3,
      "metastases": "peritoneal and liver metastases",
      "tnm_stage": "T3N2M1",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p53 mutation positive, microsatellite stable (MSS)",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Gemcitabine/Cisplatin chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Palliative ascitic drain performed",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows increase in peritoneal disease with new nodules, progression of liver metastases, and re-accumulation of ascites",
          "year": 2024,
          "month": 6
        },
        {
          "type": "other_progress_or_event",
          "value": "Performance status decline to PS 2-3, requiring assistance with daily activities",
          "year": 2024,
          "month": 6
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2-3, spending most of day resting and requiring assistance with daily activities"
      },
      {
        "type": "current_symptom",
        "value": "Worsening right upper quadrant and epigastric pain"
      },
      {
        "type": "current_symptom",
        "value": "Poor appetite with early satiety due to ascites"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight loss of 4kg since last review"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced gallbladder cancer showing disease progression through first-line chemotherapy with declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on CT with increasing peritoneal disease and liver metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Oxycodone increased to 60mg BD"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status over past 3 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care and review in one week to discuss treatment decisions"
      },
      {
        "type": "planned_investigation",
        "value": "Port flush arranged for next week"
      }
    ]
  }
}