{
  "content": "Diagnosis:\tGastric adenocarcinoma, mucinous type\n\nManagement:\t15 Jan 2024 Subtotal gastrectomy\n\nHistology:\tpT3N2(6/15)M0 mucinous adenocarcinoma, MSI stable, HER2 negative\n\nCurrent Situation:\tCycle 4 FLOT perioperative chemotherapy\n\nI reviewed [redacted name] today in the GI oncology clinic following completion of cycle 4 FLOT chemotherapy. He has managed reasonably well through treatment despite some challenging toxicities. The grade 2 peripheral neuropathy affecting his hands has improved since the 20% dose reduction of oxaliplatin implemented at cycle 3, though he continues to experience some tingling in his fingertips. His taste alterations have partially resolved, and he reports his appetite is slowly improving. He has maintained his weight at 72kg over the past 3 weeks with support from our dietitian.\n\nHe experienced one episode of neutropenic fever after cycle 3 requiring a 5-day admission, but has since been started on GCSF prophylaxis with good effect. His current performance status remains 1. Today's blood tests show improvement in his neutrophil count to 2.8, with stable hemoglobin at 110 g/L and platelets 156.\n\nOn examination, his surgical wounds have healed well. There is no evidence of disease progression. The recent CT scan performed on 15 April 2024 shows post-surgical changes but no evidence of recurrence.\n\nWe have discussed proceeding with the remaining 4 cycles of perioperative chemotherapy. Given his previous toxicities, we will continue with the reduced dose of oxaliplatin. I have prescribed cycle 5 to commence today with primary GCSF prophylaxis. We will review him again prior to cycle 6 in three weeks' time. I have provided him with written information about managing peripheral neuropathy and reinforced the importance of reporting any new symptoms promptly.",
  "output": {
    "primary_cancer": {
      "site": "gastric",
      "year": 2024,
      "month": 1,
      "metastases": "",
      "tnm_stage": "pT3N2M0",
      "histopathology_status": "mucinous adenocarcinoma, 6/15 nodes positive",
      "biomarker_status": "MSI stable, HER2 negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Subtotal gastrectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "20% dose reduction of oxaliplatin implemented at cycle 3 due to grade 2 peripheral neuropathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Neutropenic fever requiring 5-day admission after cycle 3",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Started on GCSF prophylaxis after neutropenic fever episode",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT scan shows post-surgical changes but no evidence of recurrence",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Tingling in fingertips from peripheral neuropathy"
      },
      {
        "type": "current_symptom",
        "value": "Partial taste alterations"
      },
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "investigation_finding",
        "value": "Neutrophils 2.8, hemoglobin 110 g/L, platelets 156"
      },
      {
        "type": "examination_finding",
        "value": "Surgical wounds healed well, no evidence of disease progression"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Post-operative gastric cancer patient receiving adjuvant FLOT chemotherapy. Managing reasonably well after dose modifications and addition of GCSF support"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 peripheral neuropathy improved since oxaliplatin dose reduction"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing FLOT chemotherapy with reduced dose oxaliplatin and primary GCSF prophylaxis"
      },
      {
        "type": "planned_investigation",
        "value": "Review prior to cycle 6 with blood tests"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in three weeks' time"
      }
    ]
  }
}