{
  "content": "Diagnosis:\n\nLocally advanced gastric adenocarcinoma with signet ring cell features and peritoneal carcinomatosis\n\nStaging:\nT4bN3bM1, Stage IV at diagnosis January 2024\nMSI stable, HER2 negative\n\nPrevious treatment:\nCycle 1-3 EOX completed March 2024\nCycle 4 discontinued due to progressive disease and deteriorating performance status\n\nPrevious medical history:\nType 2 diabetes\nHypertension\nChronic kidney disease stage 3\n\nCurrent medications:\nOndansetron 8mg TDS PRN\nDexamethasone 4mg BD\nOxycodone MR 30mg BD\nOxycodone IR 5mg PRN\nMetformin 1g BD\nRamipril 5mg OD\n\nCurrent situation:\nProgressive disease with new liver metastases\nDeteriorating performance status (ECOG 3)\nIncreasing ascites requiring weekly paracentesis\n\nI reviewed [redacted name] today who attended with his daughter. Unfortunately, his condition has significantly deteriorated since our last review three weeks ago. He reports worsening abdominal distension requiring increased frequency of paracentesis, now weekly. His appetite remains poor with early satiety, and he has lost a further 4kg, now weighing 62kg (down from 78kg at diagnosis). He is spending approximately 70% of the day in bed or resting due to fatigue.\n\nThe recent CT scan from 15/04/2024 shows disease progression with new liver metastases in segments 4 and 7, measuring up to 3.2cm, and increasing peritoneal disease with omental caking. There is moderate volume ascites and evidence of small bowel obstruction at multiple levels.\n\nGiven his deteriorating performance status and disease progression on first-line chemotherapy, we have had a detailed discussion about prognosis and goals of care. While second-line treatment options exist (weekly paclitaxel), the risks likely outweigh potential benefits at this stage. [redacted name] and his family understand this and wish to focus on symptom management.\n\nI have referred urgently to the palliative care team for community support and referred to the hospice for assessment. We will continue with planned paracentesis as needed. I have increased his background opiates for pain control and prescribed additional anti-emetics. We will review him again in two weeks' time, sooner if needed, with involvement of the palliative care team.",
  "output": {
    "primary_cancer": {
      "site": "gastric",
      "year": 2024,
      "month": 1,
      "metastases": "peritoneal carcinomatosis, liver metastases",
      "tnm_stage": "T4bN3bM1",
      "other_stage": "Stage IV",
      "histopathology_status": "adenocarcinoma with signet ring cell features",
      "biomarker_status": "MSI stable, HER2 negative",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started EOX chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "EOX discontinued after cycle 4 due to progressive disease and deteriorating performance status",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows new liver metastases in segments 4 and 7 up to 3.2cm, increasing peritoneal disease with omental caking, moderate ascites, and small bowel obstruction",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Chronic kidney disease stage 3"
      },
      {
        "type": "performance_status",
        "value": "ECOG PS 3, spending 70% of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Worsening abdominal distension requiring weekly paracentesis"
      },
      {
        "type": "current_symptom",
        "value": "Poor appetite with early satiety"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight loss to 62kg from 78kg at diagnosis"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IV gastric cancer with progressive disease after first-line chemotherapy. Significant clinical deterioration with increasing ascites and new liver metastases"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with new liver metastases and increasing peritoneal disease"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing care needs"
      },
      {
        "type": "update_to_treatment",
        "value": "Decision to discontinue active treatment and focus on symptom management"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and hospice for assessment"
      }
    ]
  }
}