{
  "content": "Diagnosis:\n\nGastric adenocarcinoma with mixed intestinal and diffuse type features\n\nStaging 15 April 2024 - T4aN2M1 with peritoneal carcinomatosis, multiple liver metastases and bilateral pulmonary nodules. HER2 positive (2+ on IHC, FISH amplified).\n\nPrevious medical history:\nType 2 diabetes\nHypertension\nChronic kidney disease stage 3\n\nCurrent medications:\nMetformin 1g BD\nAmlodipine 10mg OD\nRamipril 5mg OD\n\nAllergies:\nPenicillin - severe rash\n\nCurrent situation:\nProgressive disease with deteriorating performance status\n\nI reviewed [redacted name] today who was accompanied by his wife and daughter. He presented initially six weeks ago with progressive epigastric pain, early satiety, and significant weight loss of 12kg over 3 months. Initial endoscopy on 28 March 2024 revealed a large gastric mass at the cardia extending onto the lesser curve. Biopsies confirmed mixed type adenocarcinoma with both intestinal and diffuse components.\n\nStaging CT on 15 April 2024 demonstrated the primary gastric tumor with extensive local invasion, multiple enlarged perigastric and celiac nodes, widespread peritoneal deposits, multiple liver metastases predominantly in the right lobe (largest 4.2cm), and several sub-centimeter pulmonary nodules bilaterally. HER2 testing was positive on FISH analysis following equivocal (2+) immunohistochemistry.\n\nHis symptoms have significantly worsened over the past two weeks with increasing abdominal pain requiring regular opiates, progressive early satiety, and new onset ascites causing abdominal distension. His performance status has deteriorated from 1 to 2-3, now spending more than 50% of the day resting. Current weight is 58kg (down from 72kg in January 2024).\n\nOn examination today, he appears cachectic with moderate peripheral edema. Abdominal examination reveals shifting dullness consistent with ascites, a palpable epigastric mass, and tender hepatomegaly extending 4cm below the costal margin. There is reduced chest expansion bilaterally with dullness to percussion at both bases.\n\nI have discussed the diagnosis and prognosis at length with [redacted name] and his family. Given his HER2 positive status, I have recommended combination chemotherapy with FOLFOX plus trastuzumab. We discussed the aims of treatment being to improve his symptoms and hopefully extend survival, while acknowledging the palliative intent. I have explained common side effects including neuropathy, fatigue, and cardiac monitoring requirements.\n\nPlan:\n1. Urgent paracentesis for symptomatic ascites\n2. Start FOLFOX-Trastuzumab once ascites drained and performance status improved\n3. Referral to palliative care team for specialist symptom management\n4. Arrange baseline cardiac ECHO and insertion of PICC line\n5. Review in one week with blood results and after paracentesis\n\nI have provided written information about chemotherapy and arranged urgent admission for paracentesis tomorrow. The palliative care team will review him during admission.",
  "output": {
    "primary_cancer": {
      "site": "gastric, cardia extending onto lesser curve",
      "year": 2024,
      "month": 3,
      "metastases": "peritoneal carcinomatosis, multiple liver metastases (largest 4.2cm), bilateral pulmonary nodules",
      "tnm_stage": "T4aN2M1",
      "histopathology_status": "mixed adenocarcinoma with intestinal and diffuse type features",
      "biomarker_status": "HER2 positive (2+ on IHC, FISH amplified)",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Endoscopy shows large gastric mass at cardia extending onto lesser curve",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsy confirms mixed type adenocarcinoma with intestinal and diffuse components",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows primary tumor with local invasion, perigastric and celiac nodes, peritoneal deposits, liver metastases, and pulmonary nodules",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "HER2 testing positive on FISH analysis following equivocal (2+) immunohistochemistry",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Chronic kidney disease stage 3"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal pain requiring regular opiates"
      },
      {
        "type": "current_symptom",
        "value": "Progressive early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Ascites causing abdominal distension"
      },
      {
        "type": "performance_status",
        "value": "Performance status 2-3, spending >50% of day resting"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with moderate peripheral edema, ascites, palpable epigastric mass, tender hepatomegaly 4cm below costal margin"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight decreased from 72kg to 58kg since January 2024"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed metastatic HER2-positive gastric cancer with rapid clinical deterioration. Progressive symptoms with declining performance status requiring urgent intervention before starting palliative systemic therapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Performance status deteriorated from 1 to 2-3 over past two weeks with increasing symptoms"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence FOLFOX-Trastuzumab following paracentesis and performance status improvement"
      },
      {
        "type": "planned_investigation",
        "value": "Arrange baseline cardiac ECHO and PICC line insertion"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in one week following paracentesis, urgent referral to palliative care team"
      }
    ]
  }
}