{
  "content": "Diagnosis:\tGastric adenocarcinoma, mucinous type, T4bN3aM1 with peritoneal disease and extensive nodal involvement\n\nI reviewed [redacted name] today in the Upper GI oncology clinic, accompanied by his daughter. Unfortunately, his most recent CT scan from 15th April 2024 shows clear evidence of disease progression with increasing peritoneal disease and new ascites, despite initial response to FLOT chemotherapy.\n\nTo recap, [redacted name] was diagnosed in January 2024 following investigation of progressive dysphagia and weight loss. Initial staging showed a T4b gastric primary with extensive nodal disease and peritoneal metastases. Molecular testing confirmed MSI-high status and EBV negativity. He commenced FLOT chemotherapy on 1st February 2024 and initially showed good partial response after 3 cycles, with improvement in symptoms and reduction in the primary tumor mass.\n\nHowever, he has experienced deteriorating symptoms over the past 3 weeks with increasing abdominal distension, early satiety, and recurrence of dysphagia. His weight has dropped by 4kg since last review. Performance status has declined from 1 to 2. On examination today, there is obvious ascites with shifting dullness and tender hepatomegaly. His blood tests show new hypoalbuminaemia at 28 g/L and rising CA19-9 from 450 to 890.\n\nGiven his MSI-high status and progression on first-line chemotherapy, I have discussed starting immunotherapy with pembrolizumab. We reviewed the potential benefits and side effects in detail. He understands this offers a 40-45% chance of response but may take 8-12 weeks to show effect. In the meantime, I have arranged urgent paracentesis to manage his ascites and referred him to the dietitian for nutritional support.\n\nThe plan is to proceed with pembrolizumab, starting next week. I have also referred him to palliative care for additional support with symptom management. We will review him in 2 weeks with blood tests, sooner if symptoms worsen. I have provided both verbal and written information about immunotherapy and management of potential side effects.",
  "output": {
    "primary_cancer": {
      "site": "gastric",
      "year": 2024,
      "month": 1,
      "metastases": "peritoneal disease and extensive nodal involvement",
      "tnm_stage": "T4bN3aM1",
      "histopathology_status": "mucinous adenocarcinoma",
      "biomarker_status": "MSI high, EBV negative",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial presentation with progressive dysphagia and weight loss",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started FLOT chemotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "other_progress_or_event",
          "value": "Good partial response after 3 cycles FLOT with reduction in primary tumor mass",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows disease progression with increasing peritoneal disease and new ascites",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Rising CA19-9 from 450 to 890, hypoalbuminaemia at 28 g/L",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 2"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal distension, early satiety, and recurrence of dysphagia"
      },
      {
        "type": "examination_finding",
        "value": "Obvious ascites with shifting dullness and tender hepatomegaly"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight loss of 4kg since last review"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced gastric cancer progressing on first-line FLOT chemotherapy with deteriorating symptoms. Planning switch to immunotherapy given MSI-high status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on FLOT chemotherapy with increasing peritoneal disease and new ascites"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing FLOT and switching to pembrolizumab immunotherapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status from 1 to 2 with increasing symptoms"
      },
      {
        "type": "planned_investigation",
        "value": "Review in 2 weeks with blood tests"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral for paracentesis, dietitian referral for nutritional support, and palliative care referral for symptom management"
      }
    ]
  }
}