{
  "content": "Diagnosis:\tLocally advanced gastric adenocarcinoma with signet ring cell features and peritoneal carcinomatosis\n\nI reviewed [redacted name] today who is currently receiving third-line treatment with weekly Paclitaxel. Unfortunately, she has experienced further clinical deterioration since our last review three weeks ago. Her performance status has declined from ECOG 2 to ECOG 3, spending approximately 70% of the day in bed or resting. She describes worsening abdominal distention and early satiety, managing only small sips of fluid and minimal oral intake. She has lost a further 3kg since last review, now weighing 48kg (down from 62kg at diagnosis in January 2024).\n\nShe had previously progressed through FLOT chemotherapy which was discontinued after 2 cycles due to grade 3 neutropenia and significant deterioration in performance status. Second-line FOLFIRI was attempted but discontinued after 1 cycle due to severe mucositis and admission with neutropenic sepsis. Weekly Paclitaxel was commenced 4 weeks ago as a last attempt at disease modification.\n\nCT imaging performed last week shows progressive disease with increased peritoneal disease, new ascites, and development of small bowel obstruction. Blood results show deteriorating renal function with eGFR 38 (previously 55) and albumin 24.\n\nOn examination today, she appears cachectic with marked peripheral edema. Her abdomen is distended with shifting dullness indicating ascites, and there is tenderness in the epigastrium and right upper quadrant. Chest examination reveals reduced air entry at both bases.\n\nI have had a detailed discussion with [redacted name] and her daughter about the rapid progression of disease despite three lines of treatment. Given her declining performance status, progressive disease, and significant symptom burden, I have recommended discontinuing active anti-cancer therapy and focusing on symptom control. I have made an urgent referral to the palliative care team and arranged admission to the local hospice for symptom management. I have prescribed additional anti-emetics and arranged paracentesis for symptomatic relief of ascites.\n\nThe palliative care team will take over her ongoing care with input from our team as needed. I have explained to [redacted name] and her family that the prognosis is now limited to weeks rather than months, and they understand this. They have my direct contact details if needed.",
  "output": {
    "primary_cancer": {
      "site": "gastric",
      "year": 2024,
      "month": 1,
      "metastases": "peritoneal carcinomatosis, ascites, small bowel involvement",
      "tnm_stage": "T4bN3bM1",
      "histopathology_status": "adenocarcinoma with signet ring cell features",
      "biomarker_status": "PDL1 CPS 2",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started FLOT chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "FLOT discontinued after 2 cycles due to grade 3 neutropenia and deteriorating performance status",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started second-line FOLFIRI",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "FOLFIRI discontinued after 1 cycle due to severe mucositis and neutropenic sepsis",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started weekly Paclitaxel as third-line therapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progressive peritoneal disease, new ascites, and small bowel obstruction",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Decision to discontinue active anti-cancer therapy due to disease progression and declining status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, spending 70% of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Worsening abdominal distention and early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Minimal oral intake, managing only small sips"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with marked peripheral edema, distended abdomen with shifting dullness, reduced air entry at both bases"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating renal function with eGFR 38, albumin 24"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced gastric cancer with rapid progression through three lines of therapy. Now with clinical deterioration and transition to palliative care"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on imaging with clinical deterioration"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Declined from ECOG PS 2 to 3 with significant weight loss to 48kg from 62kg at diagnosis"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing active anti-cancer therapy, switching to palliative care approach"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and arranged hospice admission"
      }
    ]
  }
}