{
  "content": "Diagnosis:\tMetastatic gastric adenocarcinoma with peritoneal and bone metastases\n\nManagement:\t15 March 2024 Diagnostic laparoscopy with peritoneal biopsies\n\nHistology:\tPoorly differentiated diffuse-type adenocarcinoma, MSI stable, PD-L1 CPS <1\n\nCurrent Situation:\tInitial oncology assessment\n\nI reviewed [redacted name] today who was accompanied by his wife following recent diagnosis of metastatic gastric cancer. He initially presented in January 2024 with progressive epigastric discomfort, early satiety, and significant weight loss of 12kg over 3 months. Upper GI endoscopy revealed a large ulcerated mass at the gastro-oesophageal junction with adjacent satellite lesions. Staging CT demonstrated widespread peritoneal disease with omental caking and moderate volume ascites. There were also multiple sclerotic bone metastases throughout the axial skeleton.\n\nHe underwent diagnostic laparoscopy on 15/3/24 which confirmed extensive peritoneal disease. Biopsies showed poorly differentiated diffuse-type adenocarcinoma. Molecular testing has confirmed microsatellite stable disease with PD-L1 CPS <1.\n\nHis symptoms have significantly worsened over the past month. He now requires regular opioid analgesia for bone pain affecting his thoracic spine and left hip. His performance status has deteriorated to ECOG 2, and he is spending approximately 50% of the day resting. He can only manage small frequent meals due to early satiety and has lost a further 3kg since diagnosis. He has developed peripheral edema requiring furosemide.\n\nIn his past medical history, he has well-controlled type 2 diabetes and hypertension. Current medications include regular morphine sulfate 30mg BD, breakthrough oxycodone, metformin, ramipril, and recently started furosemide 40mg OD. He lives with his wife who provides excellent support. He has two adult children who live nearby.\n\nOn examination today, he appears cachectic with peripheral edema to mid-shin. His abdomen is distended with shifting dullness suggesting ascites, and there is epigastric tenderness without guarding. There is point tenderness over T8 vertebra.\n\nI have discussed his diagnosis and prognosis at length. Given his deteriorating performance status and symptomatic disease, I have recommended commencing systemic treatment with FOLFOX chemotherapy. I have explained the aims of treatment are to improve his symptoms and hopefully extend his life, though we cannot cure the cancer. We have discussed common side effects including neuropathy, fatigue, and increased infection risk.\n\nI have arranged for urgent CT-guided bone biopsy of the T8 vertebra to confirm metastatic disease and assess for targeted therapy options. He will require PICC line insertion prior to chemotherapy. I have referred him to our palliative care team for additional support with symptom management. We will review him next week with all results to commence treatment if appropriate.",
  "output": {
    "primary_cancer": {
      "site": "gastric, gastro-oesophageal junction",
      "year": 2024,
      "month": 1,
      "metastases": "widespread peritoneal disease with omental caking, multiple sclerotic bone metastases throughout axial skeleton",
      "other_stage": "Stage IV",
      "histopathology_status": "poorly differentiated diffuse-type adenocarcinoma",
      "biomarker_status": "MSI stable, PD-L1 CPS <1",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial presentation with epigastric discomfort, early satiety, and 12kg weight loss",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Upper GI endoscopy showing large ulcerated mass at gastro-oesophageal junction with satellite lesions",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT showing widespread peritoneal disease with omental caking and moderate volume ascites, multiple sclerotic bone metastases",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Diagnostic laparoscopy confirming extensive peritoneal disease",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsies showing poorly differentiated diffuse-type adenocarcinoma, MSI stable, PD-L1 CPS <1",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2, spending approximately 50% of day resting"
      },
      {
        "type": "current_symptom",
        "value": "Bone pain affecting thoracic spine and left hip requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety with further 3kg weight loss since diagnosis"
      },
      {
        "type": "current_symptom",
        "value": "Peripheral edema requiring furosemide"
      },
      {
        "type": "comorbidity",
        "value": "Well-controlled type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with peripheral edema to mid-shin"
      },
      {
        "type": "examination_finding",
        "value": "Abdomen distended with shifting dullness suggesting ascites, epigastric tenderness"
      },
      {
        "type": "examination_finding",
        "value": "Point tenderness over T8 vertebra"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed metastatic gastric cancer with peritoneal and bone disease. Deteriorating performance status with significant symptom burden requiring urgent systemic therapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence FOLFOX chemotherapy pending investigations"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent CT-guided bone biopsy of T8 vertebra"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week to commence treatment if appropriate"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to palliative care team for symptom management support"
      }
    ]
  }
}