{
  "content": "Diagnosis:\tGastric adenocarcinoma, T2N1M0\n\nManagement:\t15 Mar 2024 Subtotal gastrectomy with D2 lymphadenectomy\n\nHistology:\tModerately differentiated adenocarcinoma, T2N1(2/15)M0, R0 resection. HER2 negative, MSI stable.\n\nCurrent Situation:\tPost-operative assessment for adjuvant chemotherapy\n\nI reviewed [redacted name] today following his recent subtotal gastrectomy. He has recovered well from surgery with no post-operative complications. His weight is stable at 72kg (pre-operative weight 75kg) and he is managing a soft diet with small frequent meals. Performance status is 1.\n\nHe has no significant comorbidities apart from well-controlled hypertension on ramipril. He lives with his wife and continues to be active, walking 30 minutes daily.\n\nGiven the presence of lymph node involvement and T2 disease, I have recommended adjuvant CAPOX chemotherapy for 6 cycles. We discussed the aims of treatment and potential side effects including neuropathy, diarrhea, and fatigue. He understands to contact us if any concerns arise during treatment.\n\nBaseline bloods today show satisfactory renal function and normal LFTs. I have prescribed cycle 1 CAPOX to commence next week. We will review him prior to cycle 2 in three weeks' time.",
  "output": {
    "primary_cancer": {
      "site": "gastric",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "moderately differentiated adenocarcinoma",
      "biomarker_status": "HER2 negative, MSI stable",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Subtotal gastrectomy with D2 lymphadenectomy, R0 resection",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Pathology confirms T2N1(2/15)M0, moderately differentiated adenocarcinoma, HER2 negative, MSI stable",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Plan to commence adjuvant CAPOX chemotherapy for 6 cycles",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "comorbidity",
        "value": "well-controlled hypertension on ramipril"
      },
      {
        "type": "quality_of_life_finding",
        "value": "active, walking 30 minutes daily"
      },
      {
        "type": "investigation_finding",
        "value": "satisfactory renal function and normal LFTs"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed gastric adenocarcinoma post successful R0 resection. Good recovery from surgery and suitable for adjuvant chemotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Prescribed cycle 1 CAPOX to commence next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Review prior to cycle 2 in three weeks"
      }
    ]
  }
}