{
  "content": "Diagnosis:\tSquamous cell carcinoma of hypopharynx (pyriform fossa)\n\nManagement:\t15 Mar 2024 Diagnostic panendoscopy and biopsy\n\nHistology:\tModerately differentiated squamous cell carcinoma, p16 negative\n\nStaging:\tT3N1M0 (Stage III)\n\nCurrent Situation:\tPost-operative assessment prior to definitive treatment\n\nI reviewed [redacted name] today following his recent diagnosis of hypopharyngeal cancer. The initial presenting symptoms were progressive dysphagia to solids over 3 months and a right-sided neck lump noticed 6 weeks ago. He denies any weight loss or voice changes. His performance status remains excellent at PS 0.\n\nImaging shows a 4.2cm primary tumor involving the right pyriform fossa with a single ipsilateral level II lymph node measuring 2.1cm. CT chest and upper abdomen show no evidence of distant metastatic disease.\n\nOn examination today, flexible nasendoscopy shows the previously documented tumor in the right pyriform fossa with normal vocal cord movement bilaterally. The right level II node remains palpable but mobile.\n\nI have discussed his case at our Head and Neck MDT on 20th March. The consensus recommendation is for primary chemoradiotherapy with concurrent cisplatin. I have explained the treatment process, including the need for a prophylactic feeding tube placement. He will require dental assessment and radiotherapy planning CT next week.\n\nThe plan is to commence treatment in 2 weeks' time. We will arrange weekly reviews during treatment in our combined Head and Neck clinic. I have provided written information about chemoradiotherapy and arranged for our specialist nurse to discuss supportive care.",
  "output": {
    "primary_cancer": {
      "site": "hypopharynx, right pyriform fossa",
      "year": 2024,
      "month": 3,
      "metastases": "single ipsilateral level II lymph node",
      "tnm_stage": "T3N1M0",
      "other_stage": "Stage III",
      "histopathology_status": "moderately differentiated squamous cell carcinoma",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "4.2cm primary tumor in right pyriform fossa with 2.1cm level II lymph node",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Diagnostic panendoscopy and biopsy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsy confirms moderately differentiated squamous cell carcinoma, p16 negative",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Head and Neck MDT recommendation for primary chemoradiotherapy",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 0"
      },
      {
        "type": "current_symptom",
        "value": "Progressive dysphagia to solids over 3 months"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided neck lump for 6 weeks"
      },
      {
        "type": "examination_finding",
        "value": "Tumor in right pyriform fossa with normal vocal cord movement, palpable but mobile right level II node"
      },
      {
        "type": "investigation_finding",
        "value": "CT chest and upper abdomen show no evidence of distant metastatic disease"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed stage III hypopharyngeal cancer. Initial assessment following diagnostic biopsy, planned for definitive chemoradiotherapy."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence concurrent cisplatin chemoradiotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "Dental assessment and radiotherapy planning CT next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly reviews during treatment in combined Head and Neck clinic"
      }
    ]
  }
}