{
  "content": "Diagnosis:\tLocally advanced hypopharyngeal squamous cell carcinoma\n\nStaging:\tT2N1M0 (AJCC 8th edition)\n\tP16 negative, PDL1 CPS 35\n\nTreatment:\tCompleted induction TPF chemotherapy March 2024\n\tCurrent - concurrent cisplatin-radiotherapy\n\nCurrent Situation:\tWeek 4 of radiotherapy\n\nI reviewed [redacted name] today during radiotherapy. He has completed 4 weeks of treatment, receiving 44Gy of the planned 70Gy in 35 fractions. He received cycle 1 cisplatin (100mg/m2) on day 1, but developed grade 3 acute kidney injury with creatinine rising to 198. This has now improved with supportive care to 132, but remains above baseline.\n\nHe has grade 2 radiation-induced mucositis requiring regular soluble morphine and nutritional supplements. His weight has dropped by 4kg despite dietetic support. He remains PS 1 and motivated to continue treatment.\n\nAfter discussion with [redacted name] and the wider team, we will switch from high-dose cisplatin to weekly carboplatin AUC 1.5 for the remaining 3 weeks of treatment. This offers a better safety profile given his demonstrated cisplatin toxicity.\n\nHe will continue daily radiotherapy as planned. I have arranged weekly blood tests including renal function and magnesium. He will be reviewed twice weekly in the combined radiotherapy clinic. I have also arranged a PET-CT for 12 weeks after treatment completion to assess response.",
  "output": {
    "primary_cancer": {
      "site": "hypopharynx",
      "tnm_stage": "T2N1M0",
      "other_stage": "Locally advanced",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p16 negative, PDL1 CPS 35",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Completed induction TPF chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Started radical radiotherapy 70Gy in 35 fractions with concurrent cisplatin",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cycle 1 cisplatin complicated by grade 3 acute kidney injury, creatinine rising to 198",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Switching from high-dose cisplatin to weekly carboplatin AUC 1.5 due to renal toxicity",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 radiation-induced mucositis requiring regular soluble morphine"
      },
      {
        "type": "investigation_finding",
        "value": "Creatinine improved to 132 but remains above baseline"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Locally advanced hypopharyngeal cancer receiving chemoradiotherapy. Treatment modification required due to cisplatin-induced nephrotoxicity"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 acute kidney injury from cisplatin, grade 2 radiation mucositis"
      },
      {
        "type": "update_to_treatment",
        "value": "Switching to weekly carboplatin AUC 1.5 for remaining 3 weeks of concurrent chemoradiotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "PET-CT arranged for 12 weeks post-treatment completion"
      },
      {
        "type": "follow_up_referral",
        "value": "Twice weekly reviews in combined radiotherapy clinic with weekly blood tests"
      }
    ]
  }
}