{
  "content": "Diagnosis:\t\tT3N1M0 p16 negative squamous cell carcinoma of hypopharynx\n\nManagement:\t\tDiagnosed following direct laryngoscopy and biopsy 15 March 2024\n\nHistology:\t\tModerately differentiated squamous cell carcinoma, p16 negative\n\nCurrent Situation:\tInitial oncology assessment\n\n[redacted name] is a 67-year-old gentleman who presents with a three-month history of progressive dysphagia, initially for solids and now affecting liquids, associated with a 6kg weight loss. He describes some right-sided neck discomfort but denies otalgia or respiratory symptoms. He has continued smoking approximately 20 cigarettes daily for 45 years and drinks 30 units of alcohol weekly. His performance status is 1.\n\nImaging demonstrates a 4.2cm mass arising from the right pyriform fossa with extension into the postcricoid region. There is a single right level II lymph node measuring 2.1cm. Staging CT chest and upper abdomen shows no evidence of distant metastatic disease.\n\nI have discussed his case in detail at our head and neck MDT. The consensus recommendation is for primary chemoradiotherapy with weekly cisplatin. I have explained the treatment process, including the need for a prophylactic feeding tube placement. He will require dental assessment and baseline hearing test prior to treatment initiation. We plan to commence treatment in 2 weeks following completion of these assessments. I have provided written information about chemoradiotherapy and arranged review with our specialist nurse for additional support.",
  "output": {
    "primary_cancer": {
      "site": "hypopharynx, right pyriform fossa with postcricoid extension",
      "year": 2024,
      "month": 3,
      "metastases": "single right level II lymph node",
      "tnm_stage": "T3N1M0",
      "other_stage": "Stage III",
      "histopathology_status": "moderately differentiated squamous cell carcinoma",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "direct laryngoscopy and biopsy performed",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "4.2cm mass in right pyriform fossa with postcricoid extension and single 2.1cm right level II node",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsy confirms moderately differentiated squamous cell carcinoma, p16 negative",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Progressive dysphagia affecting both solids and liquids"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided neck discomfort"
      },
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "quality_of_life_finding",
        "value": "6kg weight loss over three months"
      },
      {
        "type": "investigation_finding",
        "value": "Staging CT chest and upper abdomen shows no evidence of distant metastatic disease"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed locally advanced hypopharyngeal cancer. Initial oncology assessment for planned primary chemoradiotherapy."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for primary chemoradiotherapy with weekly cisplatin"
      },
      {
        "type": "planned_investigation",
        "value": "Requires dental assessment and baseline hearing test"
      },
      {
        "type": "follow_up_referral",
        "value": "Review with specialist nurse arranged and treatment to commence in 2 weeks"
      }
    ]
  }
}