{
  "content": "Many thanks for referring [redacted name] who I reviewed today with his wife and daughter present. He is a 62-year-old gentleman with locally advanced hypopharyngeal squamous cell carcinoma, initially diagnosed in January 2024 following investigation of progressive dysphagia and right-sided neck mass. Initial staging demonstrated a T3N2bM0 p16-negative squamous cell carcinoma of the right pyriform fossa with significant right-sided lymphadenopathy.\n\nHe initially received concurrent chemoradiotherapy with cisplatin completed in March 2024, achieving partial response on imaging. Unfortunately, restaging CT in April 2024 demonstrated new vertebral metastases at T4 and L2, confirmed on subsequent bone scan. He commenced palliative chemotherapy with weekly paclitaxel and carboplatin in early May 2024, but treatment has been challenging with grade 3 neutropenia requiring two dose reductions and frequent delays.\n\nHe presents today with significant deterioration in his general condition. His performance status has declined from ECOG 1 to ECOG 3 over the past three weeks, now spending most of the day in bed due to severe fatigue and bone pain. He reports worsening dysphagia requiring modification of all foods and liquids, progressive neck pain, and new onset headaches. His weight has dropped by 4kg since last review despite nutritional supplements.\n\nIn his background, he has type 2 diabetes managed with metformin and gliclazide, and hypertension controlled on ramipril. He previously worked as a construction manager but has been unable to work since diagnosis. He lives with his wife who is struggling to manage his increasing care needs.\n\nGiven his marked clinical deterioration, I have arranged urgent MRI brain and spine to investigate his new neurological symptoms. His case will be discussed at tomorrow's MDT meeting to consider urgent palliative radiotherapy to symptomatic sites. I have commenced dexamethasone 4mg twice daily and increased his analgesia to MST 30mg twice daily with immediate release morphine for breakthrough pain.\n\nI have made an urgent referral to the palliative care team for support with symptom management and have arranged district nurse involvement. We will review him next week with the scan results and MDT outcome. In the meantime, he has open access to our acute oncology service if needed.",
  "output": {
    "primary_cancer": {
      "site": "hypopharynx, right pyriform fossa",
      "year": 2024,
      "month": 1,
      "metastases": "vertebral metastases at T4 and L2",
      "tnm_stage": "T3N2bM0",
      "other_stage": "Stage III",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Initial presentation with right-sided neck mass and progressive dysphagia",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced concurrent chemoradiotherapy with cisplatin",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Achieved partial response on imaging following chemoradiotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Restaging CT showed new vertebral metastases at T4 and L2, confirmed on bone scan",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started palliative chemotherapy with weekly paclitaxel and carboplatin",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Required two dose reductions and frequent delays due to grade 3 neutropenia",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, deteriorated from ECOG 1 over past three weeks"
      },
      {
        "type": "current_symptom",
        "value": "Severe fatigue and bone pain, spending most of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Worsening dysphagia requiring modification of all foods and liquids"
      },
      {
        "type": "current_symptom",
        "value": "Progressive neck pain and new onset headaches"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes managed with metformin and gliclazide"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension controlled on ramipril"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight loss of 4kg since last review despite nutritional supplements"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Locally advanced hypopharyngeal cancer with new bone metastases. Significant clinical deterioration with declining performance status and new neurological symptoms requiring urgent investigation"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 neutropenia requiring dose reductions and delays in palliative chemotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Started dexamethasone 4mg twice daily and increased MST to 30mg twice daily"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Marked deterioration in performance status from ECOG 1 to 3 over three weeks"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI brain and spine to investigate new neurological symptoms"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and district nurses, review next week with scan results and MDT outcome"
      }
    ]
  }
}