{
  "content": "Diagnosis:\tMetastatic clear cell renal cell carcinoma with widespread metastatic disease\n\tInitial right nephrectomy March 2023\n\tDisease progression with new pulmonary and bone metastases September 2023\n\tFurther progression on immunotherapy January 2024\n?\nI reviewed [redacted name] today who attended with his wife. Unfortunately, his most recent CT scan from last week shows further disease progression despite treatment with pembrolizumab/axitinib combination therapy. There are enlarging pulmonary metastases with the largest lesion now measuring 4.2cm (previously 2.8cm), new liver metastases in segments 4 and 7, and progression in known bone metastases including a new pathological fracture of T8 vertebra.\n?\nHe reports increasing breathlessness on minimal exertion and significant thoracic back pain, which has been particularly troublesome over the past two weeks. His mobility has declined significantly, and he now requires a wheelchair for anything more than very short distances. His appetite remains poor with ongoing weight loss - now 62kg from 78kg at diagnosis. His performance status has deteriorated to ECOG 3.\n?\nWe had a detailed discussion about his disease progression and treatment options. Given the symptomatic bone metastases, I have arranged urgent palliative radiotherapy to the T8 vertebra (20Gy in 5 fractions) starting tomorrow. I have also referred him to our spinal team for assessment regarding vertebral stability.\n?\nRegarding systemic therapy, we discussed the option of second-line treatment with cabozantinib. However, given his declining performance status and the rapid progression, I have concerns about his ability to tolerate further systemic therapy at this time. We agreed to pause active treatment temporarily while he undergoes radiotherapy and receives support from our palliative care team to improve his symptom control.\n?\nI have increased his analgesia today, adding sustained-release morphine (Zomorph 30mg BD) alongside his current PRN oxycodone. Our palliative care team will review him tomorrow to optimize his symptom management. I have also prescribed dexamethasone 8mg daily with PPI cover to help with cancer-related fatigue and appetite.\n?\nWe will review him again in our clinic in two weeks' time after completion of radiotherapy, with a view to reassessing his fitness for second-line treatment. In the meantime, he has the acute oncology hotline number and understands to contact us if he develops any new concerning symptoms.",
  "output": {
    "primary_cancer": {
      "site": "kidney, right",
      "year": 2023,
      "month": 3,
      "metastases": "pulmonary metastases, liver metastases in segments 4 and 7, bone metastases including T8 vertebra",
      "other_stage": "Stage IV",
      "histopathology_status": "clear cell renal cell carcinoma",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "right nephrectomy",
          "year": 2023,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "disease progression with new pulmonary and bone metastases",
          "year": 2023,
          "month": 9
        },
        {
          "type": "other_progress_or_event",
          "value": "further progression on immunotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows enlarging pulmonary metastases (largest 4.2cm from 2.8cm), new liver metastases, progression in bone metastases with T8 pathological fracture",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Pembrolizumab/axitinib combination therapy discontinued due to disease progression and declining performance status",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3"
      },
      {
        "type": "current_symptom",
        "value": "Increasing breathlessness on minimal exertion"
      },
      {
        "type": "current_symptom",
        "value": "Significant thoracic back pain"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires wheelchair for anything more than very short distances"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight loss to 62kg from 78kg at diagnosis"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic renal cell carcinoma with rapid disease progression on first-line therapy. Significant clinical deterioration with poor performance status limiting further systemic treatment options"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on imaging with enlarging pulmonary metastases and new liver metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Systemic therapy paused due to poor performance status, commenced on palliative radiotherapy to T8 vertebra"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant functional decline requiring wheelchair use and deterioration to ECOG PS 3"
      },
      {
        "type": "planned_investigation",
        "value": "Spinal team assessment regarding vertebral stability"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in two weeks after completion of radiotherapy"
      }
    ]
  }
}