{
  "content": "Diagnosis:\tPapillary renal cell carcinoma type 2, right kidney upper pole, T2N1M0\n\nInitial surgery 15 March 2024 - right partial nephrectomy with regional lymphadenectomy. Histology confirmed 7.2cm type 2 papillary renal cell carcinoma with sarcomatoid features, positive lymph nodes (2/8), PBRM1 mutation and SETD2 loss detected on molecular analysis.\n\n[redacted name] is a 62-year-old gentleman who has been receiving adjuvant pembrolizumab following his surgery. He initially tolerated treatment well but has developed significant immune-related toxicity over the past 4 weeks. He presented to the acute oncology service with grade 3 colitis requiring admission for 5 days. This was managed with high-dose steroids and has now improved to grade 1, but he continues on a tapering dose of prednisolone.\n\nHe also reports ongoing fatigue (grade 2) and has developed a pruritic rash affecting his trunk and limbs (grade 2). His latest thyroid function tests show new subclinical hypothyroidism with TSH 8.2 and normal T4, likely immune-related. His renal function remains stable with creatinine 132 (baseline 128).\n\nOn examination today, his rash is improving but still visible on his chest and upper arms. His performance status is 1 due to fatigue. Blood pressure is 142/88 and other observations are stable.\n\nGiven the significant immune-related adverse events, particularly the grade 3 colitis, we have made the decision to permanently discontinue pembrolizumab. The patient understands and agrees with this plan. His most recent CT scan from 2 weeks ago shows no evidence of disease recurrence.\n\nThe plan is to continue the prednisolone taper as prescribed by the acute oncology team, with weekly blood tests to monitor inflammatory markers, renal function, and thyroid function. He will need endocrine review for management of the hypothyroidism. We will arrange repeat CT chest/abdomen/pelvis in 8 weeks, and see him back in clinic with these results.\n\nHe understands to contact the acute oncology team if he develops any new or worsening symptoms, particularly any diarrhea or abdominal pain.",
  "output": {
    "primary_cancer": {
      "site": "kidney, right upper pole",
      "year": 2024,
      "month": 3,
      "metastases": "positive regional lymph nodes (2/8)",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "7.2cm type 2 papillary renal cell carcinoma with sarcomatoid features",
      "biomarker_status": "PBRM1 mutation and SETD2 loss detected",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "right partial nephrectomy with regional lymphadenectomy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "commenced adjuvant pembrolizumab",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "permanent discontinuation of pembrolizumab due to grade 3 colitis",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT scan shows no evidence of disease recurrence",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "performance status 1 due to fatigue"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 fatigue"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 pruritic rash affecting trunk and limbs"
      },
      {
        "type": "investigation_finding",
        "value": "subclinical hypothyroidism with TSH 8.2 and normal T4"
      },
      {
        "type": "investigation_finding",
        "value": "stable renal function with creatinine 132 (baseline 128)"
      },
      {
        "type": "examination_finding",
        "value": "improving rash visible on chest and upper arms, blood pressure 142/88"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Post-nephrectomy papillary RCC on adjuvant pembrolizumab. Multiple immune-related adverse events including grade 3 colitis necessitating treatment discontinuation"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 colitis requiring admission, grade 2 rash, grade 2 fatigue, and subclinical hypothyroidism"
      },
      {
        "type": "update_to_treatment",
        "value": "Pembrolizumab permanently discontinued, continuing prednisolone taper"
      },
      {
        "type": "planned_investigation",
        "value": "Weekly blood tests for inflammatory markers, renal function, and thyroid function; CT chest/abdomen/pelvis in 8 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Endocrine review for hypothyroidism management, oncology review with CT results in 8 weeks"
      }
    ]
  }
}