{
  "content": "Diagnosis:\tClear cell renal cell carcinoma, right kidney\n\tpT3aN0M0 (AJCC 8th edition)\n\tPD-L1 CPS 80%\n\tNephrectomy March 2024\n\nI reviewed [redacted name] today following his right radical nephrectomy performed on 15/3/24. The histology has confirmed a 7.2cm clear cell renal cell carcinoma extending into but not beyond the perinephric fat. Surgical margins are clear and there is no lymphovascular invasion identified. His PD-L1 testing shows CPS of 80%. Given the T3a staging, we have discussed adjuvant immunotherapy with pembrolizumab.\n\nHe has recovered well from surgery with good wound healing and improving energy levels. His blood pressure remains stable at 138/82 and renal function shows expected post-operative changes with creatinine 132. Performance status is 1. He describes some ongoing pain around the surgical site but this is improving with regular paracetamol.\n\nWe have discussed the role of adjuvant immunotherapy in detail, including the potential benefits and side effects. He is keen to proceed. I have arranged baseline thyroid function, cortisol, and chest x-ray. We will commence pembrolizumab 400mg every 6 weeks for one year, starting in 2 weeks' time once his wound has fully healed. He will be reviewed in the immunotherapy clinic prior to each cycle.",
  "output": {
    "primary_cancer": {
      "site": "kidney, right",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "pT3aN0M0",
      "other_stage": "",
      "histopathology_status": "clear cell renal cell carcinoma, 7.2cm, extending into perinephric fat, clear margins, no lymphovascular invasion",
      "biomarker_status": "PD-L1 CPS 80%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right radical nephrectomy performed",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Histology confirms 7.2cm clear cell renal cell carcinoma, pT3aN0M0, PD-L1 CPS 80%",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "current_symptom",
        "value": "Some ongoing pain around surgical site, improving with regular paracetamol"
      },
      {
        "type": "investigation_finding",
        "value": "Blood pressure 138/82, creatinine 132"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed pT3a clear cell renal cell carcinoma post nephrectomy. Recovered well from surgery and planned for adjuvant immunotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence pembrolizumab 400mg every 6 weeks for one year"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged baseline thyroid function, cortisol, and chest x-ray"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in immunotherapy clinic prior to each cycle"
      }
    ]
  }
}