{
  "content": "Diagnosis:\tMetastatic clear cell renal cell carcinoma\n\nManagement:\t15 Jan 2024 Right radical nephrectomy\n\t\t12 Feb 2024 Commenced Cabozantinib\n\nHistology:\tGrade 3 clear cell renal cell carcinoma, pT3b with renal vein invasion, 2/8 hilar nodes positive. HIF-2α high expression.\n\nCurrent Situation:\tProgressive disease on first-line TKI\n\nI am writing following today's Renal MDT discussion regarding [redacted name], a 64-year-old gentleman with metastatic clear cell renal cell carcinoma who has unfortunately shown disease progression on first-line Cabozantinib. The case was presented with recent imaging showing new liver lesions and growth of existing pulmonary metastases.\n\nTo recap, [redacted name] underwent right radical nephrectomy in January 2024, which showed a grade 3 clear cell carcinoma with renal vein invasion and positive hilar nodes. He commenced Cabozantinib in February 2024 but developed significant palmar-plantar erythrodysesthesia requiring dose reduction to 40mg daily after 6 weeks. His most recent CT scan from 15 April 2024 shows multiple new liver metastases and growth of pulmonary metastases, with the largest lung lesion increasing from 2.8cm to 4.1cm. His performance status has deteriorated to ECOG 2 due to increasing fatigue and right upper quadrant pain.\n\nThe MDT reviewed his imaging in detail and noted clear radiological progression by RECIST criteria. Given his deteriorating performance status and the aggressive disease trajectory, the consensus recommendation is to switch to second-line immunotherapy with Nivolumab. The option of combination immunotherapy was discussed but felt to carry excessive risk given his current performance status.\n\nThe plan is therefore to discontinue Cabozantinib and commence Nivolumab 480mg every 4 weeks. He will require baseline thyroid function, cortisol, and chest x-ray prior to starting immunotherapy. We will arrange urgent CT reassessment after 3 cycles to evaluate response. I have also referred him to palliative care for support with symptom management, particularly his right upper quadrant pain.\n\nHe will be reviewed in clinic next week to initiate the new treatment plan. The clinical nurse specialist will provide immunotherapy education and emergency contact details.",
  "output": {
    "primary_cancer": {
      "site": "kidney, right",
      "year": 2024,
      "month": 1,
      "metastases": "multiple liver metastases, pulmonary metastases",
      "tnm_stage": "T3bN1M1",
      "histopathology_status": "Grade 3 clear cell renal cell carcinoma with renal vein invasion, 2/8 hilar nodes positive",
      "biomarker_status": "HIF-2α high expression",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right radical nephrectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced Cabozantinib",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cabozantinib dose reduced to 40mg daily due to palmar-plantar erythrodysesthesia",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows multiple new liver metastases and growth of pulmonary metastases, largest lung lesion increased from 2.8cm to 4.1cm",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 2 due to increasing fatigue and right upper quadrant pain"
      },
      {
        "type": "current_symptom",
        "value": "Right upper quadrant pain"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic clear cell renal cell carcinoma showing disease progression on first-line Cabozantinib with new liver metastases and growing lung metastases"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease with new liver metastases and growth of pulmonary metastases"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Significant palmar-plantar erythrodysesthesia requiring dose reduction"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to discontinue Cabozantinib and commence Nivolumab 480mg every 4 weeks"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Performance status deteriorated to ECOG 2 due to fatigue and pain"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline thyroid function, cortisol, and chest x-ray needed before immunotherapy; CT reassessment after 3 cycles"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic next week to initiate new treatment plan, referred to palliative care for symptom management"
      }
    ]
  }
}