{
  "content": "Diagnosis\n\t1. Right kidney chromophobe renal cell carcinoma, T3aN1M0\n\t\tDiagnosis date: March 2024\n\t\tTreatment aim: Curative\n\nSummary of completed treatment and relevant dates\n\tSurgery\n\t15 Mar 2024 Right radical nephrectomy and lymph node dissection\n\tComplications: Post-operative collection requiring ultrasound-guided drainage\n\n\tSystemic therapy\n\t10 Apr 2024 Commenced adjuvant pembrolizumab\n\tCurrent cycle: 3\n\nCurrent disease status\n\tNo evidence of disease on latest imaging\n\nCurrent issues\n\tGrade 3 immune-mediated hepatitis\n\nSummary of consultation\n\tThis 62-year-old gentleman was reviewed today in the oncology clinic. He has unfortunately developed significant immune-related hepatitis during cycle 3 of adjuvant pembrolizumab, with ALT rising to 428 and AST to 356. He reports increasing fatigue over the past week but no abdominal pain, jaundice, or other symptoms. He has maintained good oral intake and normal performance status.\n\nOn examination today, he is comfortable at rest with normal vital signs. His abdomen is soft and non-tender with well-healed surgical scars. There is no peripheral edema or clinical evidence of fluid overload.\n\nI have discussed the situation with our immunotherapy team. Given the grade 3 hepatitis, we will permanently discontinue pembrolizumab and commence oral prednisolone 60mg daily with appropriate PCP prophylaxis. He understands the management plan and symptoms that would require urgent review.\n\nFurther investigations\n\tLFTs to be repeated every 48 hours until improving\n\tHepatitis screen sent\n\nMedication prescribed\n\tPrednisolone 60mg daily\n\tCo-trimoxazole 960mg three times weekly\n\tLansoprazole 30mg daily\n\nFollow up\n\tUrgent review in immunotherapy toxicity clinic in 1 week\n\tNext routine oncology follow-up in 4 weeks with repeat CT\n\nRequired GP actions\n\tPlease monitor blood pressure and blood glucose while on high-dose steroids\n\tAlert us if LFTs worsen despite steroids",
  "output": {
    "primary_cancer": {
      "site": "kidney, right",
      "year": 2024,
      "month": 3,
      "metastases": "regional lymph node involvement",
      "tnm_stage": "T3aN1M0",
      "histopathology_status": "chromophobe renal cell carcinoma",
      "biomarker_status": "KIT negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right radical nephrectomy and lymph node dissection with post-operative collection requiring drainage",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced adjuvant pembrolizumab",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Permanently discontinuing pembrolizumab due to grade 3 immune-mediated hepatitis",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "ALT elevated to 428 and AST to 356"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue over past week"
      },
      {
        "type": "examination_finding",
        "value": "Comfortable at rest, normal vital signs, soft non-tender abdomen with well-healed surgical scars"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed right kidney cancer treated with nephrectomy. Now developing grade 3 immune-mediated hepatitis during adjuvant immunotherapy requiring treatment discontinuation"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 immune-mediated hepatitis with ALT 428 and AST 356"
      },
      {
        "type": "update_to_treatment",
        "value": "Permanently discontinuing pembrolizumab and starting prednisolone 60mg daily with PCP prophylaxis"
      },
      {
        "type": "planned_investigation",
        "value": "LFTs every 48 hours until improving, hepatitis screen, repeat CT in 4 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent review in immunotherapy toxicity clinic in 1 week, routine oncology follow-up in 4 weeks"
      }
    ]
  }
}