{
  "content": "Diagnosis:\tMetastatic clear cell renal cell carcinoma\n\nManagement:\tLeft radical nephrectomy March 2023\n\t\tPazopanib commenced May 2023, discontinued August 2023\n\t\tCabozantinib commenced September 2023\n\nHistology:\tClear cell renal cell carcinoma, WHO/ISUP grade 3, with sarcomatoid features\n\t\tpT4N1 with renal vein invasion\n\t\tVEGF expression high on immunohistochemistry\n\nCurrent Situation:\tProgressive disease on cabozantinib\n\nI saw [redacted name] today accompanied by his wife. Unfortunately, his most recent CT scan from last week shows disease progression with growth of both liver metastases and new pulmonary nodules. The largest liver lesion has increased from 3.2cm to 4.8cm, and there are three new pulmonary nodules measuring up to 8mm. His bone metastases in the thoracic spine remain stable following the palliative radiotherapy he received in October 2023.\n\nHe has been struggling with increasing fatigue and right upper quadrant discomfort. His appetite has significantly decreased over the past month, and he has lost 4kg in weight. His mobility has declined, and he now requires a walking frame for all movements. His performance status has deteriorated to ECOG 3.\n\nThe cabozantinib was initially well-tolerated, but he has developed grade 2 palmar-plantar syndrome and persistent diarrhea despite dose reduction to 40mg daily in November 2023. His blood pressure remains well-controlled on amlodipine.\n\nGiven the clear evidence of disease progression and declining performance status, we have had a detailed discussion about treatment options. We have agreed to discontinue cabozantinib and transition to best supportive care. I have made a referral to the palliative care team and arranged for urgent review next week. We will also arrange a hospice assessment given his rapid decline.\n\nI have prescribed additional analgesia and anti-emetics today. The district nurses will commence regular home visits for symptom monitoring. We will review him again in two weeks' time, or sooner if needed through our acute oncology service.",
  "output": {
    "primary_cancer": {
      "site": "kidney, left",
      "year": 2023,
      "month": 3,
      "metastases": "liver metastases, pulmonary nodules, thoracic spine metastases",
      "tnm_stage": "pT4N1M1",
      "histopathology_status": "Clear cell renal cell carcinoma, WHO/ISUP grade 3, with sarcomatoid features",
      "biomarker_status": "VEGF expression high",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Left radical nephrectomy",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started pazopanib",
          "year": 2023,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued pazopanib",
          "year": 2023,
          "month": 8
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started cabozantinib",
          "year": 2023,
          "month": 9
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Palliative radiotherapy to thoracic spine metastases",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cabozantinib dose reduced to 40mg daily due to toxicity",
          "year": 2023,
          "month": 11
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression with growth of liver metastases (largest 4.8cm from 3.2cm) and new pulmonary nodules up to 8mm",
          "year": 2024,
          "month": 1
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue"
      },
      {
        "type": "current_symptom",
        "value": "Right upper quadrant discomfort"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires walking frame for all movements"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic renal cell carcinoma with progressive disease on second-line therapy. Significant clinical deterioration with declining performance status requiring transition to palliative care."
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease with growing liver metastases and new pulmonary nodules"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 palmar-plantar syndrome and persistent diarrhea on cabozantinib"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing cabozantinib and transitioning to best supportive care"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in mobility and performance status, now ECOG 3"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care review next week and hospice assessment"
      }
    ]
  }
}