{
  "content": "Diagnosis:\tMetastatic clear cell renal cell carcinoma with brain and lung metastases\n\nManagement:\t2023 Right radical nephrectomy\n\t\tJan 2024 Stereotactic radiosurgery to right parietal metastasis\n\t\tFeb 2024 Started Pembrolizumab/Axitinib combination\n\nCurrent Situation:\tProgressive disease with new brain metastases\n\nI reviewed [redacted name] today who attended with his wife following urgent MRI brain performed last week due to new onset headaches and mild left-sided weakness. Unfortunately, the scan has revealed three new brain metastases - the largest measuring 2.8cm in the left frontal lobe with associated vasogenic oedema, and two smaller lesions in the right cerebellum (12mm and 8mm). This is particularly disappointing given his initial good response to stereotactic radiosurgery for the solitary right parietal metastasis in January.\n\nHe has also noticed increasing breathlessness over the past three weeks, and repeat CT chest shows progression of pulmonary metastases with the largest lesion now measuring 4.2cm (previously 2.8cm) with several new sub-centimeter nodules. His performance status has declined from 1 to 2-3, spending more time resting during the day. He describes persistent headaches despite dexamethasone 4mg twice daily started by the acute oncology team last week.\n\nHis pembrolizumab/axitinib combination therapy had initially been well-tolerated with good partial response in both lung metastases and the treated brain lesion on imaging in March 2024. However, given this clear evidence of disease progression after 4 cycles, we will need to discontinue this regimen.\n\nI have discussed the situation in detail with [redacted name] and his wife. We have increased his dexamethasone to 8mg twice daily and added lansoprazole for gastric protection. I have referred him urgently to our neuro-oncology MDT for consideration of whole brain radiotherapy. We will also arrange urgent CT abdomen/pelvis to fully assess disease status.\n\nGiven his declining performance status and the rapid progression, I have had a careful conversation about prognosis. We have agreed to focus on symptom control while awaiting the MDT outcome, with early involvement of palliative care. I have made a referral to the hospital palliative care team and will liaise with his local hospice.\n\nWe will review him next week with the MDT outcome and CT results to discuss further management options, including the possibility of second-line cabozantinib if his performance status improves with better symptom control.",
  "output": {
    "primary_cancer": {
      "site": "kidney, right",
      "year": 2023,
      "metastases": "brain metastases (left frontal, right cerebellar), lung metastases",
      "other_stage": "Stage IV",
      "histopathology_status": "clear cell renal cell carcinoma",
      "biomarker_status": "PD-L1 CPS 60",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right radical nephrectomy",
          "year": 2023
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Stereotactic radiosurgery to right parietal brain metastasis",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Pembrolizumab/Axitinib combination therapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_response",
          "value": "Partial response in lung metastases and treated brain lesion",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Three new brain metastases - 2.8cm left frontal and two right cerebellar lesions",
          "year": 2024
        },
        {
          "type": "anatomical_finding",
          "value": "Progressive lung metastases, largest increased from 2.8cm to 4.2cm with new nodules",
          "year": 2024
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing pembrolizumab/axitinib due to disease progression after 4 cycles",
          "year": 2024
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Declined from PS 1 to PS 2-3, spending more time resting"
      },
      {
        "type": "current_symptom",
        "value": "Persistent headaches despite dexamethasone 4mg twice daily"
      },
      {
        "type": "current_symptom",
        "value": "Increasing breathlessness"
      },
      {
        "type": "current_symptom",
        "value": "Mild left-sided weakness"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic renal cell carcinoma with progressive brain and lung metastases following initial response to immunotherapy/TKI combination. Declining performance status with new neurological symptoms."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with new brain metastases and growing lung metastases after 4 cycles of pembrolizumab/axitinib"
      },
      {
        "type": "update_to_treatment",
        "value": "Increased dexamethasone to 8mg twice daily, added lansoprazole, stopping pembrolizumab/axitinib"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status from 1 to 2-3 with increasing symptoms"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent CT abdomen/pelvis to assess disease status"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to neuro-oncology MDT, palliative care team referral, review next week with results"
      }
    ]
  }
}