{
  "content": "Diagnosis:\tMetastatic papillary renal cell carcinoma type 2\n\nManagement:\t2023 Right partial nephrectomy\n\t\tJan 2024 Started Cabozantinib\n\t\tMarch 2024 Palliative radiotherapy to T8 vertebra\n\nHistology:\tPapillary renal cell carcinoma type 2, mTOR mutation positive\n\nCurrent Situation:\tDisease progression on Cabozantinib\n\nI reviewed [redacted name] today who attended with his wife. Unfortunately, his most recent CT scan from last week shows clear evidence of disease progression with growth of the pulmonary metastases and new bone metastases in the left femur. His main symptoms have also deteriorated significantly over the past three weeks. He describes worsening breathlessness on minimal exertion, requiring oxygen 2L/min at rest, and increasing bone pain despite recent radiotherapy to T8. His mobility has declined considerably, and he now requires a wheelchair for anything more than very short distances.\n\nHis performance status has dropped to ECOG 3. On examination today, there are reduced breath sounds at both bases with dullness to percussion. His oxygen saturation was 92% on 2L/min oxygen. He appears cachectic with evident muscle wasting, and his weight has dropped by 4kg since last month despite nutritional supplements.\n\nThe current dose of Cabozantinib (40mg daily, reduced from 60mg due to previous grade 3 diarrhea) is clearly no longer controlling his disease. Given his declining performance status and rapid progression, I have had a detailed discussion with [redacted name] and his wife about changing our approach to focus more on symptom control and quality of life. They understand that further systemic therapy options are limited and may cause more harm than benefit at this stage.\n\nI have referred [redacted name] to our palliative care team for urgent review and have increased his analgesia today, adding sustained-release morphine 20mg twice daily to his current painkillers. I have also arranged for urgent assessment by our respiratory team regarding his increasing oxygen requirements.\n\nWe will see him again next week to review his symptoms and discuss further management options once he has been assessed by palliative care. I have given them direct contact details for our specialist nursing team and have emphasized that they should not hesitate to contact us if they have any concerns before then.",
  "output": {
    "primary_cancer": {
      "site": "kidney, mid pole",
      "year": 2023,
      "metastases": "pulmonary metastases, bone metastases in T8 vertebra and left femur",
      "other_stage": "Stage IV",
      "histopathology_status": "papillary renal cell carcinoma type 2",
      "biomarker_status": "mTOR mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Right partial nephrectomy",
          "year": 2023
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Cabozantinib 60mg daily",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cabozantinib dose reduced to 40mg daily due to grade 3 diarrhea",
          "year": 2024
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Palliative radiotherapy to T8 vertebra",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows growth of pulmonary metastases and new bone metastases in left femur",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3"
      },
      {
        "type": "current_symptom",
        "value": "Breathlessness on minimal exertion requiring oxygen 2L/min at rest"
      },
      {
        "type": "current_symptom",
        "value": "Increasing bone pain despite recent radiotherapy to T8"
      },
      {
        "type": "examination_finding",
        "value": "Reduced breath sounds at both bases with dullness to percussion"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturation 92% on 2L/min oxygen"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with evident muscle wasting"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires wheelchair for anything more than very short distances"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic papillary renal cell carcinoma with progressive disease in lungs and bones. Significant clinical deterioration with worsening symptoms and declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on Cabozantinib with growing pulmonary metastases and new bone metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing Cabozantinib due to disease progression, transitioning to symptom-focused care"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in mobility and performance status, new oxygen requirement"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care team referral and respiratory team assessment"
      }
    ]
  }
}