{
  "content": "Diagnosis:\tT4aN2cM1 p16 negative squamous cell carcinoma of larynx with pulmonary metastases\n\nManagement:\t15 Jan 2024 Total laryngectomy and bilateral neck dissection\n\t\t1 Feb - 15 Mar 2024 Post-operative chemoradiotherapy with weekly cisplatin\n\t\t20 Apr 2024 Started pembrolizumab monotherapy\n\nHistology:\tModerately differentiated squamous cell carcinoma, extensive extranodal extension, margins clear\n\nCurrent Situation:\tSeen following cycle 3 pembrolizumab\n\n[redacted name] attended clinic today for review. Recent CT chest shows stable pulmonary metastases with no new sites of disease. However, he has developed grade 3 pneumonitis requiring admission last week and treatment with high-dose steroids. His breathlessness has improved with prednisolone 60mg daily but he remains PS 2. After discussion with the patient and review of the CT findings, we have decided to permanently discontinue pembrolizumab. Once the pneumonitis has fully resolved, we will commence second-line chemotherapy with carboplatin and paclitaxel. I have arranged review in 2 weeks with repeat chest x-ray to confirm resolution of the pneumonitis before starting chemotherapy.",
  "output": {
    "primary_cancer": {
      "site": "larynx",
      "year": 2024,
      "month": 1,
      "metastases": "pulmonary metastases",
      "tnm_stage": "T4aN2cM1",
      "other_stage": "Stage IVA",
      "histopathology_status": "moderately differentiated squamous cell carcinoma, extensive extranodal extension, margins clear",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Total laryngectomy and bilateral neck dissection",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Post-operative chemoradiotherapy with weekly cisplatin",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started pembrolizumab monotherapy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Permanently discontinuing pembrolizumab due to grade 3 pneumonitis",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest shows stable pulmonary metastases with no new sites of disease",
          "year": 2024,
          "month": null
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2"
      },
      {
        "type": "current_symptom",
        "value": "breathlessness improving with prednisolone 60mg daily"
      },
      {
        "type": "investigation_finding",
        "value": "CT shows stable pulmonary metastases"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IVA laryngeal cancer with lung metastases. Developed severe pneumonitis on pembrolizumab requiring treatment discontinuation"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 pneumonitis requiring hospital admission and high-dose steroids"
      },
      {
        "type": "update_to_treatment",
        "value": "Permanently discontinuing pembrolizumab, plan to switch to carboplatin and paclitaxel once pneumonitis resolved"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat chest x-ray in 2 weeks to confirm resolution of pneumonitis"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks before starting chemotherapy"
      }
    ]
  }
}