{
  "content": "Diagnosis:\tSquamous cell carcinoma of larynx, p16 negative\n\nI reviewed [redacted name] today following completion of radical chemoradiotherapy in March 2024. He has made an excellent recovery from treatment with gradual improvement in swallowing function and voice quality. His weight has stabilized at 78kg, having regained 2kg since completing treatment. He continues to manage a soft diet with occasional use of thickened fluids.\n\nHe reports mild ongoing dry mouth but this is improving with regular sips of water. His voice quality continues to improve with support from the speech and language therapy team. He denies any new concerning symptoms.\n\nOn examination today, indirect laryngoscopy shows expected post-treatment changes with no evidence of residual or recurrent disease. His neck is soft with no concerning lymphadenopathy.\n\nThe plan is to continue regular follow-up. I have arranged a surveillance CT neck and chest for 3 months' time, and we will see him back in clinic with these results. He understands to contact us sooner if any new concerns develop.",
  "output": {
    "primary_cancer": {
      "site": "larynx",
      "year": 2024,
      "month": 3,
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Completed radical chemoradiotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Weight stabilized at 78kg with 2kg regained post-treatment",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Mild ongoing dry mouth, improving with regular sips of water"
      },
      {
        "type": "current_symptom",
        "value": "Improving voice quality with speech therapy support"
      },
      {
        "type": "examination_finding",
        "value": "Indirect laryngoscopy shows expected post-treatment changes with no evidence of residual or recurrent disease"
      },
      {
        "type": "examination_finding",
        "value": "Soft neck with no concerning lymphadenopathy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Laryngeal squamous cell carcinoma post chemoradiotherapy. Excellent recovery with improving symptoms and no evidence of disease on examination"
      },
      {
        "type": "latest_treatment_response",
        "value": "Good clinical response with improvement in swallowing function and voice quality"
      },
      {
        "type": "planned_investigation",
        "value": "Surveillance CT neck and chest in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic with CT results"
      }
    ]
  }
}