{
  "content": "Diagnosis:\tSquamous cell carcinoma of larynx, T3N0M0\n\nManagement:\t15 Jan 2024 - Commenced definitive chemoradiotherapy\n\t\t70Gy in 35 fractions with concurrent weekly cisplatin\n\nHistology:\tModerately differentiated squamous cell carcinoma, p16 negative\n\nCurrent Situation:\tWeek 5 of treatment, requiring admission for toxicity\n\nI reviewed [redacted name] today following recent admission for grade 3 mucositis and grade 2 acute kidney injury. His creatinine clearance has dropped to 45ml/min from a baseline of 85ml/min. He has completed 5 cycles of weekly cisplatin but given the significant toxicity, we will omit the final cycle. His radiotherapy has continued uninterrupted and he has completed 25 of 35 fractions.\n\nHe is managing to maintain oral intake with liquid nutrition supplements, though requires regular breakthrough morphine for pain. His weight has dropped by 4kg since starting treatment. We have arranged intensive supportive care with twice-weekly reviews in the combined radiotherapy clinic. I have prescribed additional anti-emetics and arranged urgent dietitian review.\n\nThe plan is to complete the remaining radiotherapy fractions with enhanced supportive care but without further cisplatin. We will see him again next week. I have informed the acute oncology team about his situation should he require weekend review.",
  "output": {
    "primary_cancer": {
      "site": "larynx",
      "year": 2024,
      "tnm_stage": "T3N0M0",
      "histopathology_status": "moderately differentiated squamous cell carcinoma",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent chemoradiotherapy with weekly cisplatin and radiotherapy 70Gy in 35 fractions",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cisplatin discontinued after 5 cycles due to grade 3 mucositis and acute kidney injury",
          "year": 2024,
          "month": 2
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 3 mucositis requiring regular breakthrough morphine"
      },
      {
        "type": "investigation_finding",
        "value": "Creatinine clearance dropped to 45ml/min from baseline 85ml/min"
      },
      {
        "type": "current_symptom",
        "value": "4kg weight loss since starting treatment"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "T3N0M0 laryngeal cancer on concurrent chemoradiotherapy. Treatment complicated by severe mucositis and renal impairment requiring cisplatin discontinuation"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 mucositis and grade 2 acute kidney injury requiring hospital admission"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing cisplatin after 5 cycles, continuing radiotherapy with enhanced supportive care"
      },
      {
        "type": "follow_up_referral",
        "value": "Twice-weekly reviews in combined radiotherapy clinic with urgent dietitian review"
      }
    ]
  }
}