{
  "content": "Diagnosis:\tMalignant pleural mesothelioma left lung, T3N2M0, BAP1 negative\n\nManagement:\t12 Mar 2024 Video-assisted thoracoscopic surgery (VATS) pleural biopsy\n\t\t20 Mar 2024 Indwelling pleural catheter insertion\n\nHistology:\tEpitheloid mesothelioma, BAP1 negative on immunohistochemistry\n\nCurrent situation:\tPre-cycle 1 Carboplatin/Pemetrexed\n\n[redacted name] is a 72-year-old retired plumber with significant asbestos exposure history who has unfortunately been diagnosed with malignant pleural mesothelioma. His main symptoms are progressive breathlessness and left-sided chest pain requiring regular opioid analgesia. His performance status has deteriorated from 1 to 2 over the past month. He has required three pleural aspirations prior to the indwelling catheter insertion, with good symptomatic benefit.\n\nHe has significant cardiac history with previous NSTEMI in 2020 and ongoing angina. Recent echocardiogram shows preserved ejection fraction. His renal function is adequate for platinum chemotherapy with eGFR 65.\n\nFollowing MDT discussion, we have agreed to proceed with first-line carboplatin AUC5 and pemetrexed. I have discussed the aims of treatment, potential side effects, and likely prognosis. He understands this is non-curative treatment. He will require vitamin B12 injection and folic acid supplementation prior to chemotherapy.\n\nThe plan is to commence treatment next week. We have arranged CT assessment after 3 cycles. He has been referred to our mesothelioma specialist nurse and palliative care team for ongoing support. We will review him weekly during the first cycle.",
  "output": {
    "primary_cancer": {
      "site": "left lung, pleural",
      "year": 2024,
      "month": 3,
      "tnm_stage": "T3N2M0",
      "histopathology_status": "Epitheloid mesothelioma",
      "biomarker_status": "BAP1 negative on immunohistochemistry",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Video-assisted thoracoscopic surgery (VATS) pleural biopsy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Indwelling pleural catheter insertion",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Epitheloid mesothelioma confirmed on biopsy, BAP1 negative",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2, deteriorated from PS 1 over past month"
      },
      {
        "type": "current_symptom",
        "value": "Progressive breathlessness requiring repeated pleural drainage"
      },
      {
        "type": "current_symptom",
        "value": "Left-sided chest pain requiring regular opioid analgesia"
      },
      {
        "type": "comorbidity",
        "value": "Previous NSTEMI 2020 with ongoing angina"
      },
      {
        "type": "investigation_finding",
        "value": "Recent echocardiogram shows preserved ejection fraction"
      },
      {
        "type": "investigation_finding",
        "value": "eGFR 65"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed pleural mesothelioma with deteriorating symptoms requiring pleural catheter. Planning to commence first-line chemotherapy."
      },
      {
        "type": "update_to_treatment",
        "value": "To commence carboplatin AUC5 and pemetrexed"
      },
      {
        "type": "planned_investigation",
        "value": "CT assessment after 3 cycles of chemotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during first cycle of chemotherapy"
      }
    ]
  }
}