{
  "content": "Diagnosis:\tLocally advanced squamous cell carcinoma of left lung\n\tT4N2M0 (Stage IIIB)\n\tPD-L1 75%, FGFR3 fusion positive\n\tDiagnosed March 2024\n?\n[redacted name] is a 62-year-old gentleman with recently diagnosed locally advanced squamous cell carcinoma of the left lung. Initial CT chest on 15/3/24 showed a 7.2cm left hilar mass with invasion of the pulmonary artery and extensive mediastinal lymphadenopathy. PET-CT on 20/3/24 confirmed high FDG uptake in the primary lesion and mediastinal nodes, with no distant metastases. Endobronchial ultrasound-guided biopsy on 25/3/24 confirmed squamous cell carcinoma with subsequent molecular testing showing FGFR3 fusion and PD-L1 75%.\n?\nHe presents with progressive dyspnoea, now MRCS grade 3, with associated chest pain and weight loss of 6kg over 2 months. His performance status has declined from 1 to 2 over the past month. He has developed a persistent cough productive of blood-streaked sputum.\n?\nIn his background, he has COPD with FEV1 1.2L (45% predicted), hypertension, and type 2 diabetes. He stopped smoking 2 months ago with a 40 pack-year history. He lives alone but has good support from his daughter who attended today.\n?\nOn examination, there is marked reduction in air entry throughout the left lung field with associated dullness to percussion. Oxygen saturations are 92% on room air. There is no clubbing or lymphadenopathy.\n?\nI have discussed his case with the thoracic surgeons who feel his disease is technically inoperable due to pulmonary artery involvement. Given his PD-L1 status, I recommend combination chemo-immunotherapy with cisplatin/gemcitabine plus pembrolizumab. We will need careful monitoring given his compromised lung function. I have also requested urgent radiotherapy assessment for possible concurrent chemoradiation.\n?\nThe plan is to proceed with baseline cardiac echo, full pulmonary function tests, and CT brain next week. We will review him with all results in the combined lung clinic in 10 days to finalise treatment approach. I have referred him to our lung cancer nurse specialist for additional support.",
  "output": {
    "primary_cancer": {
      "site": "left lung",
      "year": 2024,
      "month": 3,
      "metastases": "extensive mediastinal lymphadenopathy",
      "tnm_stage": "T4N2M0",
      "other_stage": "Stage IIIB",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "PD-L1 75%, FGFR3 fusion positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT chest shows 7.2cm left hilar mass with invasion of pulmonary artery and extensive mediastinal lymphadenopathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT confirmed high FDG uptake in primary lesion and mediastinal nodes, no distant metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Endobronchial ultrasound-guided biopsy confirmed squamous cell carcinoma",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular testing showing FGFR3 fusion and PD-L1 75%",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 2, declined from PS 1 over past month"
      },
      {
        "type": "current_symptom",
        "value": "Progressive dyspnoea MRCS grade 3"
      },
      {
        "type": "current_symptom",
        "value": "Chest pain"
      },
      {
        "type": "current_symptom",
        "value": "Weight loss of 6kg over 2 months"
      },
      {
        "type": "current_symptom",
        "value": "Persistent cough with blood-streaked sputum"
      },
      {
        "type": "comorbidity",
        "value": "COPD with FEV1 1.2L (45% predicted)"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "examination_finding",
        "value": "Marked reduction in air entry throughout left lung field with dullness to percussion"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturations 92% on room air"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed locally advanced squamous cell lung cancer with pulmonary artery invasion. Deteriorating symptoms with increasing breathlessness and compromised lung function."
      },
      {
        "type": "update_to_treatment",
        "value": "Recommended for combination chemo-immunotherapy with cisplatin/gemcitabine plus pembrolizumab"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline cardiac echo, full pulmonary function tests, and CT brain next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in combined lung clinic in 10 days to finalise treatment approach"
      }
    ]
  }
}