{
  "content": "Diagnosis:\t\tExtensive stage small cell lung cancer, left hilar primary with liver and brain metastases\n\nManagement:\t\tCycle 4 AMG 757 (DLL3-targeted BiTE) on SCLC-BITE-101 trial\n\nCurrent Situation:\tTrial assessment visit pre-cycle 5\n\nI reviewed [redacted name] today in the Phase I trial clinic. The patient has completed 4 cycles of AMG 757 on the SCLC-BITE-101 trial with encouraging disease stability. Recent restaging investigations from 15 April 2024 demonstrate stable appearances of the left hilar mass (4.2cm vs 4.3cm), stable liver metastases with no new lesions, and stable intracranial disease on MRI with continued resolution of perilesional edema following completion of whole brain radiotherapy in January 2024.\n\nThe treatment has been generally well-tolerated with manageable cytokine release syndrome after cycles 1-2 requiring only supportive care. Grade 2 fatigue persists but has not worsened. Liver function remains stable with only Grade 1 transaminitis. The protocol-mandated cardiac monitoring shows no concerns with stable troponin levels and normal ECGs.\n\nBloods today show stable parameters with adequate marrow function for cycle 5. The trial-specific biomarker sampling has been completed as per protocol. Given the continued clinical benefit and acceptable toxicity profile, we will proceed with cycle 5 today as per protocol. Next trial assessment visit is scheduled in 3 weeks with repeat CT chest/abdomen/pelvis and brain MRI due before cycle 6.\n\nI have discussed the results with [redacted name] who understands the current situation and wishes to continue on trial. The trial coordinator has arranged the next visit and provided updated emergency contact information.",
  "output": {
    "primary_cancer": {
      "site": "lung, left hilar",
      "metastases": "liver and brain metastases",
      "histopathology_status": "small cell carcinoma",
      "other_stage": "extensive stage",
      "biomarker_status": "DLL3 positive",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Completed whole brain radiotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "clinical_trial_update",
          "value": "Completed 4 cycles of AMG 757 on SCLC-BITE-101 trial with manageable cytokine release syndrome after cycles 1-2",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable left hilar mass (4.2cm vs 4.3cm), stable liver metastases, and stable intracranial disease on MRI",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 2 fatigue persists"
      },
      {
        "type": "investigation_finding",
        "value": "Grade 1 transaminitis"
      },
      {
        "type": "investigation_finding",
        "value": "Stable troponin levels and normal ECGs"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Extensive stage SCLC showing disease stability on clinical trial of AMG 757 with manageable toxicities"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on imaging with resolution of brain metastases perilesional edema"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 fatigue and Grade 1 transaminitis"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 5 AMG 757 on clinical trial"
      },
      {
        "type": "planned_investigation",
        "value": "CT chest/abdomen/pelvis and brain MRI due before cycle 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Next trial assessment visit in 3 weeks"
      }
    ]
  }
}