{
  "content": "Diagnosis:\tMetastatic adenocarcinoma of left upper lobe lung\n\nManagement:\t2023 Dec - Osimertinib 80mg daily\n\t\t2024 Jan - Whole brain radiotherapy 20Gy in 5#\n\t\t2024 Feb - Zoledronic acid commenced\n\nHistology:\tAdenocarcinoma, EGFR G719X mutation positive, ROS1 negative\n\nCurrent Situation:\tMDT review of response assessment\n\nDiscussed at Lung Cancer MDT today. CT chest/abdomen/pelvis from 15/3/24 shows stable disease in primary left upper lobe mass (4.2cm vs 4.3cm) and stable bone metastases. MRI brain 12/3/24 demonstrates good partial response to WBRT with reduction in size of all intracranial metastases and no new lesions. Performance status remains 1. Currently managing well on Osimertinib with only grade 1 rash and mild diarrhea well controlled with loperamide prn.\n\nMDT recommendations are to continue current Osimertinib given disease stability and acceptable toxicity profile. Next imaging in 3 months with CT CAP and MRI brain. To continue on current dose of Osimertinib 80mg daily. Will review in clinic in 4 weeks with blood tests including LFTs. To continue monthly zoledronic acid.\n\nPatient has been informed of MDT outcome and agrees with ongoing plan. Understanding demonstrated of need to report any new neurological symptoms promptly.",
  "output": {
    "primary_cancer": {
      "site": "lung, left upper lobe",
      "year": 2023,
      "metastases": "brain and bone metastases",
      "other_stage": "Stage IV",
      "histopathology_status": "adenocarcinoma",
      "biomarker_status": "EGFR G719X mutation positive, ROS1 negative",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Osimertinib 80mg daily",
          "year": 2023,
          "month": 12
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Whole brain radiotherapy 20Gy in 5 fractions",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced on zoledronic acid",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable disease in primary left upper lobe mass (4.2cm vs 4.3cm) and stable bone metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain demonstrates good partial response with reduction in size of all intracranial metastases and no new lesions",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 rash and mild diarrhea well controlled with loperamide prn"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IV lung adenocarcinoma with brain and bone metastases, showing stable disease on Osimertinib with good intracranial response to WBRT"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease in primary tumor and bone metastases, partial response in brain metastases"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 rash and mild diarrhea on Osimertinib"
      },
      {
        "type": "update_to_treatment",
        "value": "Continue Osimertinib 80mg daily and monthly zoledronic acid"
      },
      {
        "type": "planned_investigation",
        "value": "CT CAP and MRI brain in 3 months, blood tests including LFTs in 4 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in 4 weeks"
      }
    ]
  }
}