{
  "content": "Diagnosis\n\t1. Lingular adenocarcinoma of lung with liver metastases\n\tDate of diagnosis\n\tJanuary 2024\n\n\tTreatment aim\n\tPalliative\n\n\tSummary of completed treatment and relevant dates\n\n\tSurgery\n\tNone indicated\n\n\tRadiotherapy\n\tNone\n\n\tChemotherapy\n\tCarboplatin/Pemetrexed/Pembrolizumab - 3 cycles completed\n\n\tClinical studies\n\tNone\n\n\tCurrent disease status\n\tProgressive disease in liver\n\n\tCurrent issues\n\tFatigue, right upper quadrant pain, reduced appetite\n\n\tSummary of consultation\n\tThis 56-year-old lady attended clinic today accompanied by her husband to discuss disease progression. Unfortunately, her most recent CT scan shows significant progression of liver metastases with the largest lesion increasing from 3.2cm to 5.1cm, and development of three new lesions. The primary lung lesion remains stable at 2.8cm.\n\nShe has experienced increasing right upper quadrant discomfort requiring escalation of analgesia, and her performance status has declined from ECOG 1 to ECOG 2 due to fatigue and liver pain. Her appetite has reduced significantly over the past three weeks.\n\nMolecular results from her initial biopsy have now returned showing ROS1 fusion positive status (previously pending) and PD-L1 expression of 80%. Given this new information and evidence of disease progression, we have discussed transitioning to entrectinib therapy.\n\nOn examination today, there is tender hepatomegaly extending 4cm below the costal margin. Chest examination reveals reduced air entry at the left base but no added sounds.\n\n\tFurther investigations\n\tLiver function tests, clotting screen, and ECG to be checked prior to entrectinib\n\n\tMedication prescribed\n\tEntrectinib 600mg once daily to start once baseline investigations complete\n\n\tFollow up\n\tUrgent review in 2 weeks to assess tolerability of new treatment\nTelephone assessment by specialist nurse in 1 week\n\n\tRequired GP actions\n\tPlease monitor liver function tests weekly for first month of entrectinib\nPlease refer to district nurses for support with medication compliance",
  "output": {
    "primary_cancer": {
      "site": "lung, lingula",
      "year": 2024,
      "month": 1,
      "metastases": "liver metastases",
      "tnm_stage": "T2aN1M1b",
      "histopathology_status": "adenocarcinoma",
      "biomarker_status": "ROS1 fusion positive, PD-L1 80%",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Carboplatin/Pemetrexed/Pembrolizumab combination therapy",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression of liver metastases, largest lesion increased from 3.2cm to 5.1cm with three new lesions. Primary lung lesion stable at 2.8cm",
          "year": 2024,
          "month": null
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular testing confirms ROS1 fusion positive status and PD-L1 expression 80%",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing Carboplatin/Pemetrexed/Pembrolizumab due to disease progression",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS deteriorated from 1 to 2 due to fatigue and liver pain"
      },
      {
        "type": "current_symptom",
        "value": "Increasing right upper quadrant discomfort requiring escalation of analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Reduced appetite over past three weeks"
      },
      {
        "type": "examination_finding",
        "value": "Tender hepatomegaly extending 4cm below costal margin"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry at left base without added sounds"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic lung adenocarcinoma showing progression on first-line therapy. New molecular results enable switch to targeted therapy with entrectinib"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease with significant growth of liver metastases and new lesions"
      },
      {
        "type": "update_to_treatment",
        "value": "Changing to entrectinib 600mg daily based on ROS1 positive status"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in performance status from ECOG 1 to 2 due to fatigue and liver pain"
      },
      {
        "type": "planned_investigation",
        "value": "Liver function tests, clotting screen, and ECG prior to starting entrectinib"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent review in 2 weeks with telephone assessment by specialist nurse in 1 week"
      }
    ]
  }
}