{
  "content": "I was very pleased to review [redacted name] today in the Phase II HEMLIVER trial clinic. She has been participating in the trial for the past 6 months, receiving sirolimus for her multifocal hepatic epithelioid hemangioendothelioma. The disease was initially diagnosed in January 2023 following investigation of mildly deranged liver function tests, with core biopsy confirming CD31 and CD34 positive epithelioid hemangioendothelioma. Given the multifocal nature of the disease within the liver but absence of extrahepatic involvement, she was enrolled in the HEMLIVER trial in October 2023.\n\nI am delighted to report that she has shown an excellent response to trial treatment. The most recent protocol-mandated MRI liver performed on 15 March 2024 shows stable disease by RECIST 1.1 criteria compared to baseline, with some lesions showing decreased enhancement suggesting treatment effect. Her liver function tests have normalized, and she continues to feel very well with stable weight and excellent appetite. Her quality of life has significantly improved since starting treatment, and she has been able to return to work full-time as a primary school teacher.\n\nShe has experienced minimal side effects from the sirolimus, with only grade 1 mucositis that is well managed with regular mouth care. Her most recent sirolimus trough level was within the target range at 6.8 ng/mL. All trial-mandated blood tests, including full blood count, renal and liver function tests, are satisfactory. Her performance status remains ECOG 0.\n\nOn examination today, her abdomen is soft and non-tender with no hepatomegaly or other concerning features. She has maintained her weight at 64kg. Her blood pressure is stable at 126/78 mmHg.\n\nGiven her excellent tolerance and disease stability, we will continue with the current dose of sirolimus as per trial protocol. She understands to contact us immediately if she develops any new symptoms or concerns. Her next trial visit is scheduled in 6 weeks, with repeat MRI liver and trial-mandated blood tests to be performed the week before. The trial coordinator will arrange these appointments.\n",
  "output": {
    "primary_cancer": {
      "site": "liver, multifocal",
      "year": 2023,
      "month": 1,
      "metastases": "confined to liver, multifocal disease",
      "histopathology_status": "epithelioid hemangioendothelioma",
      "biomarker_status": "CD31 positive, CD34 positive",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Initial presentation with deranged liver function tests",
          "year": 2023,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "Core biopsy confirms CD31 and CD34 positive epithelioid hemangioendothelioma",
          "year": 2023,
          "month": 1
        },
        {
          "type": "clinical_trial_update",
          "value": "Enrolled in HEMLIVER trial",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started sirolimus as per trial protocol",
          "year": 2023,
          "month": 10
        },
        {
          "type": "anatomical_finding",
          "value": "MRI liver shows stable disease by RECIST 1.1 with decreased enhancement in some lesions",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 0"
      },
      {
        "type": "examination_finding",
        "value": "Abdomen soft and non-tender with no hepatomegaly"
      },
      {
        "type": "examination_finding",
        "value": "Weight stable at 64kg"
      },
      {
        "type": "examination_finding",
        "value": "Blood pressure 126/78 mmHg"
      },
      {
        "type": "investigation_finding",
        "value": "Sirolimus trough level 6.8 ng/mL within target range"
      },
      {
        "type": "investigation_finding",
        "value": "Normal liver function tests"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Multifocal hepatic epithelioid hemangioendothelioma showing stable disease on HEMLIVER trial sirolimus therapy with excellent tolerability"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease by RECIST 1.1 with some lesions showing decreased enhancement"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 mucositis managed with regular mouth care"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing current dose of sirolimus as per trial protocol"
      },
      {
        "type": "planned_investigation",
        "value": "MRI liver and trial-mandated blood tests in 5 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Trial clinic review in 6 weeks"
      }
    ]
  }
}