{
  "content": "Diagnosis:\tCombined hepatocellular-cholangiocarcinoma, T3N1M0\n\nManagement:\t15 Apr 2024 Right hepatectomy\n\nHistology:\tCombined hepatocellular-cholangiocarcinoma, 8.5cm tumor with vascular invasion and single positive hilar node\n\nCurrent Situation:\tPost-operative assessment for adjuvant therapy\n\n[redacted name] attended clinic today following recent right hepatectomy. His post-operative recovery has been uncomplicated and he is now back to his baseline functional status. His initial AFP was markedly elevated at 5000 but has now normalized post-operatively. Pathology confirms a combined hepatocellular-cholangiocarcinoma with a single positive hilar node, and PDL1 TPS of 70%. CT chest/abdomen/pelvis on 10/5/24 shows post-operative changes only with no evidence of residual or metastatic disease.\n\nGiven the high-risk features including nodal involvement and vascular invasion, I have recommended adjuvant immunotherapy with pembrolizumab. We discussed the rationale, schedule, and potential side effects in detail. He will require baseline thyroid function, cortisol, and hepatic monitoring before starting treatment. I have arranged these tests and will see him again in 2 weeks to initiate therapy assuming blood work is satisfactory.",
  "output": {
    "primary_cancer": {
      "site": "liver",
      "year": 2024,
      "month": 4,
      "metastases": "single positive hilar node",
      "tnm_stage": "T3N1M0",
      "histopathology_status": "Combined hepatocellular-cholangiocarcinoma, 8.5cm tumor with vascular invasion",
      "biomarker_status": "AFP initially 5000 (now normalized), PDL1 TPS 70%",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Initial AFP markedly elevated at 5000",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_surgery",
          "value": "Right hepatectomy performed",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "AFP normalized post-operatively",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest/abdomen/pelvis shows post-operative changes only with no evidence of residual or metastatic disease",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Back to baseline functional status post-operatively"
      },
      {
        "type": "investigation_finding",
        "value": "CT chest/abdomen/pelvis 10/5/24 shows post-operative changes only, no evidence of residual or metastatic disease"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently resected combined hepatocellular-cholangiocarcinoma with high-risk features. Uncomplicated post-operative recovery with normalized tumor markers."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to initiate adjuvant pembrolizumab immunotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline thyroid function, cortisol, and hepatic monitoring"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks to initiate therapy pending blood results"
      }
    ]
  }
}