{
  "content": "Diagnosis:\tHepatic epithelioid hemangioendothelioma, multifocal disease confined to liver\n\nDiagnosed March 2023 following liver biopsy. Immunohistochemistry confirmed CD31 and CD34 co-expression. Initial imaging showed multiple bilobar hepatic lesions, largest measuring 3.2cm in segment 7. No extrahepatic disease identified on staging CT chest/abdomen/pelvis or bone scan.\n\nI reviewed [redacted name] today in follow-up clinic. Latest MRI liver (15/4/2024) demonstrates stable appearances of all hepatic lesions compared to previous imaging from October 2023, with no new lesions identified. The largest lesion remains unchanged at 3.2cm. Liver function tests remain normal. She continues on 3-monthly surveillance as per our unit protocol for stable hepatic epithelioid hemangioendothelioma.\n\nOn examination today, the abdomen was soft and non-tender with no hepatomegaly or other concerning features. Performance status remains 0.\n\nThe plan is to continue current surveillance approach with next MRI liver in 3 months' time. We will review her again in clinic with those results.",
  "output": {
    "primary_cancer": {
      "site": "liver, multifocal bilobar",
      "year": 2023,
      "month": 3,
      "metastases": "confined to liver, no extrahepatic disease",
      "histopathology_status": "epithelioid hemangioendothelioma",
      "biomarker_status": "CD31 and CD34 co-expression positive",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Liver biopsy confirms epithelioid hemangioendothelioma with CD31/CD34 co-expression",
          "year": 2023,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Initial imaging shows multiple bilobar hepatic lesions, largest 3.2cm in segment 7",
          "year": 2023,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI liver shows stable disease with unchanged lesions, largest remains 3.2cm",
          "year": 2023,
          "month": 10
        },
        {
          "type": "anatomical_finding",
          "value": "MRI liver confirms continued stable disease with no new lesions",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "examination_finding",
        "value": "Abdomen soft and non-tender with no hepatomegaly"
      },
      {
        "type": "investigation_finding",
        "value": "Liver function tests normal"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Multifocal hepatic epithelioid hemangioendothelioma with stable disease on surveillance imaging"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on MRI with unchanged lesion sizes and no new lesions"
      },
      {
        "type": "planned_investigation",
        "value": "MRI liver in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinic review with MRI results in 3 months"
      }
    ]
  }
}