{
  "content": "Diagnosis:\tHepatocellular carcinoma, BCLC stage B\n\nInitial presentation March 2024 with 6.5cm segment VII mass and two satellite lesions (2.1cm, 1.8cm) in segment VI. Background Child-Pugh A cirrhosis. No extrahepatic disease.\n\nTreatment:\tFirst TACE procedure 15 April 2024\n\n[redacted name] attended for review following his first TACE procedure to the right lobe lesions. He has experienced moderate post-embolization syndrome with right upper quadrant pain and low-grade fever which settled after 5 days. His appetite has now returned to normal and he reports feeling well. No new symptoms of concern.\n\nBloods show stable liver function with albumin 38, bilirubin 22, INR 1.1. AFP has decreased from 2500 to 1800. Full blood count and renal function remain normal.\n\nExamination shows mild right upper quadrant tenderness but no other significant findings. Performance status remains 0.\n\nMRI liver is scheduled for 4 weeks' time to assess response. We will review him in clinic with the imaging results to consider timing of second TACE procedure. He understands to contact us if he develops fever, severe pain, or other concerning symptoms in the meantime.",
  "output": {
    "primary_cancer": {
      "site": "liver, segment VII with segment VI satellite lesions",
      "year": 2024,
      "month": 3,
      "metastases": "no extrahepatic disease",
      "other_stage": "BCLC stage B",
      "histopathology_status": "hepatocellular carcinoma",
      "biomarker_status": "AFP 2500 at diagnosis, decreased to 1800",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "6.5cm segment VII mass and two satellite lesions (2.1cm, 1.8cm) in segment VI identified",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "First TACE procedure to right lobe lesions",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "AFP decreased from 2500 to 1800",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Child-Pugh A cirrhosis"
      },
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "current_symptom",
        "value": "mild right upper quadrant tenderness"
      },
      {
        "type": "investigation_finding",
        "value": "stable liver function with albumin 38, bilirubin 22, INR 1.1"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "HCC with no extrahepatic disease, recovering well from first TACE procedure with improving AFP"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "moderate post-embolization syndrome with right upper quadrant pain and low-grade fever, resolved after 5 days"
      },
      {
        "type": "planned_investigation",
        "value": "MRI liver scheduled in 4 weeks to assess response"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic with MRI results to consider timing of second TACE procedure"
      }
    ]
  }
}