{
  "content": "I reviewed [redacted name] today following recent admission with decompensated liver disease. His hepatocellular carcinoma has unfortunately progressed despite two cycles of atezolizumab/bevacizumab, with new portal vein thrombosis on CT dated 15/4/24 and rising AFP from 22,000 to 35,000 over 6 weeks. His recent admission was complicated by grade 3 hepatic encephalopathy requiring temporary cessation of immunotherapy. His Child-Pugh score has deteriorated to B9 from previous B7, with new onset ascites requiring paracentesis. Performance status remains 2. Blood results show platelets 65, bilirubin 45, albumin 28, INR 1.4, and creatinine 98. After careful discussion at today's MDT, we have agreed to discontinue immunotherapy given disease progression and clinical deterioration. I have explained this to [redacted name] and his wife today. We will arrange urgent palliative care review and consider second-line lenvatinib if liver function improves. He understands the situation and agrees with this approach. I have prescribed spironolactone 100mg daily and furosemide 40mg daily for ascites management. He will be reviewed in clinic in 2 weeks with repeat bloods and AFP. The acute oncology team are aware and will provide additional support as needed.\n?\nI have made urgent referrals to both hospital and community palliative care teams. Please do not hesitate to contact us if you need any further information or if [redacted name] develops new symptoms requiring urgent review.",
  "output": {
    "primary_cancer": {
      "site": "liver",
      "metastases": "portal vein thrombosis",
      "other_stage": "BCLC C",
      "biomarker_status": "AFP 35,000",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "AFP increased from 22,000 to 35,000 over 6 weeks"
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows new portal vein thrombosis",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued atezolizumab/bevacizumab due to disease progression and clinical deterioration"
        },
        {
          "type": "other_progress_or_event",
          "value": "Admission with decompensated liver disease and grade 3 hepatic encephalopathy"
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2"
      },
      {
        "type": "current_symptom",
        "value": "Ascites requiring paracentesis"
      },
      {
        "type": "investigation_finding",
        "value": "Child-Pugh score B9, deteriorated from B7"
      },
      {
        "type": "investigation_finding",
        "value": "Platelets 65, bilirubin 45, albumin 28, INR 1.4, creatinine 98"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "HCC with portal vein thrombosis progressing on immunotherapy. Clinical deterioration with decompensated liver disease requiring treatment discontinuation"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on atezolizumab/bevacizumab with new portal vein thrombosis and rising AFP"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 hepatic encephalopathy requiring treatment cessation"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued immunotherapy, started spironolactone 100mg daily and furosemide 40mg daily for ascites"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with blood tests and AFP"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat bloods and AFP in 2 weeks"
      }
    ]
  }
}