{
  "content": "Many thanks for referring [redacted name], who I reviewed today in the Lung Cancer clinic following recent investigations. She is a 62-year-old lady who initially presented in January 2024 with persistent cough and right-sided chest discomfort. Initial chest X-ray showed a suspicious right hilar mass, leading to urgent CT chest which confirmed a 4.8cm mass in the right upper lobe with ipsilateral mediastinal lymphadenopathy but no distant metastases. Subsequent PET-CT on February 15th 2024 demonstrated FDG-avid primary lesion (SUV max 12.4) with involvement of right hilar and subcarinal nodes. CT-guided biopsy confirmed papillary adenocarcinoma of lung. Molecular testing has shown BRAF non-V600E mutation and PD-L1 expression of 85%. MRI brain was negative for metastatic disease.\n\nIn terms of symptoms, she describes improvement in her cough following recent corticosteroids, though still has some exertional dyspnoea. She has maintained good appetite and stable weight. Her performance status is 1, mainly due to breathlessness on moderate exertion. She has well-controlled hypertension on amlodipine but no other significant medical history. She is an ex-smoker having quit 10 years ago with approximately 30 pack-year history.\n\nOn examination today, she has reduced breath sounds in the right upper zone but otherwise normal respiratory examination. No peripheral lymphadenopathy and normal cardiac examination.\n\nI have discussed her case at length at our Lung Cancer MDT on March 12th 2024. Given her stage IIIA disease (T2N2M0), good performance status, and high PD-L1 expression, we recommend concurrent chemoradiotherapy with durvalumab maintenance. I have explained the treatment plan in detail, including the intensive nature of concurrent treatment, potential side effects, and the aim of treatment which is curative in intent. She will require baseline pulmonary function tests and EDTA clearance prior to starting treatment.\n\nThe plan is to commence cisplatin-based chemotherapy with concurrent radiotherapy (60Gy in 30 fractions) within the next 2 weeks. I have arranged urgent dental assessment and baseline hearing test given planned cisplatin. She will be reviewed weekly during treatment in the combined clinic. I have provided written information about concurrent chemoradiotherapy and arranged for our lung cancer nurse specialist to contact her tomorrow to address any additional questions.",
  "output": {
    "primary_cancer": {
      "site": "lung, right upper lobe",
      "year": 2024,
      "month": 1,
      "metastases": "ipsilateral mediastinal lymphadenopathy, right hilar nodes, subcarinal nodes",
      "tnm_stage": "T2N2M0",
      "other_stage": "Stage IIIA",
      "histopathology_status": "papillary adenocarcinoma",
      "biomarker_status": "BRAF non-V600E mutation, PD-L1 expression 85%",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Chest X-ray showed suspicious right hilar mass",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest confirmed 4.8cm mass in right upper lobe with ipsilateral mediastinal lymphadenopathy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT showed FDG-avid primary lesion (SUV max 12.4) with hilar and subcarinal nodes",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "CT-guided biopsy confirmed papillary adenocarcinoma with BRAF non-V600E mutation and PD-L1 85%",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain negative for metastatic disease",
          "year": 2024,
          "month": 2
        },
        {
          "type": "other_progress_or_event",
          "value": "Discussed at Lung Cancer MDT - recommended concurrent chemoradiotherapy with durvalumab maintenance",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1 due to breathlessness on moderate exertion"
      },
      {
        "type": "current_symptom",
        "value": "Improving cough following corticosteroids"
      },
      {
        "type": "current_symptom",
        "value": "Exertional dyspnoea"
      },
      {
        "type": "examination_finding",
        "value": "Reduced breath sounds in right upper zone"
      },
      {
        "type": "comorbidity",
        "value": "Well-controlled hypertension on amlodipine"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IIIA papillary adenocarcinoma of lung with nodal involvement. Initial presentation with improving symptoms, planned for concurrent chemoradiotherapy with curative intent."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence cisplatin-based chemotherapy with concurrent radiotherapy 60Gy in 30 fractions"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged baseline pulmonary function tests, EDTA clearance, dental assessment, and hearing test"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during treatment in combined clinic, lung cancer nurse specialist to contact tomorrow"
      }
    ]
  }
}