{
  "content": "Diagnosis:\n\nCombined small cell lung carcinoma, T3N2M1c\nDiagnosed March 2024\nDLL3 high expression, ASCL1 positive\nWidespread metastatic disease affecting liver, bone, and adrenal glands\n\nPrevious medical history:\nCOPD with frequent exacerbations\nType 2 diabetes\nHypertension\n\nCurrent medications:\nMorphine sulfate MR 30mg BD\nOxycodone 5mg PRN\nDexamethasone 4mg OD\nMetformin 1g BD\nRamipril 5mg OD\n\nTreatment summary:\nCycle 1-4 Carboplatin/Etoposide completed April 2024\nPalliative radiotherapy to T8 vertebra 20Gy in 5# completed March 2024\n\nCurrent situation:\nSignificant disease progression on CT 15 May 2024 with new liver lesions and increasing size of primary tumor. Performance status deteriorated to ECOG 3.\n\nI reviewed [redacted name] today who attended with his wife. Unfortunately, he has experienced significant clinical deterioration over the past three weeks. His mobility has declined substantially, and he now requires wheelchair assistance. He reports worsening right-sided chest pain and increasing breathlessness at rest, requiring oxygen support at 3L/min. His appetite has significantly decreased with associated weight loss of 6kg over the past month.\n\nOn examination, there is dullness to percussion and reduced air entry in the right hemithorax. There is tender hepatomegaly extending 4cm below the costal margin. Performance status has declined to ECOG 3.\n\nGiven the clear evidence of disease progression and declining performance status, we have had a detailed discussion about prognosis and future care planning. While second-line chemotherapy with topotecan was considered, his current performance status makes this unsuitable. We have agreed to focus on symptom management and quality of life.\n\nI have referred [redacted name] to our palliative care team for ongoing support and symptom management. We have increased his background morphine dose and provided additional breakthrough medication. I have also arranged for urgent community support through our palliative care coordinator.\n\nWe will continue to provide support through our specialist nursing team, and I have given clear instructions about contacting our acute oncology service if needed. [redacted name] and his wife understand the situation and have expressed a preference for home-based care where possible.",
  "output": {
    "primary_cancer": {
      "site": "lung",
      "year": 2024,
      "month": 3,
      "metastases": "liver, bone, and adrenal glands",
      "tnm_stage": "T3N2M1c",
      "histopathology_status": "combined small cell carcinoma",
      "biomarker_status": "DLL3 high expression, ASCL1 positive",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Palliative radiotherapy to T8 vertebra 20Gy in 5 fractions",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Carboplatin/Etoposide chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 4 cycles of Carboplatin/Etoposide",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows significant disease progression with new liver lesions and increasing size of primary tumor",
          "year": 2024,
          "month": 5
        },
        {
          "type": "other_progress_or_event",
          "value": "Clinical deterioration with declining mobility requiring wheelchair, increased oxygen requirements",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "COPD with frequent exacerbations"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "current_symptom",
        "value": "Worsening right-sided chest pain"
      },
      {
        "type": "current_symptom",
        "value": "Increasing breathlessness at rest, requiring oxygen 3L/min"
      },
      {
        "type": "examination_finding",
        "value": "Dullness to percussion and reduced air entry in right hemithorax"
      },
      {
        "type": "examination_finding",
        "value": "Tender hepatomegaly extending 4cm below costal margin"
      },
      {
        "type": "performance_status",
        "value": "ECOG 3"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires wheelchair assistance, weight loss of 6kg over past month"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Combined small cell lung cancer with widespread metastases showing disease progression after first-line chemotherapy. Significant clinical deterioration with declining performance status precluding further systemic therapy"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on CT with new liver lesions and increasing size of primary tumor"
      },
      {
        "type": "update_to_treatment",
        "value": "Transition to palliative care approach, increasing background morphine dose"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3, requiring wheelchair assistance and oxygen support"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to palliative care team for ongoing support and symptom management"
      }
    ]
  }
}