{
  "content": "I reviewed [redacted name] today for assessment during cycle 4 of concurrent chemoradiotherapy. She was diagnosed with locally advanced adenosquamous carcinoma of the right lower lobe in January 2024, stage T4N2M0 (IIIB), with PIK3CA mutation and PD-L1 50%. She completed induction chemotherapy with 2 cycles of carboplatin/paclitaxel achieving stable disease, and commenced concurrent chemoradiation on 15 March 2024.\n\nShe has managed the concurrent treatment relatively well though experiencing grade 2 radiation esophagitis requiring regular liquid morphine and nutritional supplements. Her radiation-induced cough has improved with regular codeine linctus. She maintains PS 1 and continues to work part-time from home. Recent blood tests show stable renal function and acceptable haematological parameters for continuing treatment.\n\nCT performed last week shows stable disease in the primary tumor and mediastinal nodes compared to pre-concurrent treatment imaging. The right-sided pleural effusion has not increased. Examination today reveals reduced breath sounds at the right base but no new concerns.\n\nThe plan is to complete the remaining 2 weeks of concurrent chemoradiation as scheduled. We will arrange a post-treatment CT at 6 weeks and review her in clinic with the results. I have prescribed additional nutritional supplements and arranged weekly review with our dietitian. She understands to contact us if symptoms worsen, particularly any increasing breathlessness or chest pain.",
  "output": {
    "primary_cancer": {
      "site": "lung, right lower lobe",
      "year": 2024,
      "month": 1,
      "metastases": "",
      "tnm_stage": "T4N2M0",
      "other_stage": "Stage IIIB",
      "histopathology_status": "adenosquamous carcinoma",
      "biomarker_status": "PIK3CA mutation positive, PD-L1 50%",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started induction carboplatin/paclitaxel chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "other_progress_or_event",
          "value": "Stable disease after 2 cycles of induction chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced concurrent chemoradiation",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable disease in primary tumor and mediastinal nodes, stable right pleural effusion",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 radiation esophagitis requiring liquid morphine"
      },
      {
        "type": "current_symptom",
        "value": "Radiation-induced cough, improved with codeine linctus"
      },
      {
        "type": "examination_finding",
        "value": "Reduced breath sounds at right base"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal function and acceptable haematological parameters"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Locally advanced lung cancer undergoing concurrent chemoradiation with stable disease on imaging and manageable toxicities"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 radiation esophagitis requiring liquid morphine and nutritional supplements"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on CT imaging of primary tumor and nodes"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing with concurrent chemoradiation as planned for remaining 2 weeks"
      },
      {
        "type": "planned_investigation",
        "value": "Post-treatment CT scan at 6 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly dietitian review and clinic review after post-treatment CT"
      }
    ]
  }
}