{
  "content": "Diagnosis:\tAtypical meningioma WHO grade II, right frontal parasagittal region\n\nI reviewed [redacted name] today following completion of fractionated stereotactic radiotherapy. The original diagnosis was made following surgical resection on 15 March 2024 of a right frontal parasagittal meningioma measuring 4.2cm, with histology confirming WHO grade II atypical features, Ki-67 proliferation index of 12% and PR negative status. Post-operative MRI showed small volume residual disease along the superior sagittal sinus.\n\nShe has completed a course of fractionated stereotactic radiotherapy, receiving 54Gy in 30 fractions, completing treatment on 10 May 2024. Overall, she tolerated the treatment remarkably well with only grade 1 fatigue and minimal scalp irritation during treatment. She did experience some intermittent headaches during week 4 of treatment which responded well to a short course of dexamethasone 4mg twice daily, now successfully weaned.\n\nOn review today, she reports continued improvement in her energy levels since completing radiotherapy. Her previous right-sided weakness has almost completely resolved following intensive physiotherapy. She is now walking independently and has returned to most daily activities. She denies any new neurological symptoms and reports good cognitive function with return to crossword puzzles and reading.\n\nOn examination, her performance status is 1. Neurological examination shows minimal residual right leg weakness (power 4+/5) but otherwise normal power, sensation, and coordination. Cranial nerve examination is unremarkable.\n\nThe latest MRI brain performed last week shows expected post-treatment changes with no evidence of disease progression. There is actually a slight reduction in the volume of residual disease compared to the post-operative imaging.\n\nThe plan is to continue surveillance with 3-monthly MRI brain scans for the first year. I have arranged the next scan for August 2024 with clinical review thereafter. I have provided her with written information about potential late effects of radiotherapy and symptoms that should prompt earlier review. She has been referred to our specialist neuro-oncology nurse for ongoing support.\n",
  "output": {
    "primary_cancer": {
      "site": "meninges, right frontal parasagittal region",
      "year": 2024,
      "month": 3,
      "metastases": null,
      "tnm_stage": null,
      "other_stage": "WHO grade II",
      "histopathology_status": "atypical meningioma",
      "biomarker_status": "Ki-67 proliferation index 12%, PR negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Surgical resection of 4.2cm right frontal parasagittal meningioma",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Post-operative MRI showed small volume residual disease along superior sagittal sinus",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed fractionated stereotactic radiotherapy 54Gy in 30 fractions",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started dexamethasone 4mg twice daily for radiation-related headaches",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Successfully weaned off dexamethasone",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows post-treatment changes with slight reduction in residual disease volume",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1"
      },
      {
        "type": "examination_finding",
        "value": "Minimal residual right leg weakness (power 4+/5), otherwise normal power, sensation, and coordination"
      },
      {
        "type": "examination_finding",
        "value": "Cranial nerve examination unremarkable"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Walking independently and returned to most daily activities including crossword puzzles and reading"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "WHO grade II atypical meningioma treated with surgery and radiotherapy. Good treatment response with improving functional status and stable imaging"
      },
      {
        "type": "latest_treatment_response",
        "value": "Slight reduction in volume of residual disease on MRI compared to post-operative imaging"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 fatigue and minimal scalp irritation during radiotherapy, temporary headaches managed with dexamethasone"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Improved right-sided weakness, now walking independently with return to daily activities"
      },
      {
        "type": "planned_investigation",
        "value": "MRI brain scan arranged for August 2024"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinical review following MRI in August 2024, referred to neuro-oncology nurse specialist"
      }
    ]
  }
}