{
  "content": "I reviewed [redacted name] today who is currently receiving concurrent chemoradiotherapy for his Stage III EBV-positive nasopharyngeal carcinoma. He was diagnosed in January 2024 following a 3-month history of right-sided neck swelling and occasional epistaxis. Initial imaging demonstrated a 4.2cm nasopharyngeal mass with bilateral cervical lymphadenopathy, most prominent in level II. PET-CT confirmed the local disease extent with no evidence of distant metastases, and MRI brain was reassuringly clear.\n\nHe is now at week 4 of concurrent cisplatin-based chemoradiotherapy, having received two cycles of cisplatin 100mg/m2 at days 1 and 22. Unfortunately, he has developed significant treatment-related toxicities over the past week. He describes grade 3 mucositis requiring increased opiate analgesia, and is struggling to maintain adequate oral intake despite dietary modifications and regular use of oral rinses. His weight has dropped by 4kg since starting treatment, now 72kg from a baseline of 76kg. He has also developed grade 2 radiation dermatitis affecting the anterior neck, which is being managed with appropriate skincare.\n\nDespite these challenges, he remains remarkably resilient with a performance status of 1. Today's blood tests show a concerning trend in renal function with creatinine rising from 89 to 142 μmol/L, likely reflecting inadequate fluid intake due to dysphagia. His other blood parameters remain stable with haemoglobin 118 g/L and platelets 156.\n\nOn examination today, there is obvious radiation dermatitis across the anterior neck treatment field. Oral examination reveals confluent mucositis affecting the posterior pharyngeal wall. The initially palpable right neck nodes have notably decreased in size, suggesting good early response to treatment.\n\nGiven the deterioration in renal function and severity of mucositis, I have made the decision to omit his final cycle of cisplatin. He will continue with radiotherapy alone to complete his planned course. I have arranged urgent dietetic review and consideration of nasogastric feeding if oral intake does not improve over the next 48 hours. He has been given contact details for the acute oncology service and understands to attend if his symptoms worsen.",
  "output": {
    "primary_cancer": {
      "site": "nasopharynx",
      "year": 2024,
      "month": 1,
      "metastases": "bilateral cervical lymphadenopathy, most prominent in level II",
      "other_stage": "Stage III",
      "histopathology_status": "undifferentiated carcinoma",
      "biomarker_status": "EBV positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "4.2cm nasopharyngeal mass with bilateral cervical lymphadenopathy on initial imaging",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT confirmed local disease extent with no distant metastases",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain clear of disease",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent cisplatin-based chemoradiotherapy, cisplatin 100mg/m2 day 1 and 22",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Decision to omit final cycle of cisplatin due to deteriorating renal function and severe mucositis",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "performance status of 1"
      },
      {
        "type": "current_symptom",
        "value": "grade 3 mucositis requiring increased opiate analgesia"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 radiation dermatitis affecting the anterior neck"
      },
      {
        "type": "examination_finding",
        "value": "radiation dermatitis across anterior neck treatment field, confluent mucositis affecting posterior pharyngeal wall"
      },
      {
        "type": "investigation_finding",
        "value": "creatinine risen from 89 to 142 μmol/L, haemoglobin 118 g/L, platelets 156"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage III nasopharyngeal carcinoma undergoing concurrent chemoradiotherapy. Developing significant treatment toxicities requiring modification of treatment plan."
      },
      {
        "type": "latest_treatment_response",
        "value": "Initially palpable right neck nodes notably decreased in size"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 mucositis, grade 2 radiation dermatitis, deteriorating renal function"
      },
      {
        "type": "update_to_treatment",
        "value": "Final cycle of cisplatin omitted, continuing with radiotherapy alone"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "4kg weight loss since starting treatment, now 72kg from baseline 76kg"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent dietetic review arranged with consideration of nasogastric feeding if oral intake does not improve"
      }
    ]
  }
}