{
  "content": "Diagnosis:\tT2N0M0 squamous cell carcinoma of right oral tongue\n\nI reviewed [redacted name] today for assessment during his concurrent chemoradiotherapy. He is currently on day 18 of radiotherapy (prescribed 66Gy in 30 fractions) with weekly cisplatin. He has completed 4 cycles of weekly cisplatin 40mg/m2 to date with good tolerance.\n\nHe reports grade 2 mucositis affecting the right side of his tongue and floor of mouth, managed with regular mouthwashes and oral morphine solution as required. His swallowing remains functional though he is finding solid foods increasingly difficult. He is maintaining adequate oral intake with soft diet and nutritional supplements. His taste is reduced but he denies complete loss. Weight has remained stable at 72kg.\n\nHe developed grade 1 nausea following the last cisplatin dose which resolved with additional antiemetics. Blood tests today show stable renal function with creatinine 89 μmol/L and satisfactory FBC with neutrophils 2.8.\n\nOn examination, there is confluent mucositis affecting the right lateral tongue but no evidence of residual tumor. Neck examination reveals no lymphadenopathy.\n\nThe plan is to proceed with cycle 5 weekly cisplatin today and continue radiotherapy. We will review again next week before the final cisplatin dose. I have reinforced the importance of regular mouth care and maintaining oral intake. He understands to contact us if symptoms worsen.",
  "output": {
    "primary_cancer": {
      "site": "oral tongue, right",
      "tnm_stage": "T2N0M0",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "PDL1 CPS 20",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced weekly cisplatin 40mg/m2 concurrent with radiotherapy"
        },
        {
          "type": "treatment_radiotherapy",
          "value": "On day 18 of radical radiotherapy 66Gy in 30 fractions"
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 4 cycles of weekly cisplatin with good tolerance"
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 2 mucositis affecting right side of tongue and floor of mouth"
      },
      {
        "type": "current_symptom",
        "value": "Reduced taste sensation but no complete loss"
      },
      {
        "type": "examination_finding",
        "value": "Confluent mucositis affecting right lateral tongue, no evidence of residual tumor, no lymphadenopathy"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal function with creatinine 89 μmol/L, neutrophils 2.8"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "T2N0M0 oral tongue SCC receiving concurrent chemoradiotherapy with good tolerance and appropriate treatment-related toxicity"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 nausea following last cisplatin dose, resolved with additional antiemetics"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 5 weekly cisplatin and continuing radiotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week before final cisplatin dose"
      }
    ]
  }
}