{
  "content": "Diagnosis:\nT3N1M0 squamous cell carcinoma of left oral tongue\n\nPrevious treatment:\nRadical chemoradiotherapy commenced 15 January 2024\nCisplatin 100mg/m2 days 1, 22, 43\nRadical radiotherapy 66Gy in 30 fractions\n\nCurrent medications:\nOndansetron 8mg bd\nDexamethasone 4mg bd\nCo-codamol 30/500mg qds\nBenzydamine mouthwash\n\nCurrent situation:\nWeek 5 of chemoradiotherapy\n\nI reviewed [redacted name] today during week 5 of radical chemoradiotherapy. Unfortunately, his treatment course has been challenging with development of grade 3 oral mucositis requiring increased analgesia and temporary nasogastric feeding. He completed two cycles of cisplatin but the third cycle planned for today has been omitted due to deteriorating performance status and acute kidney injury (creatinine 156, baseline 82).\n\nHe describes severe pain on swallowing requiring regular morphine, and has lost 4kg over the past two weeks despite nutritional support. His voice is notably hoarse. Examination shows confluent mucositis affecting the oropharynx with thick secretions. There is marked radiation dermatitis (grade 2) affecting the anterior neck. The previously palpable left level 2 node has significantly decreased in size.\n\nDespite these challenges, we have agreed to continue with radiotherapy to complete the prescribed course, with enhanced supportive care. I have arranged daily review by our specialist nurses and dietitian input. Blood tests show stable full blood count but rising creatinine at 156. Magnesium and potassium supplementation has been arranged.\n\nThe plan is to complete radiotherapy as scheduled on 23 February 2024, with consideration of admission if oral intake deteriorates further. Follow-up CT head and neck is booked for 6 weeks post-treatment, and we will review him weekly during recovery phase then at 6 weeks with imaging results.",
  "output": {
    "primary_cancer": {
      "site": "oral tongue, left",
      "year": 2024,
      "tnm_stage": "T3N1M0",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "PDL1 CPS 25",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started radical chemoradiotherapy with cisplatin 100mg/m2 planned days 1, 22, 43",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Commenced radical radiotherapy 66Gy in 30 fractions",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Third cycle cisplatin omitted due to deteriorating performance status and acute kidney injury",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "Previously palpable left level 2 node significantly decreased in size",
          "year": 2024,
          "month": 2
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Severe pain on swallowing requiring regular morphine"
      },
      {
        "type": "current_symptom",
        "value": "Hoarse voice"
      },
      {
        "type": "examination_finding",
        "value": "Confluent mucositis affecting the oropharynx with thick secretions"
      },
      {
        "type": "examination_finding",
        "value": "Grade 2 radiation dermatitis affecting anterior neck"
      },
      {
        "type": "investigation_finding",
        "value": "Rising creatinine at 156 (baseline 82)"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Week 5 of radical chemoradiotherapy for tongue SCC, treatment complicated by grade 3 mucositis and AKI requiring omission of third cycle cisplatin"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 oral mucositis requiring increased analgesia and temporary nasogastric feeding"
      },
      {
        "type": "latest_treatment_response",
        "value": "Clinical response with reduction in size of previously palpable neck node"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing radiotherapy with enhanced supportive care, third cycle cisplatin omitted"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "4kg weight loss over past two weeks despite nutritional support"
      },
      {
        "type": "planned_investigation",
        "value": "CT head and neck booked for 6 weeks post-treatment"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during recovery phase then at 6 weeks with imaging results"
      }
    ]
  }
}