{
  "content": "Many thanks for referring [redacted name] for urgent assessment following recent disease progression. I reviewed him today accompanied by his wife and daughter.\n\nThis 62-year-old gentleman was initially diagnosed with locally advanced squamous cell carcinoma of the left floor of mouth in January 2024, presenting as T4b disease with bilateral cervical lymphadenopathy. Initial PET-CT demonstrated FDG-avid primary disease with extensive nodal involvement and subsequent staging identified multiple pulmonary metastases and a 3.2cm liver lesion in segment 7. Molecular testing revealed PDL1 CPS of 85.\n\nHe commenced first-line pembrolizumab-platinum-5FU in February 2024 and completed 4 cycles with initial good partial response in the primary disease and nodal sites. However, cycle 5 was delayed due to grade 3 mucositis requiring hospitalization. Following recovery, restaging in April 2024 demonstrated disease progression with new pulmonary nodules and increase in the liver metastasis to 4.8cm. His performance status has declined from ECOG 1 to ECOG 3 over the past 3 weeks.\n\nHe presents today with severe pain affecting the floor of mouth, progressive dysphagia requiring nasogastric feeding, and new onset right upper quadrant pain. Clinical examination reveals extension of the primary tumor with impending airway compromise and tender hepatomegaly. Recent blood tests show deteriorating liver function with bilirubin 45 μmol/L and ALT 156 U/L.\n\nI have had detailed discussions with [redacted name] and his family regarding the rapid disease progression and poor prognosis. While second-line therapy with taxane chemotherapy could be considered, his declining performance status and organ function make this high risk. We agreed to prioritize symptom control with urgent palliative radiotherapy to the primary site (30Gy in 10 fractions) starting tomorrow. I have arranged admission to [redacted name] Hospice for intensive symptom management and support.\n\nI have completed urgent referrals to the palliative radiotherapy service, specialist palliative care team, and dietetics. Blood tests and liver ultrasound will be performed during admission to guide symptom management. We will review his response to radiotherapy next week and reassess suitability for second-line systemic therapy at that point.",
  "output": {
    "primary_cancer": {
      "site": "oral cavity, left floor of mouth",
      "year": 2024,
      "month": 1,
      "metastases": "bilateral cervical lymph nodes, multiple pulmonary metastases, liver metastasis segment 7",
      "tnm_stage": "T4bN2cM1",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "PDL1 CPS 85",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Initial PET-CT showed FDG-avid primary disease with bilateral cervical nodes, pulmonary metastases and 3.2cm liver lesion segment 7",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started pembrolizumab-platinum-5FU",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cycle 5 delayed due to grade 3 mucositis requiring hospitalization",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "Restaging shows disease progression with new pulmonary nodules and liver metastasis increased to 4.8cm",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Declined from ECOG 1 to ECOG 3 over past 3 weeks"
      },
      {
        "type": "current_symptom",
        "value": "Severe pain affecting floor of mouth"
      },
      {
        "type": "current_symptom",
        "value": "Progressive dysphagia requiring nasogastric feeding"
      },
      {
        "type": "current_symptom",
        "value": "Right upper quadrant pain"
      },
      {
        "type": "examination_finding",
        "value": "Extension of primary tumor with impending airway compromise and tender hepatomegaly"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating liver function with bilirubin 45 μmol/L and ALT 156 U/L"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced oral cavity SCC with rapid progression on first-line immunotherapy. Significant clinical deterioration with poor prognosis"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 mucositis requiring hospitalization during first-line therapy"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with new pulmonary nodules and increasing liver metastasis"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status from ECOG 1 to ECOG 3"
      },
      {
        "type": "update_to_treatment",
        "value": "Planned urgent palliative radiotherapy 30Gy in 10 fractions to primary site"
      },
      {
        "type": "planned_investigation",
        "value": "Blood tests and liver ultrasound during admission"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referrals to palliative radiotherapy, specialist palliative care, and dietetics. Review planned after radiotherapy to assess second-line therapy suitability"
      }
    ]
  }
}