{
  "content": "Diagnosis:\tSquamous cell carcinoma of left floor of mouth\n\nManagement:\t12 Mar 2024 Incisional biopsy\n\t\t20 Mar 2024 Left neck dissection levels I-IV\n\nHistology:\tModerately differentiated squamous cell carcinoma\n\tpT2N1M0 (AJCC 8th Ed)\n\tSingle level IIA node positive (2/18)\n\tNo extranodal extension\n\tPDL1 CPS 30%\n\nCurrent Situation:\tPost-operative review prior to adjuvant treatment\n\nI reviewed [redacted name] today following his recent neck dissection. He has made an excellent recovery from surgery with good wound healing and no complications. His speech and swallowing have returned to normal, and he reports only mild neck stiffness which is improving with prescribed exercises. His main concern is returning to work as a carpenter, which we agreed would be possible after completing planned adjuvant treatment.\n\nOn examination today, the surgical sites are well healed with no evidence of local recurrence. Neck movements are slightly restricted but improving. No palpable cervical lymphadenopathy.\n\nI have discussed the histology results which confirm a T2N1 squamous cell carcinoma with a single positive lymph node. Given the nodal involvement, I have recommended adjuvant radiotherapy to the primary site and left neck. This would involve 30 treatments over 6 weeks. The main side effects of dry mouth, taste changes, and skin reaction were discussed.\n\nThe plan is to proceed with radiotherapy planning CT next week, aiming to start treatment in 2 weeks. We will see him weekly during radiotherapy in the treatment review clinic.",
  "output": {
    "primary_cancer": {
      "site": "oral cavity, left floor of mouth",
      "year": 2024,
      "month": 3,
      "metastases": "single positive lymph node level IIA",
      "tnm_stage": "pT2N1M0",
      "histopathology_status": "moderately differentiated squamous cell carcinoma, no extranodal extension",
      "biomarker_status": "PDL1 CPS 30%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Incisional biopsy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Left neck dissection levels I-IV, 2/18 nodes positive",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Histology confirms pT2N1M0 moderately differentiated SCC, single level IIA node positive, no extranodal extension",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Mild neck stiffness, improving with exercises"
      },
      {
        "type": "examination_finding",
        "value": "Well healed surgical sites, no evidence of local recurrence, slightly restricted neck movements, no palpable cervical lymphadenopathy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed oral cavity SCC with single nodal involvement, post-operative recovery proceeding well, planned for adjuvant radiotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Good post-operative recovery with return of normal speech and swallowing"
      },
      {
        "type": "planned_investigation",
        "value": "Radiotherapy planning CT next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during planned 6-week course of radiotherapy"
      }
    ]
  }
}