{
  "content": "Diagnosis:\t\tT2N1M0 squamous cell carcinoma of oral tongue\n\nManagement:\t\t12 Jan 2024 Partial glossectomy and selective neck dissection\n\t\t\t15 Feb - 22 Mar 2024 Adjuvant chemoradiotherapy with weekly cisplatin\n\nHistology:\t\tModerately differentiated squamous cell carcinoma, 2.8cm, depth of invasion 12mm, lymphovascular invasion present, perineural invasion present, 2/15 lymph nodes positive, PDL1 CPS 10\n\nCurrent Situation:\tPost-completion of chemoradiotherapy with grade 3 mucositis and dysphagia\n\n[redacted name] attended clinic today following completion of adjuvant chemoradiotherapy. Unfortunately, she has developed significant grade 3 mucositis requiring nasogastric feeding and admission to hospital last week for symptom control. She completed 5/6 planned cycles of cisplatin, with the final cycle omitted due to deteriorating renal function. Her creatinine clearance has dropped from 85 to 45 ml/min. She has also developed grade 2 peripheral neuropathy affecting hands and feet.\n\nGiven the severity of side effects and completion of planned radiotherapy course, we will not administer the final cycle of cisplatin. She will continue with nasogastric feeding support and regular review by our dietetics team. Speech and language therapy assessment is arranged for next week. We have organized weekly clinical review until mucositis improves. Blood tests including renal function will be monitored. First post-treatment imaging will be arranged for 8 weeks' time.",
  "output": {
    "primary_cancer": {
      "site": "oral tongue",
      "year": 2024,
      "month": 1,
      "tnm_stage": "T2N1M0",
      "histopathology_status": "Moderately differentiated squamous cell carcinoma, 2.8cm, depth of invasion 12mm, lymphovascular invasion present, perineural invasion present, 2/15 lymph nodes positive",
      "biomarker_status": "PDL1 CPS 10",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Partial glossectomy and selective neck dissection",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant chemoradiotherapy with weekly cisplatin",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 5/6 planned cycles of cisplatin, final cycle omitted due to deteriorating renal function",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed course of adjuvant radiotherapy",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 3 mucositis requiring nasogastric feeding"
      },
      {
        "type": "investigation_finding",
        "value": "Creatinine clearance dropped from 85 to 45 ml/min"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Post-operative tongue cancer patient completing adjuvant chemoradiotherapy. Treatment complicated by severe mucositis and declining renal function requiring treatment modification"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 mucositis requiring nasogastric feeding, grade 2 peripheral neuropathy, deteriorating renal function"
      },
      {
        "type": "update_to_treatment",
        "value": "Final cycle of cisplatin cancelled due to toxicity, completed planned radiotherapy course"
      },
      {
        "type": "planned_investigation",
        "value": "Post-treatment imaging in 8 weeks, weekly blood tests including renal function"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly clinical review until mucositis improves, speech and language therapy assessment next week, ongoing dietetics review"
      }
    ]
  }
}