{
  "content": "I reviewed [redacted name] today who attended with his wife following recent CT imaging showing disease progression. He was initially diagnosed with locally advanced p16-positive oropharyngeal squamous cell carcinoma in January 2024, presenting with a T4b tumor extending into the masticator space with bilateral neck nodes (N2c). He completed radical chemoradiotherapy with high-dose cisplatin in March 2024, achieving initial good response, but unfortunately developed progressive dysphagia and right-sided facial pain in May 2024.\n\nRestaging CT chest/abdomen/pelvis on 15th June 2024 has shown new pulmonary metastases with the largest measuring 2.8cm in the right lower lobe, and two suspicious sclerotic lesions in T4 and L2 vertebrae. His PDL1 CPS score from the original diagnostic biopsy was 45%. He has experienced significant clinical deterioration over the past month with increasing pain requiring opioid escalation, reduced oral intake, and weight loss of 6kg. His performance status has declined from 1 to 2-3.\n\nOn examination today, there is marked trismus limiting oral examination, but visible progression of disease at the right retromolar trigone. He has new right-sided facial weakness affecting the mandibular branch of the facial nerve. His weight is now 62kg, down from 68kg four weeks ago. Chest examination reveals reduced air entry at the right base consistent with the known metastatic disease.\n\nI have had a lengthy discussion with [redacted name] and his wife about the change in his condition. Given his good performance status prior to progression and high PDL1 expression, I have recommended commencing pembrolizumab immunotherapy. We discussed the mechanism of action, potential benefits, and side effect profile in detail. He will require dental assessment and baseline endocrine function tests before starting treatment.\n\nI have prescribed additional breakthrough analgesia and arranged urgent referral to the palliative care team for specialist pain management input. He will also see our dietitian today for nutritional support advice. We have organized CT simulation for palliative radiotherapy to the T4 vertebral metastasis (planned dose 20Gy in 5 fractions) to help with pain control.\n\nThe plan is to commence pembrolizumab next week assuming dental clearance, with concurrent palliative radiotherapy to the spine. We will arrange weekly review during radiotherapy and formal reassessment after 9 weeks of immunotherapy. I have also referred him to our specialist head and neck clinical nurse specialist for additional support.",
  "output": {
    "primary_cancer": {
      "site": "oropharynx, right retromolar trigone",
      "year": 2024,
      "month": 1,
      "metastases": "bilateral neck nodes, new pulmonary metastases in right lower lobe, T4 and L2 vertebral metastases",
      "tnm_stage": "T4bN2cM0",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p16 positive, PDL1 CPS 45%",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced radical chemoradiotherapy with high-dose cisplatin",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Developed progressive dysphagia and right-sided facial pain",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows new pulmonary metastases (largest 2.8cm RLL) and sclerotic lesions in T4 and L2 vertebrae",
          "year": 2024,
          "month": 6
        },
        {
          "type": "other_progress_or_event",
          "value": "Clinical deterioration with 6kg weight loss and declining performance status",
          "year": 2024,
          "month": 6
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Declined from PS 1 to PS 2-3"
      },
      {
        "type": "current_symptom",
        "value": "Increasing pain requiring opioid escalation"
      },
      {
        "type": "current_symptom",
        "value": "Reduced oral intake"
      },
      {
        "type": "current_symptom",
        "value": "Marked trismus limiting oral examination"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided facial weakness affecting mandibular branch"
      },
      {
        "type": "examination_finding",
        "value": "Visible progression of disease at right retromolar trigone"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry at right base"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Weight decreased to 62kg from 68kg in four weeks"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Initially treated p16+ oropharyngeal SCC now with progressive disease including new pulmonary and bone metastases. Significant clinical deterioration with pain and weight loss requiring urgent palliative intervention and planned immunotherapy."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence pembrolizumab immunotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "Requires dental assessment and baseline endocrine function tests"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team for pain management, dietitian review, and head and neck clinical nurse specialist"
      },
      {
        "type": "update_to_treatment",
        "value": "Planned palliative radiotherapy 20Gy in 5 fractions to T4 vertebral metastasis"
      }
    ]
  }
}