{
  "content": "Diagnosis:\tT2N1M0 p16 positive squamous cell carcinoma of oropharynx\n\nInitial treatment completed March 2024 with radical chemoradiotherapy (70Gy in 35 fractions with concurrent cisplatin).\n\nI reviewed [redacted name] today for first follow-up post completion of treatment. He has made an excellent recovery from the acute effects of chemoradiotherapy. His swallowing has significantly improved though he continues to require thickened fluids. Weight has stabilized at 72kg. He reports good energy levels and has returned to work part-time.\n\nOn examination today, there is complete resolution of the previous right tonsil primary site appearance. No palpable cervical lymphadenopathy. Oral mucosa shows expected post-radiotherapy changes but no concerning features.\n\nOverall, this represents a good clinical response to treatment with improving functional status. We will continue regular follow-up as per protocol with next review in 6 weeks' time. [redacted name] understands to contact us sooner if any new concerns develop.",
  "output": {
    "primary_cancer": {
      "site": "oropharynx, right tonsil",
      "year": 2024,
      "metastases": "cervical lymph nodes",
      "tnm_stage": "T2N1M0",
      "biomarker_status": "p16 positive",
      "histopathology_status": "squamous cell carcinoma",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced concurrent chemoradiotherapy with cisplatin",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed radical radiotherapy 70Gy in 35 fractions",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Complete clinical response at primary site with resolution of lymphadenopathy",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Requires thickened fluids for swallowing"
      },
      {
        "type": "examination_finding",
        "value": "Complete resolution of right tonsil primary site appearance, no palpable cervical lymphadenopathy"
      },
      {
        "type": "examination_finding",
        "value": "Oral mucosa shows expected post-radiotherapy changes but no concerning features"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Returned to work part-time"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "P16 positive oropharyngeal cancer treated with radical chemoradiotherapy. Good clinical response with improving functional status at first follow-up"
      },
      {
        "type": "latest_treatment_response",
        "value": "Complete clinical response at primary site with resolution of lymphadenopathy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Excellent recovery from acute treatment effects with stabilized weight at 72kg and improved swallowing"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 6 weeks as per protocol"
      }
    ]
  }
}