{
  "content": "Diagnosis:\nLocally advanced p16 positive oropharyngeal squamous cell carcinoma, cT2N1M0 (Stage II)\n\nPrevious treatment:\nCompleted radical chemoradiotherapy March 2024 (70Gy in 35 fractions with concurrent weekly cisplatin)\n\nCurrent medications:\nOndansetron 8mg bd\nDexamethasone 4mg bd\nCo-codamol 30/500mg qds\nArtificial saliva spray prn\n\nCurrent situation:\nSeen today for week 6 review during radiotherapy\n\nI reviewed [redacted name] today who is experiencing significant treatment-related toxicity. He has developed grade 3 mucositis requiring increased analgesia and affecting his oral intake. His weight has dropped by 4kg over the past 2 weeks despite dietary supplementation. He is managing only liquid nutrition and requires regular breakthrough morphine. He has also developed grade 2 radiation dermatitis affecting his neck. His performance status has deteriorated to ECOG 2.\n\nOn examination today, there is severe mucositis affecting the oropharynx with confluent ulceration. The skin reaction is confluent erythema without breakdown. His blood results show stable renal function but his magnesium has dropped to 0.62.\n\nGiven the severity of his symptoms and impact on quality of life, we have made the decision to pause his radiotherapy after today's fraction (fraction 30/35). He will be reviewed again on Monday with blood tests, and if there is improvement in his mucositis we will consider completing the final 5 fractions. I have also held his cisplatin for this week.\n\nHe has been given subcutaneous fluids and magnesium replacement today. The speech and language team have reviewed him and provided additional support for safe swallowing. I have arranged daily reviews by our specialist nurses and provided emergency contact details.\n\nThe plan is to review on Monday with blood tests including magnesium level. If oral intake has not improved by then, we will arrange hospital admission for supportive care.",
  "output": {
    "primary_cancer": {
      "site": "oropharynx",
      "year": 2024,
      "metastases": "none",
      "tnm_stage": "cT2N1M0",
      "other_stage": "Stage II",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p16 positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent weekly cisplatin with radiotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Started radical radiotherapy 70Gy in 35 fractions",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cisplatin held due to grade 3 mucositis",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Radiotherapy paused after fraction 30/35 due to grade 3 mucositis",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2"
      },
      {
        "type": "current_symptom",
        "value": "Grade 3 mucositis requiring regular morphine"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 radiation dermatitis affecting neck"
      },
      {
        "type": "examination_finding",
        "value": "Severe mucositis affecting oropharynx with confluent ulceration"
      },
      {
        "type": "examination_finding",
        "value": "Confluent erythema of neck skin without breakdown"
      },
      {
        "type": "investigation_finding",
        "value": "Low magnesium 0.62"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage II p16 positive oropharyngeal cancer on radical chemoradiotherapy. Treatment paused due to severe mucositis affecting intake and requiring increased support"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 mucositis and grade 2 radiation dermatitis, 4kg weight loss, requiring treatment break"
      },
      {
        "type": "update_to_treatment",
        "value": "Radiotherapy paused after fraction 30/35, cisplatin held, received IV fluids and magnesium"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 2, managing only liquid nutrition"
      },
      {
        "type": "planned_investigation",
        "value": "Review Monday with blood tests including magnesium"
      },
      {
        "type": "follow_up_referral",
        "value": "Daily specialist nurse reviews arranged, possible admission if intake doesn't improve"
      }
    ]
  }
}