{
  "content": "Diagnosis:\tT2N1M0 p16 positive oropharyngeal squamous cell carcinoma\n\nI reviewed [redacted name] today following completion of radical chemoradiotherapy. He completed treatment on 15/3/24 with good compliance throughout, managing all planned cycles of weekly cisplatin and the full course of radiotherapy.?\n?\nHe is recovering well from the acute effects of treatment. His swallowing has significantly improved and he is now managing a soft diet without requiring supplementary feeding. The grade 2 radiation-induced skin reaction has largely resolved. He continues to have mild xerostomia but this is gradually improving with regular oral rinses.?\n?\nOn examination today, there is complete resolution of the original tumor at the right base of tongue. The previously involved right level 2 lymph nodes are no longer palpable. His weight has stabilised at 72kg.?\n?\nThe plan is for surveilance imaging with a contrast-enhanced CT neck/thorax in 8 weeks time. We will see him back in clinic with these results. I have provided him with contact details for the head and neck specialist nurse should he have any concerns in the interim.",
  "output": {
    "primary_cancer": {
      "site": "oropharynx, right base of tongue",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "p16 positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Completed course of weekly cisplatin concurrent with radiotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed radical radiotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Complete resolution of original tumor at right base of tongue with resolution of previously involved lymph nodes",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Mild xerostomia, gradually improving with oral rinses"
      },
      {
        "type": "examination_finding",
        "value": "Complete resolution of original tumor at right base of tongue, previously involved right level 2 lymph nodes no longer palpable"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Managing soft diet without supplementary feeding"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "T2N1M0 p16 positive oropharyngeal cancer. Good recovery following completion of radical chemoradiotherapy with resolving treatment-related toxicities"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 radiation-induced skin reaction largely resolved, mild persistent xerostomia"
      },
      {
        "type": "planned_investigation",
        "value": "Contrast-enhanced CT neck/thorax in 8 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic with CT results"
      }
    ]
  }
}