{
  "content": "I reviewed [redacted name] today who has been receiving maintenance Letrozole following 6 cycles of carboplatin/paclitaxel for stage IV low grade serous ovarian carcinoma. She was diagnosed in January 2023 following presentation with abdominal distension, and initial CT demonstrated widespread peritoneal disease with pleural effusions and liver metastases. Molecular profiling identified a KRAS G12V mutation.\n\nInitial treatment with carboplatin/paclitaxel was completed in July 2023 with partial response, followed by maintenance Letrozole. Unfortunately, recent CT imaging from March 15th 2024 shows disease progression with increasing size of liver metastases (largest lesion segment 7 increased from 3.2cm to 4.8cm) and new onset ascites requiring therapeutic paracentesis. Her CA125 has risen from 280 to 845 over the past 8 weeks.\n\nShe has experienced increasing abdominal discomfort and early satiety, with 4kg weight loss over 6 weeks. Her performance status has declined from ECOG 1 to ECOG 2. She requires additional analgesics and reports increasing fatigue, managing only short walks around her home. Today's examination reveals moderate ascites with shifting dullness and tender hepatomegaly extending 4cm below the costal margin.\n\nGiven the disease progression on Letrozole, I have discussed treatment options including MEK inhibitor therapy given her KRAS mutation status. We have reviewed the side effect profile in detail, including risk of rash, diarrhea, and visual disturbance. [redacted name] is keen to proceed with this approach. I have arranged baseline ophthalmology assessment, ECG, and echocardiogram prior to commencing treatment.\n\nThe plan is to initiate Trametinib 2mg once daily following completion of baseline investigations. I have provided written information about side effect management and emergency contact details. We will review her in 2 weeks to assess tolerability, with blood tests including LFTs and CK level. A progress CT scan will be arranged after 8 weeks of therapy to assess response.\n\nI have referred her to our palliative care team for additional support with symptom management, particularly focusing on the management of ascites and abdominal discomfort. Our specialist nurse will maintain regular telephone contact during the initiation phase of treatment.",
  "output": {
    "primary_cancer": {
      "site": "ovary",
      "year": 2023,
      "month": 1,
      "metastases": "widespread peritoneal disease, pleural effusions, liver metastases",
      "other_stage": "Stage IV",
      "histopathology_status": "low grade serous carcinoma",
      "biomarker_status": "KRAS G12V mutation",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Initial CT showed widespread peritoneal disease with pleural effusions and liver metastases",
          "year": 2023,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started carboplatin/paclitaxel chemotherapy",
          "year": 2023,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 6 cycles carboplatin/paclitaxel with partial response, started maintenance Letrozole",
          "year": 2023,
          "month": 7
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 risen from 280 to 845 over 8 weeks",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression - liver metastases increasing (segment 7 lesion 4.8cm from 3.2cm) and new ascites",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2, declined from ECOG 1"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal discomfort and early satiety"
      },
      {
        "type": "current_symptom",
        "value": "4kg weight loss over 6 weeks"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue, managing only short walks around home"
      },
      {
        "type": "examination_finding",
        "value": "Moderate ascites with shifting dullness and tender hepatomegaly 4cm below costal margin"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IV low grade serous ovarian cancer progressing on maintenance Letrozole with deteriorating symptoms. Planning switch to MEK inhibitor therapy based on KRAS mutation"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on Letrozole with increasing liver metastases and new ascites"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing Letrozole, planning to start Trametinib 2mg daily after baseline investigations"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in performance status from ECOG 1 to 2 with reduced mobility"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline ophthalmology assessment, ECG, and echocardiogram before starting Trametinib; CT scan after 8 weeks of therapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks to assess Trametinib tolerability, referred to palliative care team for symptom management"
      }
    ]
  }
}