{
  "content": "Diagnosis:\tStage IC1 mucinous ovarian carcinoma\n\nManagement:\t15 Jan 2024 Primary debulking surgery - Total abdominal hysterectomy, bilateral salpingo-oophorectomy, omentectomy\n\nHistology:\tModerately differentiated mucinous adenocarcinoma, capsule breach during surgery, HER2 negative\n\nCurrent Situation:\tPre cycle 4 carboplatin/paclitaxel\n\nI reviewed [redacted name] today in the gynae-oncology clinic. She is tolerating chemotherapy well overall with no significant toxicities. Her main side effect remains grade 1 peripheral neuropathy affecting her fingertips, which is not impacting daily activities. Her nausea is well controlled with standard antiemetics. She has maintained her weight at 68kg and continues to exercise regularly with daily walks.\n\nBlood results show stable parameters with hemoglobin 115 g/L, neutrophils 2.8, platelets 245. CA125 has normalized at 22 (previously 45 after cycle 2, down from 180 at diagnosis). Performance status remains 0.\n\nOn examination today, surgical wounds are well healed with no concerning features. Cardiorespiratory examination is normal.\n\nThe plan is to proceed with cycle 4 carboplatin AUC5 and paclitaxel 175mg/m2 today. We will arrange CT chest/abdomen/pelvis after cycle 6 to assess end of treatment response. She will be reviewed again in clinic prior to cycle 5 in three weeks.",
  "output": {
    "primary_cancer": {
      "site": "ovary",
      "year": 2024,
      "month": 1,
      "metastases": "",
      "tnm_stage": "",
      "other_stage": "Stage IC1",
      "histopathology_status": "moderately differentiated mucinous adenocarcinoma with capsule breach during surgery",
      "biomarker_status": "HER2 negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Primary debulking surgery - Total abdominal hysterectomy, bilateral salpingo-oophorectomy, omentectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "Initial CA125 180 at diagnosis",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 decreased to 45 after cycle 2",
          "year": 2024,
          "month": null
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 normalized to 22",
          "year": 2024,
          "month": null
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 peripheral neuropathy affecting fingertips, not impacting daily activities"
      },
      {
        "type": "examination_finding",
        "value": "Well healed surgical wounds with no concerning features"
      },
      {
        "type": "examination_finding",
        "value": "Normal cardiorespiratory examination"
      },
      {
        "type": "investigation_finding",
        "value": "Hemoglobin 115 g/L, neutrophils 2.8, platelets 245"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IC1 ovarian cancer post-surgery, responding well to adjuvant chemotherapy with normalizing tumor markers and good tolerability"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 peripheral neuropathy and well-controlled nausea"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 4 carboplatin AUC5 and paclitaxel 175mg/m2"
      },
      {
        "type": "planned_investigation",
        "value": "CT chest/abdomen/pelvis after cycle 6 to assess end of treatment response"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic prior to cycle 5 in three weeks"
      }
    ]
  }
}