{
  "content": "Diagnosis:\tHigh grade serous carcinoma of ovary, FIGO Stage IIIC\n\nManagement:\tPrimary debulking surgery March 2023\n\t\tAdjuvant carboplatin/paclitaxel completed August 2023\n\t\tMaintenance olaparib commenced September 2023\n\nHistology:\tHigh grade serous carcinoma with extensive peritoneal involvement\n\t\tATM mutation positive, HRD score 42 (positive)\n\nCurrent Situation:\tDisease progression on maintenance therapy\n\nI reviewed [redacted name] today who unfortunately presents with concerning symptoms suggesting disease progression. She reports increasing abdominal distension over the past 3 weeks with early satiety and has lost 4kg in weight. She describes new onset right-sided abdominal pain requiring regular breakthrough analgesia, and her mobility has declined significantly due to fatigue and discomfort. Her performance status has deteriorated from 1 to 2-3.\n\nOn examination, there is obvious ascites with shifting dullness and a palpable mass in the right upper quadrant measuring approximately 6cm. CA125 has risen significantly from 45 to 389 over the past 6 weeks. CT scan performed urgently last week shows multiple new peritoneal deposits, the largest measuring 6.8cm in the right upper quadrant, with moderate volume ascites and new small volume pleural effusions bilaterally. There is also evidence of partial small bowel obstruction.\n\nI have discussed these findings in detail with [redacted name] and her daughter. Given the progression on olaparib maintenance therapy just 4 months after completing first-line treatment, this represents platinum-resistant disease. We have discussed treatment options including second-line weekly paclitaxel with bevacizumab. I have explained the aims of treatment being to control symptoms and hopefully improve quality of life, while being realistic about prognosis.\n\nI have arranged urgent paracentesis for symptom relief and will commence weekly paclitaxel 80mg/m2 with bevacizumab 10mg/kg every 2 weeks once ascites is drained. We will monitor her renal function carefully given the risk of compression. I have also referred to the palliative care team for additional support with symptom management. We will review her weekly during treatment with regular CA125 monitoring and CT reassessment after 3 cycles.",
  "output": {
    "primary_cancer": {
      "site": "ovary",
      "year": 2023,
      "month": 3,
      "metastases": "extensive peritoneal deposits, bilateral pleural effusions",
      "other_stage": "FIGO Stage IIIC",
      "histopathology_status": "High grade serous carcinoma",
      "biomarker_status": "ATM mutation positive, HRD score 42 (positive)",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Primary debulking surgery",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant carboplatin/paclitaxel",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed carboplatin/paclitaxel adjuvant therapy",
          "year": 2023,
          "month": 8
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started maintenance olaparib",
          "year": 2023,
          "month": 9
        },
        {
          "type": "laboratory_finding",
          "value": "CA125 risen from 45 to 389 over 6 weeks",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows multiple new peritoneal deposits up to 6.8cm, ascites, bilateral pleural effusions, partial small bowel obstruction",
          "year": 2024,
          "month": 1
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 2-3"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal distension with early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided abdominal pain requiring regular breakthrough analgesia"
      },
      {
        "type": "examination_finding",
        "value": "Obvious ascites with shifting dullness and palpable 6cm mass in right upper quadrant"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Declined mobility due to fatigue and discomfort"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IIIC ovarian cancer with early progression on maintenance therapy. Disease progression with peritoneal disease and ascites causing significant symptoms"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on olaparib maintenance therapy with new peritoneal deposits and rising CA125"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence weekly paclitaxel 80mg/m2 with bevacizumab 10mg/kg every 2 weeks after paracentesis"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status with reduced mobility and increasing symptoms"
      },
      {
        "type": "planned_investigation",
        "value": "CT reassessment after 3 cycles with regular CA125 monitoring"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during treatment, referred to palliative care team for symptom management"
      }
    ]
  }
}