{
  "content": "Diagnosis:\tGranulosa cell tumor of ovary, Stage IC\n\nManagement:\tTotal abdominal hysterectomy and bilateral salpingo-oophorectomy March 2024\n\nHistology:\tAdult-type granulosa cell tumor, FOXL2 mutation positive, Stage IC (capsule rupture)\n\nCurrent Situation:\tFirst post-operative follow-up\n\nI reviewed [redacted name] today following her surgery in March. She has made an excellent recovery from her operation with good wound healing. Her post-operative pain has now resolved and she has returned to most normal activities. She denies any new symptoms of concern. Her appetite is good and weight stable.\n\nOn examination today, her abdomen is soft and non-tender with well-healed surgical scars. There is no clinical evidence of disease recurrence.\n\nHer latest blood tests from 15/4/24 show inhibin B has normalized to <10 pg/mL (pre-operative level 285 pg/mL). Other tumor markers remain normal.\n\nGiven her Stage IC disease with capsular rupture, we have discussed the role of adjuvant chemotherapy. However, as she has had complete surgical resection with normalized tumor markers and no high-risk features, we have agreed to proceed with surveillance alone at this stage.\n\nThe plan is for 3-monthly follow-up with inhibin B measurements and annual CT scanning. I will see her again in clinic in July 2024 with repeat blood tests. She understands to contact us sooner if she develops any concerning symptoms in the interim.",
  "output": {
    "primary_cancer": {
      "site": "ovary",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "",
      "other_stage": "Stage IC",
      "histopathology_status": "Adult-type granulosa cell tumor with capsule rupture",
      "biomarker_status": "FOXL2 mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Total abdominal hysterectomy and bilateral salpingo-oophorectomy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Pre-operative inhibin B 285 pg/mL",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Inhibin B normalized to <10 pg/mL",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Abdomen soft and non-tender with well-healed surgical scars, no clinical evidence of disease recurrence"
      },
      {
        "type": "investigation_finding",
        "value": "Inhibin B <10 pg/mL, other tumor markers normal"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IC granulosa cell tumor of ovary post complete surgical resection. Excellent post-operative recovery with normalized tumor markers"
      },
      {
        "type": "update_to_treatment",
        "value": "Decision for surveillance alone rather than adjuvant chemotherapy given complete resection and absence of high-risk features"
      },
      {
        "type": "planned_investigation",
        "value": "3-monthly inhibin B measurements and annual CT scanning"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic July 2024 with repeat blood tests"
      }
    ]
  }
}