{
  "content": "Diagnosis:\tLocally advanced pancreatic adenocarcinoma with peritoneal disease\n\nI reviewed [redacted name] today for assessment during cycle 4 of modified FOLFIRINOX chemotherapy. The initial staging CT from March 2024 showed a 4.2cm pancreatic body mass with peritoneal nodules and local vascular involvement. Histology confirmed moderately differentiated adenocarcinoma, MAP2K4 mutation detected on molecular profiling.\n\nShe has managed the first three cycles with reasonable tolerance though requiring a 20% dose reduction of irinotecan from cycle 3 due to grade 2 diarrhea. Current ECOG performance status is 1. Her main symptoms are fatigue and intermittent abdominal discomfort, both improved since starting treatment. Weight has stabilized at 62kg.\n\nRecent CT scan on 15/5/24 shows stable disease by RECIST criteria with minor reduction in peritoneal disease volume. CA19-9 has dropped from 1200 to 450.\n\nOn examination today, abdomen is soft with mild epigastric tenderness but no new concerns. Blood tests show stable liver function and adequate marrow reserve for continued treatment.\n\nThe plan is to proceed with cycle 4 modified FOLFIRINOX maintaining the current dose reduction. We will arrange CT reassessment after cycle 6. Follow-up appointment in 2 weeks with blood tests.",
  "output": {
    "primary_cancer": {
      "site": "pancreas, body",
      "year": 2024,
      "month": 3,
      "metastases": "peritoneal nodules with local vascular involvement",
      "other_stage": "Stage IIIA",
      "histopathology_status": "moderately differentiated adenocarcinoma",
      "biomarker_status": "MAP2K4 mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT shows 4.2cm pancreatic body mass with peritoneal nodules and local vascular involvement",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Initial CA19-9 1200",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started modified FOLFIRINOX chemotherapy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "20% dose reduction of irinotecan from cycle 3 due to grade 2 diarrhea",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable disease with minor reduction in peritoneal disease volume",
          "year": 2024,
          "month": 5
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 decreased to 450",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 1"
      },
      {
        "type": "current_symptom",
        "value": "fatigue and intermittent abdominal discomfort, both improved since starting treatment"
      },
      {
        "type": "examination_finding",
        "value": "abdomen soft with mild epigastric tenderness"
      },
      {
        "type": "investigation_finding",
        "value": "stable liver function and adequate marrow reserve"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Locally advanced pancreatic cancer showing stable disease on modified FOLFIRINOX with minor biochemical response"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease by RECIST with minor reduction in peritoneal disease and CA19-9 decrease from 1200 to 450"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 diarrhea requiring 20% irinotecan dose reduction"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing modified FOLFIRINOX with maintained 20% irinotecan dose reduction"
      },
      {
        "type": "planned_investigation",
        "value": "CT reassessment after cycle 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with blood tests"
      }
    ]
  }
}