{
  "content": "Diagnosis:\tSolid pseudopapillary neoplasm of pancreatic tail\n\nManagement:\t15 Jan 2024 Laparoscopic distal pancreatectomy and splenectomy\n\nHistology:\tSolid pseudopapillary neoplasm, 2.8cm, R0 resection margins, no lymphovascular invasion, pT1N0M0. Beta-catenin nuclear positive on immunohistochemistry.\n\nCurrent Situation:\tPost-operative follow-up\n\nI reviewed [redacted name] today following her recent surgery for pancreatic solid pseudopapillary neoplasm. She has made an excellent recovery from her laparoscopic distal pancreatectomy and splenectomy performed on 15th January 2024. Her post-operative course was uncomplicated apart from mild pancreatic enzyme insufficiency which has responded well to Creon supplementation.\n\nShe reports good energy levels and has returned to her usual activities. Her appetite is normal and her weight is stable at 65kg. She denies any abdominal pain or gastrointestinal symptoms. Her wound sites have healed well.\n\nOn examination today, her laparoscopic port sites are well-healed with no evidence of infection or herniation. Her abdomen is soft and non-tender with no masses or organomegaly. Her performance status is 0.\n\nI have reviewed her post-operative imaging which shows no evidence of residual disease. Given the complete resection and the typically indolent nature of solid pseudopapillary neoplasms, her prognosis is excellent. No adjuvant therapy is indicated.\n\nThe plan is for surveillance with 6-monthly CT imaging for the first two years, then annually thereafter. She has been prescribed lifelong penicillin V and received post-splenectomy vaccinations. I will arrange her next CT scan for July 2024 and see her afterwards with the results. She understands to contact us sooner if she develops any concerning symptoms.",
  "output": {
    "primary_cancer": {
      "site": "pancreas tail",
      "year": 2024,
      "month": 1,
      "metastases": null,
      "tnm_stage": "pT1N0M0",
      "histopathology_status": "Solid pseudopapillary neoplasm, 2.8cm, R0 resection margins, no lymphovascular invasion",
      "biomarker_status": "Beta-catenin nuclear positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Laparoscopic distal pancreatectomy and splenectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "other_progress_or_event",
          "value": "Post-operative course complicated by mild pancreatic enzyme insufficiency, responsive to Creon",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Post-operative imaging shows no evidence of residual disease",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "examination_finding",
        "value": "Well-healed laparoscopic port sites, soft non-tender abdomen, no masses or organomegaly"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Good energy levels, returned to usual activities"
      },
      {
        "type": "current_symptom",
        "value": "No abdominal pain or gastrointestinal symptoms, stable weight at 65kg"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Successfully resected pancreatic solid pseudopapillary neoplasm with excellent post-operative recovery. No evidence of residual disease."
      },
      {
        "type": "latest_treatment_response",
        "value": "Complete surgical resection achieved with R0 margins"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Mild pancreatic enzyme insufficiency managed with Creon supplementation"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan scheduled for July 2024"
      },
      {
        "type": "follow_up_referral",
        "value": "6-monthly CT imaging for first two years, then annually. Review after next CT scan"
      }
    ]
  }
}