{
  "content": "Diagnosis:\tMetastatic pancreatic neuroendocrine tumor with liver metastases\n\nI reviewed [redacted name] today for assessment during cycle 4 of capecitabine and temozolomide combination therapy. The treatment was initiated following disease progression on previous lanreotide therapy in January 2024. Initial molecular profiling had identified a SMARCA4 mutation.\n\nShe has tolerated the treatment reasonably well with grade 1 palmar-plantar syndrome and mild fatigue, managing to maintain her work schedule with some adjustments. Her main symptoms of intermittent abdominal discomfort and early satiety have improved since starting treatment. Performance status remains 0.\n\nRecent CT scan from 15/4/24 shows stable disease with no growth in the pancreatic primary (stable at 4.2cm) and stable appearance of the multiple liver metastases (largest lesion in segment 7 unchanged at 3.1cm). Chromogranin A has decreased from 325 to 240 (normal range <100).\n\nOn examination today, abdomen is soft and non-tender with no hepatomegaly. Blood tests show stable liver function and adequate bone marrow reserve for continued treatment.\n\nThe plan is to continue with cycle 5 of capecitabine/temozolomide at full dose. We will arrange repeat CT imaging after cycle 6 to assess response. Review in clinic in 3 weeks with blood tests.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "year": 2024,
      "month": 1,
      "metastases": "liver metastases",
      "histopathology_status": "neuroendocrine tumor",
      "biomarker_status": "SMARCA4 mutation",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_change",
          "value": "Disease progression on lanreotide therapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started capecitabine and temozolomide combination therapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows pancreatic primary 4.2cm with multiple liver metastases, largest 3.1cm in segment 7",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Chromogranin A decreased from 325 to 240",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 0"
      },
      {
        "type": "current_symptom",
        "value": "Improved intermittent abdominal discomfort and early satiety"
      },
      {
        "type": "examination_finding",
        "value": "Abdomen soft and non-tender with no hepatomegaly"
      },
      {
        "type": "investigation_finding",
        "value": "Stable liver function and adequate bone marrow reserve"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic pancreatic NET with stable disease on capecitabine/temozolomide after progression on lanreotide. Tolerating treatment well with clinical benefit."
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on CT with unchanged primary tumor and liver metastases"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 palmar-plantar syndrome and mild fatigue"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing with cycle 5 capecitabine/temozolomide at full dose"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan after cycle 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in 3 weeks with blood tests"
      }
    ]
  }
}