{
  "content": "Diagnosis:\tPancreatic serous cystadenocarcinoma, BAP1 loss on immunohistochemistry\n\nI reviewed [redacted name] today following recent diagnosis of pancreatic serous cystadenocarcinoma. The diagnosis was established following investigation of an incidental 3.2cm pancreatic tail mass found during ultrasound for gallstone disease in March 2024. Subsequent CT demonstrated a well-circumscribed mass with characteristic microcystic appearance. EUS-guided biopsy on 15/4/24 confirmed serous cystadenocarcinoma with BAP1 loss on immunohistochemistry.\n\nStaging CT chest/abdomen/pelvis and MRI pancreas completed 20/4/24 show no evidence of metastatic disease. The primary lesion measures 3.2 x 2.8cm and appears resectable with no vascular involvement.\n\nIn her past medical history, she has well-controlled hypertension on amlodipine and recently diagnosed gallstone disease awaiting cholecystectomy. She takes no other regular medications and has no drug allergies.\n\nShe is otherwise fit and well with PS 0, working full-time as an accountant. She lives with her husband and has good family support.\n\nI have discussed the case with our hepatobiliary surgical colleagues. Given the resectable nature of the disease, we recommend proceeding with distal pancreatectomy. I have explained the diagnosis, prognosis and management plan to [redacted name] who understands and wishes to proceed with surgery. She will be reviewed in the surgical clinic next week for formal consent and surgical planning.\n\nWe will arrange follow-up in the oncology clinic 6 weeks post-surgery to review histology and discuss any role for adjuvant therapy based on final pathological staging.",
  "output": {
    "primary_cancer": {
      "site": "pancreas, tail",
      "year": 2024,
      "month": 3,
      "metastases": "no evidence of metastatic disease",
      "histopathology_status": "serous cystadenocarcinoma",
      "biomarker_status": "BAP1 loss on immunohistochemistry",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Incidental 3.2cm pancreatic tail mass found on ultrasound",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "EUS-guided biopsy confirmed serous cystadenocarcinoma with BAP1 loss",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "Staging CT and MRI show 3.2 x 2.8cm resectable primary lesion with no vascular involvement, no metastatic disease",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 0"
      },
      {
        "type": "comorbidity",
        "value": "well-controlled hypertension"
      },
      {
        "type": "comorbidity",
        "value": "gallstone disease awaiting cholecystectomy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed localized pancreatic serous cystadenocarcinoma. Resectable disease suitable for surgical management."
      },
      {
        "type": "update_to_treatment",
        "value": "Recommended to proceed with distal pancreatectomy"
      },
      {
        "type": "follow_up_referral",
        "value": "Surgical clinic review next week for consent and planning, oncology follow-up 6 weeks post-surgery"
      }
    ]
  }
}