{
  "content": "Diagnosis:\tMixed neuroendocrine-ductal carcinoma of pancreas\n\nManagement:\t2023 Oct - Commenced FOLFIRINOX\n\t\t2024 Jan - Changed to Capecitabine/Temozolomide\n\t\t2024 Mar - Disease progression\n\nHistology:\tMixed neuroendocrine-ductal carcinoma, Ki67 60%, PDL1 positive (CPS 80)\n\nCurrent Situation:\tProgressive disease; consideration of clinical trial\n\nI reviewed [redacted name] today who attended with his wife to discuss disease progression and treatment options. Unfortunately, recent imaging has confirmed progressive disease with growth of both hepatic and peritoneal metastases despite second-line therapy. The largest liver lesion in segment 7 has increased from 4.2cm to 6.8cm, and there is new ascites. His CA19-9 has risen significantly from 2400 to 8900.\n\nHe has experienced increasing symptoms over the past 3 weeks, with worsening abdominal discomfort requiring increased doses of opioid analgesia. His appetite has declined significantly with early satiety, and he has lost 4kg since last review. His performance status has deteriorated to ECOG 2. On examination today, there is moderate ascites with shifting dullness and tender hepatomegaly extending 4cm below the costal margin.\n\nWe have discussed the situation in detail, including the poor response to both FOLFIRINOX (stopped due to grade 3 peripheral neuropathy) and subsequent Capecitabine/Temozolomide. Given the high Ki67 and PDL1 positivity, I have discussed the option of the phase II NOTABLE trial of Nivolumab combined with Temozolomide. [redacted name] is keen to consider trial participation if eligible.\n\nI have arranged urgent screening investigations including cardiac echo, HIV testing, and hepatitis screen as per protocol. We will also perform therapeutic paracentesis next week to manage his symptoms. I have increased his oxycodone to 40mg BD and added metoclopramide for nausea.\n\nWe will review him next week with screening results to confirm trial eligibility. I have also made a referral to palliative care for additional symptom support. His wife has my direct contact details should his symptoms worsen before next week's appointment.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "year": 2023,
      "metastases": "liver metastases, peritoneal metastases with ascites",
      "tnm_stage": "T3N1M1",
      "histopathology_status": "Mixed neuroendocrine-ductal carcinoma",
      "biomarker_status": "Ki67 60%, PDL1 positive (CPS 80)",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced FOLFIRINOX",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_change",
          "value": "FOLFIRINOX discontinued due to grade 3 peripheral neuropathy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Changed to Capecitabine/Temozolomide",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 risen from 2400 to 8900",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Progressive disease with growth of hepatic and peritoneal metastases, largest liver lesion increased from 4.2cm to 6.8cm, new ascites",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 2"
      },
      {
        "type": "current_symptom",
        "value": "Worsening abdominal discomfort requiring increased opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety with 4kg weight loss"
      },
      {
        "type": "examination_finding",
        "value": "Moderate ascites with shifting dullness and tender hepatomegaly extending 4cm below costal margin"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Mixed neuroendocrine-ductal pancreatic cancer with liver and peritoneal metastases. Disease progression on second-line therapy with clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on Capecitabine/Temozolomide with growing metastases and rising CA19-9"
      },
      {
        "type": "update_to_treatment",
        "value": "Increased oxycodone to 40mg BD and added metoclopramide for nausea"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 2 with increasing symptoms and weight loss"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent screening investigations including cardiac echo, HIV testing, and hepatitis screen for trial eligibility"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week with screening results; referral made to palliative care"
      }
    ]
  }
}