{
  "content": "Diagnosis:\tLocally advanced pancreatic ductal adenocarcinoma with peritoneal metastases\n\nManagement:\t15 Jan 2024 - Commenced FOLFIRINOX\n\t\t12 Mar 2024 - Changed to Gemcitabine/Nab-paclitaxel due to toxicity\n\nHistology:\tModerately differentiated pancreatic ductal adenocarcinoma, NRG1 fusion positive\n\nCurrent Situation:\tDisease progression on second-line chemotherapy\n\nI reviewed [redacted name] today following recent CT imaging which unfortunately shows disease progression with increasing peritoneal disease and new ascites despite 3 cycles of second-line Gemcitabine/Nab-paclitaxel. The scan shows multiple new peritoneal deposits with the largest measuring 3.2cm, compared to 1.8cm previously. There is also new moderate volume ascites.\n\nShe has experienced significant clinical deterioration over the past 4 weeks with increasing abdominal discomfort, early satiety, and weight loss of 4kg. Her CA19-9 has risen from 1200 to 3500. She requires regular opioid analgesia for pain control.\n\nGiven the identification of an NRG1 fusion on molecular testing of her original biopsy, I have discussed her case with the Phase I team. She would be eligible for the [redacted name] trial of targeted NRG1 inhibition. I have explained the rationale, procedure, and potential benefits/risks of trial participation. She is keen to proceed with screening.\n\nI have arranged urgent trial screening investigations including cardiac echo, CT chest, and required blood tests. She will be reviewed in the Phase I clinic next week once these results are available. In the meantime, I have prescribed additional analgesics and arranged peritoneal drainage with interventional radiology for symptom control. The acute oncology team are aware and will provide additional support as needed.\n\nWe will see her next week in Phase I clinic to confirm trial eligibility and proceed with consent if appropriate. I have also made a referral to palliative care for additional symptom management support.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "year": 2024,
      "metastases": "peritoneal metastases with ascites",
      "other_stage": "Stage IIIB",
      "histopathology_status": "moderately differentiated ductal adenocarcinoma",
      "biomarker_status": "NRG1 fusion positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced FOLFIRINOX chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Changed to Gemcitabine/Nab-paclitaxel due to toxicity",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression with increasing peritoneal deposits (largest 3.2cm from 1.8cm) and new ascites",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 increased from 1200 to 3500",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Increasing abdominal discomfort requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Weight loss of 4kg over past 4 weeks"
      },
      {
        "type": "investigation_finding",
        "value": "CT shows multiple new peritoneal deposits and moderate volume ascites"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Pancreatic cancer with peritoneal metastases showing disease progression on second-line chemotherapy. NRG1 fusion positive making patient eligible for targeted therapy trial."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on Gemcitabine/Nab-paclitaxel with increasing peritoneal disease and rising CA19-9"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing current chemotherapy, planned transition to NRG1 inhibitor trial therapy"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent cardiac echo, CT chest, and blood tests for trial screening"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in Phase I clinic next week for trial eligibility assessment and consent"
      }
    ]
  }
}