{
  "content": "Diagnosis:\tPancreatic neuroendocrine carcinoma (Ki67 25%, SSTR2 positive)\n\nManagement:\t2023 Dec - Whipple's procedure\n\t\t2024 Jan-Mar - 3 cycles cisplatin/etoposide\n\nHistology:\tGrade 3 neuroendocrine carcinoma, pT4N1M0 (AJCC Stage IIIB)\n\t\tR1 resection margins, lymphovascular invasion present\n\nCurrent Situation:\tDisease progression on chemotherapy\n\nI reviewed [redacted name] today to discuss recent imaging findings. Unfortunately, the CT performed on 15/4/24 has shown disease progression with new liver lesions (largest 2.8cm in segment 7) and local recurrence in the pancreatic bed measuring 4.2cm. This is despite completing 3 cycles of cisplatin and etoposide, which she has found increasingly challenging to tolerate with cumulative fatigue, grade 3 neutropenia requiring GCSF support, and peripheral neuropathy affecting both hands and feet.\n\nHer performance status has declined to ECOG 2, primarily due to fatigue and early satiety from the growing pancreatic mass. She has lost 4kg in the past month despite dietetic support and pancreatic enzyme replacement. On examination today, there is tender hepatomegaly and a palpable epigastric mass.\n\nGiven the disease progression and challenging toxicity profile, we have discussed changing treatment strategy. The high SSTR2 expression on her original histology makes her a good candidate for peptide receptor radionuclide therapy (PRRT). I have explained the procedure, potential benefits, and side effects of PRRT, particularly the risk of myelosuppression and renal impairment. [redacted name] is keen to proceed with this approach.\n\nI have arranged urgent nuclear medicine assessment for PRRT suitability, including Gallium-68 DOTATATE PET-CT and baseline renal function testing. We will also repeat chromogranin A and 24-hour urinary 5-HIAA. I have prescribed additional analgesia (oxycodone MR 10mg BD) and increased her pancreatic enzyme replacement dose. She will be reviewed in clinic in 2 weeks with all results, when we can proceed with PRRT if appropriate. The acute oncology team are aware of her situation and I have provided emergency contact details.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "year": 2023,
      "month": 12,
      "metastases": "new liver lesions, local recurrence in pancreatic bed",
      "tnm_stage": "pT4N1M0",
      "other_stage": "Stage IIIB",
      "histopathology_status": "Grade 3 neuroendocrine carcinoma, R1 resection margins, lymphovascular invasion present",
      "biomarker_status": "SSTR2 positive, Ki67 25%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Whipple's procedure",
          "year": 2023,
          "month": 12
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started cisplatin/etoposide chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 3 cycles cisplatin/etoposide with grade 3 neutropenia requiring GCSF support",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows new liver lesions (largest 2.8cm) and local recurrence in pancreatic bed (4.2cm)",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2 due to fatigue and early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety from pancreatic mass"
      },
      {
        "type": "current_symptom",
        "value": "Peripheral neuropathy affecting hands and feet"
      },
      {
        "type": "examination_finding",
        "value": "Tender hepatomegaly and palpable epigastric mass"
      },
      {
        "type": "quality_of_life_finding",
        "value": "4kg weight loss in past month despite dietetic support"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Grade 3 pancreatic neuroendocrine carcinoma showing progression after surgery and chemotherapy. Disease progression with new liver metastases and local recurrence, requiring change in treatment strategy to PRRT."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on CT with new liver lesions and pancreatic bed recurrence"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 neutropenia requiring GCSF support, peripheral neuropathy, and cumulative fatigue"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing cisplatin/etoposide due to progression, planning switch to PRRT"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged Gallium-68 DOTATATE PET-CT, renal function, chromogranin A and 24-hour urinary 5-HIAA"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in 2 weeks with results to proceed with PRRT if appropriate"
      }
    ]
  }
}