{
  "content": "Diagnosis:\tPancreatic head adenocarcinoma - oncocytic variant\n\tDiagnosed March 2024 following investigation of obstructive jaundice\n\tStaging CT and PET-CT confirm T3N1M0 disease\n\tKRAS wild type on molecular testing\n?\n[redacted name] is a 68-year-old gentleman who presented with painless jaundice and 4kg weight loss over 2 months. Initial CT demonstrated a 3.8cm pancreatic head mass with peripancreatic lymphadenopathy. He underwent ERCP with metallic stent placement on 15/3/24 with good resolution of biliary obstruction. Subsequent EUS-guided biopsy confirmed oncocytic variant of pancreatic adenocarcinoma. Staging investigations including CT chest/abdomen/pelvis and PET-CT show no evidence of distant metastatic disease.\n?\nIn his past medical history, he has well-controlled type 2 diabetes on metformin, and hypertension. His current medications include metformin 1g BD, ramipril 5mg OD, and recent addition of creon with meals. He lives with his wife and maintains good mobility with regular walking despite recent weight loss. Performance status is 1.\n?\nOn examination today, he is slightly icteric but improving. Abdomen is soft with mild epigastric tenderness but no palpable masses. Recent blood tests show improving liver function with bilirubin now 35 (peak 220).\n?\nI have discussed his case at our HPB MDT. Given his good performance status and absence of metastatic disease, he is suitable for neoadjuvant FOLFIRINOX chemotherapy with a view to subsequent surgical resection if good response. I have explained the treatment plan, including common and serious side effects of chemotherapy. He will require baseline cardiac echo and hearing assessment before starting treatment.\n?\nThe plan is to commence FOLFIRINOX chemotherapy next week. We will arrange PICC line insertion and provide chemotherapy education. Review in 3 weeks with blood tests before cycle 2.",
  "output": {
    "primary_cancer": {
      "site": "pancreas head",
      "year": 2024,
      "month": 3,
      "metastases": "peripancreatic lymphadenopathy",
      "tnm_stage": "T3N1M0",
      "histopathology_status": "oncocytic variant of pancreatic adenocarcinoma",
      "biomarker_status": "KRAS wild type",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT shows 3.8cm pancreatic head mass with peripancreatic lymphadenopathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "ERCP with metallic stent placement for biliary obstruction",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "EUS-guided biopsy confirms oncocytic variant of pancreatic adenocarcinoma",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Staging CT chest/abdomen/pelvis and PET-CT show no distant metastatic disease",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes on metformin"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "current_symptom",
        "value": "Mild epigastric tenderness"
      },
      {
        "type": "current_symptom",
        "value": "Slight icterus, improving"
      },
      {
        "type": "investigation_finding",
        "value": "Improving liver function with bilirubin now 35 (peak 220)"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed pancreatic head cancer with nodal involvement, post-ERCP stenting with improving jaundice. Suitable for neoadjuvant chemotherapy approach."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence FOLFIRINOX chemotherapy next week"
      },
      {
        "type": "planned_investigation",
        "value": "Requires baseline cardiac echo and hearing assessment"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 3 weeks with blood tests before cycle 2"
      }
    ]
  }
}