{
  "content": "I reviewed [redacted name] today who attended with his wife following recent admission to [redacted name] Hospital with worsening abdominal pain and jaundice. As you are aware, he was diagnosed with metastatic pancreatic adenocarcinoma in January 2024 following presentation with obstructive jaundice. Initial staging demonstrated a 4.8cm pancreatic head mass with extensive peripancreatic lymphadenopathy, multiple bilobar liver metastases, and three pulmonary nodules in the right lung measuring up to 1.2cm. Molecular profiling identified an ARID1A mutation (VAF 32.4%), though the full NGS report shows several artifacts requiring repeat testing.?\n?\nHe initially underwent ERCP and metal stent insertion on 15th January 2024, followed by commencement of modified FOLFIRINOX chemotherapy on 30th January. He completed 4 cycles with reasonable tolerance, though requiring 20% dose reduction from cycle 3 due to grade 2 peripheral neuropathy. Unfortunately, restaging CT on 15th April showed disease progression with increase in size of liver metastases and development of new peritoneal deposits. His CA19-9 has also risen significantly from 1200 to 4500.?\n?\nHe was switched to weekly gemcitabine/nab-paclitaxel on 22nd April but has only managed one cycle due to declining performance status and recurrent hospital admissions with pain and biliary sepsis. His most recent admission was complicated by acute kidney injury requiring temporary cessation of his regular medications.?\n?\nOn review today, his performance status has deteriorated to ECOG 3. He reports severe epigastric and right upper quadrant pain requiring regular breakthrough oxycodone in addition to his usual MST. He has lost a further 4kg in weight despite nutritional supplements and describes early satiety and occasional vomiting. He is notably more jaundiced with bilirubin now 120 μmol/L compared to 40 μmol/L two weeks ago.?\n?\nOn examination, he is cachectic and clearly uncomfortable. There is marked tenderness in the epigastrium with a palpable mass and hepatomegaly extending 6cm below the costal margin. Chest examination reveals reduced air entry at the right base with dullness to percussion.?\n?\nGiven his deteriorating clinical status and clear disease progression, I have had a detailed discussion with [redacted name] and his wife about focusing on symptom control rather than further systemic therapy. I have referred him to the palliative care team for urgent review and pain management optimization. His MST has been increased to 60mg BD with immediate release oxycodone increased to 20mg PRN. I have also prescribed metoclopramide for nausea and dexamethasone 4mg daily to help with appetite.?\n?\nHe will be reviewed by the palliative care team tomorrow and I have arranged follow-up in our supportive care clinic next week. His wife has my direct contact details should they need urgent advice before then.",
  "output": {
    "primary_cancer": {
      "site": "pancreas, head",
      "year": 2024,
      "month": 1,
      "metastases": "multiple bilobar liver metastases, right lung nodules, peritoneal deposits",
      "tnm_stage": "T4N2M1",
      "histopathology_status": "ductal adenocarcinoma",
      "biomarker_status": "ARID1A mutation (VAF 32.4%)",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "ERCP and metal stent insertion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started modified FOLFIRINOX chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "20% dose reduction of FOLFIRINOX due to grade 2 peripheral neuropathy after cycle 2",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT showing disease progression with increased liver metastases and new peritoneal deposits",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 risen from 1200 to 4500",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started weekly gemcitabine/nab-paclitaxel",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued systemic therapy due to clinical deterioration",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3"
      },
      {
        "type": "current_symptom",
        "value": "Severe epigastric and right upper quadrant pain requiring regular breakthrough oxycodone"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety and occasional vomiting"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic, epigastric tenderness with palpable mass and hepatomegaly 6cm below costal margin"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry at right base with dullness to percussion"
      },
      {
        "type": "investigation_finding",
        "value": "Bilirubin increased from 40 to 120 μmol/L over two weeks"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic pancreatic cancer with rapid disease progression through two lines of chemotherapy. Significant clinical deterioration with transition to palliative care."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on gemcitabine/nab-paclitaxel with clinical deterioration"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued systemic therapy, increased MST to 60mg BD and oxycodone 20mg PRN"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with significant weight loss and reduced mobility"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care team review tomorrow and supportive care clinic next week"
      }
    ]
  }
}