{
  "content": "Diagnosis:\tSpindle cell carcinoma of pancreatic tail\n\nManagement:\t15 Jan 2024 Distal pancreatectomy and splenectomy\n\t\t1 Mar 2024 - 15 Apr 2024 Adjuvant gemcitabine\n\nHistology:\tSpindle cell carcinoma, CD117 positive, stage pT2N0M0, R0 resection margins\n\nCurrent Situation:\tEnd of adjuvant chemotherapy review\n\nI was very pleased to review [redacted name] following completion of adjuvant gemcitabine chemotherapy. She has shown remarkable resilience throughout her treatment journey and has maintained excellent spirits despite the challenges of post-operative recovery and chemotherapy side effects. Her post-operative course was initially complicated by a minor wound infection which resolved well with oral antibiotics. During chemotherapy, she experienced moderate fatigue and grade 1 nausea which were well managed with supportive medications. She developed grade 2 neutropenia after cycle 2 which required a one-week delay, but subsequent cycles were delivered at full dose with primary GCSF prophylaxis.\n\nOn review today, she reports feeling significantly better with improving energy levels. Her appetite has returned to normal and she has regained 2kg of weight over the past month. The surgical wound has healed well with no concerns. She has experienced some post-splenectomy fatigue but this is gradually improving. Her performance status has returned to 0 and she has resumed her regular walking routine.\n\nGiven the completion of planned adjuvant therapy and her excellent recovery, we will now move to a surveillance program. I have arranged a baseline CT scan for next month and will see her in clinic with the results. Subsequently, we will continue with 3-monthly reviews for the first year with alternating CT scans. I have provided written information about post-splenectomy care and arranged appropriate vaccinations through her GP. She understands to contact us if any new concerns arise in the interim.",
  "output": {
    "primary_cancer": {
      "site": "pancreas tail",
      "year": 2024,
      "month": 1,
      "metastases": "",
      "tnm_stage": "pT2N0M0",
      "histopathology_status": "Spindle cell carcinoma, R0 resection margins",
      "biomarker_status": "CD117 positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Distal pancreatectomy and splenectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "other_progress_or_event",
          "value": "Post-operative wound infection requiring oral antibiotics",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant gemcitabine",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "One week delay due to grade 2 neutropenia after cycle 2, subsequent cycles with GCSF prophylaxis",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed adjuvant gemcitabine chemotherapy",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "current_symptom",
        "value": "Post-splenectomy fatigue, gradually improving"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Resumed regular walking routine"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Completed adjuvant treatment for resected pancreatic tail spindle cell carcinoma. Good recovery from surgery and chemotherapy with improving functional status"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Experienced moderate fatigue and grade 1 nausea during chemotherapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Regained 2kg weight, improved energy levels, returned to normal appetite"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline CT scan next month"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic with CT results, then 3-monthly reviews with alternating CT scans for first year"
      }
    ]
  }
}