{
  "content": "I reviewed [redacted name] today who attended with his wife following recent admission to [redacted name] Hospital with progressive abdominal pain and ascites. As you know, he was diagnosed with metastatic pancreatic adenocarcinoma in January 2024 following investigation of obstructive jaundice. Initial staging demonstrated a 4.8cm pancreatic head mass with multiple liver metastases and peritoneal deposits. Molecular profiling identified CCNE1 amplification but no actionable mutations.\n\nHe commenced first-line modified FOLFIRINOX in February 2024 and completed 4 cycles with reasonable tolerance despite grade 2 peripheral neuropathy and fatigue. Unfortunately, restaging CT in April 2024 showed disease progression with increasing size of liver metastases and new ascites. He switched to second-line gemcitabine/nab-paclitaxel but developed significant neutropenia requiring two hospital admissions and GCSF support.\n\nHis recent admission was complicated by grade 3 infection requiring broad-spectrum antibiotics. CT during admission showed further disease progression with new peritoneal deposits and moderate volume ascites. His performance status has declined significantly to ECOG 3, and he now requires assistance with most activities of daily living. He reports increasing abdominal pain requiring regular oxycodone, early satiety, and progressive fatigue.\n\nGiven his deteriorating clinical status and aggressive disease progression, we had a detailed discussion about focusing on symptom management rather than further systemic therapy. He and his wife understand this decision. I have referred him to the palliative care team for ongoing support and symptom management. They will arrange community support and help optimize his pain control.\n\nHis current medications include: MST 30mg BD, Oxycodone 5mg PRN, Metoclopramide 10mg TDS, and Dexamethasone 4mg OD. Blood results show declining liver function with bilirubin 45, ALT 156, ALP 445. His CA19-9 has increased from 1200 to 4500 over the past month.\n\nThe plan is for best supportive care with regular palliative care review. I have organized weekly district nurse visits and arranged for urgent installation of a hospital bed at home. We will continue dexamethasone 4mg daily and uptitrate analgesia as needed. I will review him again in two weeks in our supportive care clinic, sooner if needed.",
  "output": {
    "primary_cancer": {
      "site": "pancreas, head",
      "year": 2024,
      "month": 1,
      "metastases": "multiple liver metastases, peritoneal deposits, ascites",
      "tnm_stage": "T3N2M1",
      "histopathology_status": "ductal adenocarcinoma",
      "biomarker_status": "CCNE1 amplification, no actionable mutations",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Presented with obstructive jaundice",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Initial staging shows 4.8cm pancreatic head mass with multiple liver metastases and peritoneal deposits",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line modified FOLFIRINOX",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 4 cycles FOLFIRINOX with grade 2 peripheral neuropathy and fatigue",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows disease progression with increasing liver metastases and new ascites",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started second-line gemcitabine/nab-paclitaxel",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Developed significant neutropenia requiring hospital admissions and GCSF support",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 increased from 1200 to 4500",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, requires assistance with most activities of daily living"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal pain requiring regular oxycodone"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety and progressive fatigue"
      },
      {
        "type": "investigation_finding",
        "value": "Declining liver function with bilirubin 45, ALT 156, ALP 445"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic pancreatic cancer with rapid progression through two lines of chemotherapy. Now deteriorating with declining performance status and increasing symptoms."
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 infection requiring broad-spectrum antibiotics, significant neutropenia with gemcitabine/nab-paclitaxel"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing systemic therapy, switching to best supportive care"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status to ECOG 3, requiring increased care support"
      },
      {
        "type": "follow_up_referral",
        "value": "Referred to palliative care team, weekly district nurse visits arranged"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in supportive care clinic in two weeks"
      }
    ]
  }
}