{
  "content": "Many thanks for referring [redacted name] who I met today with her husband and daughter. She is a 62 year old lady who has unfortunately been diagnosed with small cell carcinoma of the pancreatic tail with bone metastases.?\n?\nHer symptoms began approximately 3 months ago with progressive upper abdominal pain radiating to her back, associated with significant weight loss of 12kg and increasing fatigue. She initially presented to her GP with these symptoms and was referred for an ultrasound scan which showed a pancreatic mass. Subsequent CT demonstrated a 6.8cm mass in the tail of pancreas with multiple bone metastases affecting the thoracic spine, ribs, and pelvis. A CT-guided biopsy on 15 March 2024 confirmed small cell carcinoma with strong CD56 positivity.?\n?\nShe has experienced a significant decline in her mobility over the past month due to bone pain, particularly affecting T8 vertebra, and now requires a wheelchair for anything more than short distances. Her performance status has deteriorated from 1 to 3 over this period. She is managing oral intake but describes early satiety and occasional nausea.?\n?\nIn her past medical history, she has well-controlled type 2 diabetes on metformin, and hypothyroidism on levothyroxine. She had a previous cholecystectomy in 2015. She has never smoked and drinks minimal alcohol.?\n?\nShe lives with her husband who has taken time off work to help care for her. Her daughter lives nearby and provides additional support. She worked as a primary school teacher but has been unable to work for the past 2 months due to her symptoms.?\n?\nOn examination today, she appears cachectic with marked muscle wasting. There is tenderness in the left upper quadrant with a palpable mass. Spinal examination reveals point tenderness over T8. Neurological examination shows no focal deficits but she has reduced mobility due to pain.?\n?\nI have discussed her case in detail with our team. Given the aggressive nature of small cell carcinoma and her deteriorating performance status, we recommend urgent commencement of combination chemotherapy with carboplatin and etoposide. I have explained the aims of treatment are to improve her symptoms and hopefully extend her life, though we cannot cure the cancer. We have discussed common side effects including fatigue, nausea, risk of neutropenic sepsis, and hair loss.?\n?\nWe have arranged urgent MRI spine to fully assess the thoracic vertebral metastases and will consider palliative radiotherapy depending on findings. She has been started on regular oxycodone for pain control with immediate effect.?\n?\nShe will be admitted to our ward tomorrow to commence chemotherapy, allowing close monitoring of her condition and response to treatment. Our palliative care team will review her during admission to optimize symptom control.?",
  "output": {
    "primary_cancer": {
      "site": "pancreas tail",
      "year": 2024,
      "month": 3,
      "metastases": "multiple bone metastases affecting thoracic spine, ribs, and pelvis",
      "histopathology_status": "small cell carcinoma",
      "biomarker_status": "CD56 strong positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Ultrasound showed pancreatic mass",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT demonstrated 6.8cm mass in tail of pancreas with multiple bone metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "CT-guided biopsy confirmed small cell carcinoma with strong CD56 positivity",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 3, deteriorated from PS 1 over past month"
      },
      {
        "type": "current_symptom",
        "value": "Progressive upper abdominal pain radiating to back"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety and occasional nausea"
      },
      {
        "type": "current_symptom",
        "value": "Bone pain particularly affecting T8 vertebra requiring wheelchair for mobility"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes on metformin"
      },
      {
        "type": "comorbidity",
        "value": "Hypothyroidism on levothyroxine"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with marked muscle wasting, tender left upper quadrant mass, point tenderness over T8"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Unable to work for past 2 months, requires wheelchair for anything more than short distances"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed metastatic small cell carcinoma of pancreas with rapid deterioration and poor performance status. Planned for urgent inpatient chemotherapy with palliative intent."
      },
      {
        "type": "update_to_treatment",
        "value": "Started on regular oxycodone for pain control"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant functional decline with deterioration from PS 1 to PS 3 over past month"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI spine to assess thoracic vertebral metastases"
      },
      {
        "type": "follow_up_referral",
        "value": "Admission tomorrow for chemotherapy initiation and palliative care team review"
      }
    ]
  }
}