{
  "content": "Diagnosis:\tIntraductal papillary mucinous neoplasm (IPMN) of pancreas\n\tIncidental finding on CT abdomen performed 15 March 2024\n\tMRI pancreas with MRCP 28 March 2024 confirms 2.1cm branch duct IPMN in pancreatic body\n\tEUS-FNA cytology 10 April 2024 - low grade dysplasia, GNAS mutation detected\n?\n[redacted name] is a 68-year-old gentleman who was referred following the incidental finding of a pancreatic cyst on CT performed for investigation of non-specific abdominal pain. The CT demonstrated a 2.1cm cystic lesion in the body of pancreas, with subsequent MRI/MRCP confirming features consistent with branch duct IPMN. There are no high-risk features on imaging, with no solid components or mural nodules. The main pancreatic duct measures 3mm in diameter.\n?\nEndoscopic ultrasound with FNA was performed on 10/4/24, showing low-grade dysplasia on cytology. Molecular analysis has detected a GNAS mutation, supporting the diagnosis of IPMN. Serum CA19-9 is within normal range at 15 U/ml.\n?\nI have discussed the diagnosis and management approach with [redacted name]. Given the size <3cm, absence of high-risk features, and low-grade dysplasia, I have recommended surveillance rather than surgical resection at this stage. We will arrange follow-up MRI in 6 months, with annual surveillance thereafter if stable. I have provided written information about IPMNs and symptoms that should prompt earlier review.\n?\nThe plan is for MRI pancreas with MRCP in October 2024, followed by clinic review. I have also referred [redacted name] to our specialist pancreatic nurse for ongoing support and education.",
  "output": {
    "primary_cancer": {
      "site": "pancreas, body",
      "year": 2024,
      "month": 3,
      "tnm_stage": "T1N0M0",
      "histopathology_status": "branch duct IPMN with low grade dysplasia",
      "biomarker_status": "GNAS mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Incidental 2.1cm pancreatic cyst found on CT abdomen",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI/MRCP confirms 2.1cm branch duct IPMN in pancreatic body, main pancreatic duct 3mm, no high-risk features",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "EUS-FNA shows low grade dysplasia, GNAS mutation detected",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Serum CA19-9 within normal range at 15 U/ml",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "No high-risk features on imaging, no solid components or mural nodules"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Incidental finding of branch duct IPMN with low grade dysplasia. No high risk features requiring immediate intervention."
      },
      {
        "type": "update_to_treatment",
        "value": "Recommended surveillance rather than surgical resection due to size <3cm, absence of high-risk features, and low-grade dysplasia"
      },
      {
        "type": "planned_investigation",
        "value": "MRI pancreas with MRCP in October 2024"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinic review after MRI in October 2024, referral to specialist pancreatic nurse"
      }
    ]
  }
}