{
  "content": "Many thanks for referring [redacted name], who I reviewed today accompanied by his wife and daughter. This 62-year-old gentleman has unfortunately been diagnosed with locally advanced pancreatic cancer following a 4-month history of progressive epigastric pain, jaundice, and significant fatigue.\n\nInitial CT imaging on March 15th 2024 revealed a 4.8cm mass in the head of pancreas with involvement of the superior mesenteric vein and encasement of the gastroduodenal artery. There was also evidence of significant biliary obstruction. He underwent ERCP with metallic stent placement on March 20th which has improved his jaundice. Subsequent EUS-guided biopsy confirmed adenosquamous carcinoma. Molecular profiling has detected a TP53 mutation and SMAD4 loss. Staging investigations including PET-CT and MRI liver completed last week show no evidence of distant metastatic disease, though there are several suspicious regional lymph nodes.\n\nIn terms of his current status, he describes ongoing epigastric discomfort requiring regular oramorph, though this has improved somewhat since the biliary stenting. His appetite remains poor and he is struggling with early satiety. He continues to work part-time as an accountant but is finding this increasingly challenging due to fatigue. His performance status is ECOG 2.\n\nHis past medical history includes type 2 diabetes, previously well-controlled but with recent deterioration in glycaemic control, and hypertension. Current medications include metformin, gliclazide, ramipril, and regular oramorph for pain. He lives with his wife who provides excellent support, and their daughter is a nurse which has been particularly helpful in coordinating his recent care.\n\nOn examination today, he is comfortable at rest but appears fatigued. There is mild epigastric tenderness but no palpable mass. Jaundice is improving though still evident. Cardiorespiratory examination is unremarkable.\n\nI have had a lengthy discussion with [redacted name] and his family about management options. Given the locally advanced nature of his disease with vascular involvement, I have explained that upfront surgery is not currently possible. However, I believe he would be suitable for FOLFIRINOX chemotherapy with the aim of downstaging his disease. I have explained this would involve 2-monthly cycles initially, with CT assessment of response after 4 cycles. I have discussed the significant side effects including risk of neutropenic sepsis, peripheral neuropathy, and fatigue.\n\nWe have arranged for his chemotherapy port insertion next week. He will see our specialist nurse for chemotherapy teaching and I have prescribed prophylactic antibiotics and anti-emetics. We will also arrange urgent diabetic review given his recent glycaemic instability. I have referred him to our dietitian and our pancreatic specialist nurse will provide ongoing support.\n\nThe plan is to commence FOLFIRINOX next Thursday, and I will review him weekly during his first cycle. I have also made a referral to our palliative care team for optimisation of his pain management. We will discuss his case at next week's HPB MDT meeting.",
  "output": {
    "primary_cancer": {
      "site": "pancreas head",
      "year": 2024,
      "month": 3,
      "metastases": "suspicious regional lymph nodes",
      "tnm_stage": null,
      "other_stage": "Stage III",
      "histopathology_status": "adenosquamous carcinoma",
      "biomarker_status": "TP53 mutation and SMAD4 loss",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT shows 4.8cm pancreatic head mass with superior mesenteric vein involvement and gastroduodenal artery encasement, biliary obstruction",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "ERCP with metallic stent placement for biliary obstruction",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "EUS-guided biopsy confirms adenosquamous carcinoma",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular profiling shows TP53 mutation and SMAD4 loss",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT and MRI liver show no distant metastases, suspicious regional nodes",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes with recent poor control"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "current_symptom",
        "value": "Epigastric discomfort requiring regular oramorph"
      },
      {
        "type": "current_symptom",
        "value": "Poor appetite with early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Fatigue"
      },
      {
        "type": "examination_finding",
        "value": "Mild epigastric tenderness, improving jaundice, no palpable mass"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed locally advanced pancreatic adenosquamous carcinoma with vascular involvement. Not currently surgically resectable, planned for FOLFIRINOX chemotherapy with aim of downstaging."
      },
      {
        "type": "update_to_treatment",
        "value": "Arranged chemotherapy port insertion and FOLFIRINOX to commence next Thursday"
      },
      {
        "type": "planned_investigation",
        "value": "CT assessment after 4 cycles of chemotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during first cycle of chemotherapy, urgent diabetic review, dietitian referral, palliative care referral for pain management"
      }
    ]
  }
}