{
  "content": "Diagnosis:\tAcinar cell carcinoma of pancreas, stage T2N0M0\n\nI reviewed [redacted name] in follow-up clinic today following completion of adjuvant FOLFIRINOX chemotherapy in March 2024. She has made an excellent recovery from her Whipple's procedure performed on 15 December 2023, which showed a completely excised 3.2cm acinar cell carcinoma with clear margins and no lymph node involvement. Molecular analysis confirmed microsatellite stable status.\n\nShe has now fully recovered from the effects of chemotherapy, with resolution of previous grade 1 peripheral neuropathy. Her appetite has improved significantly and she has regained 3kg of weight over the past month. She has returned to work part-time and is gradually increasing her activity levels.\n\nRecent CT scan on 1 May 2024 shows no evidence of disease recurrence. Blood tests including CA19-9 remain within normal range.\n\nThe plan is to continue regular surveillance with 3-monthly CT scans for the first year. I have arranged her next scan for August 2024 and will see her in clinic afterwards with the results. She understands to contact us sooner if she develops any new concerning symptoms.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "year": 2023,
      "month": 12,
      "metastases": null,
      "tnm_stage": "T2N0M0",
      "histopathology_status": "acinar cell carcinoma, 3.2cm, completely excised with clear margins",
      "biomarker_status": "Microsatellite stable",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Whipple's procedure, completely excised 3.2cm acinar cell carcinoma with clear margins and no lymph node involvement",
          "year": 2023,
          "month": 12
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant FOLFIRINOX chemotherapy",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed adjuvant FOLFIRINOX chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT scan shows no evidence of disease recurrence",
          "year": 2024,
          "month": 5
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 within normal range",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "quality_of_life_finding",
        "value": "Returned to work part-time with gradually increasing activity levels"
      },
      {
        "type": "current_symptom",
        "value": "Resolution of previous grade 1 peripheral neuropathy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Post-operative pancreatic cancer patient who has completed adjuvant chemotherapy. Currently showing good recovery with no evidence of recurrence"
      },
      {
        "type": "latest_treatment_response",
        "value": "No evidence of disease recurrence on CT scan, normal CA19-9"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Improved appetite with 3kg weight gain over past month"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan arranged for August 2024"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic after CT scan in August 2024"
      }
    ]
  }
}