{
  "content": "Diagnosis:\tMixed ductal-neuroendocrine carcinoma of pancreas with liver and peritoneal metastases\n\nManagement:\t15 Jan 2024 Started FOLFIRINOX chemotherapy\n\t\t12 Mar 2024 Changed to Cisplatin-Etoposide due to disease progression\n\nHistology:\tMixed ductal-neuroendocrine carcinoma, Ki67 65%, STK11 mutation positive\n\nCurrent Situation:\tDisease progression on second-line therapy\n\nI reviewed [redacted name] today following his recent admission with increasing abdominal pain and early satiety. Unfortunately, his latest CT scan from 15/4/24 shows clear evidence of disease progression with increasing size and number of liver metastases, new peritoneal deposits, and enlargement of the primary pancreatic mass from 4.2cm to 5.8cm. His CA19-9 has risen significantly from 1200 to 4500.\n\nHe initially commenced FOLFIRINOX in January 2024 but showed primary progression after 4 cycles, leading to a switch to Cisplatin-Etoposide in March given the neuroendocrine component. Unfortunately, he has continued to progress through second-line therapy with deteriorating symptoms. His performance status has declined to ECOG 2-3, spending more than 50% of the day resting. He requires regular breakthrough analgesia and has lost a further 4kg in weight over the last month despite nutritional supplements.\n\nOn examination today, there is marked hepatomegaly extending 6cm below the costal margin with moderate ascites. His albumin has dropped to 28 and his bilirubin is now rising at 45. After careful discussion with [redacted name] and his wife about his poor prognosis, we have agreed to discontinue systemic anti-cancer therapy and focus on symptom control. I have made an urgent referral to the palliative care team and arranged weekly community nurse reviews. He has been prescribed additional breakthrough analgesia and anti-emetics, and I have organized urgent drainage of his ascites.\n\nWe will continue to support [redacted name] through our acute oncology service as needed, and I have provided direct contact details. The palliative care team will arrange ongoing follow-up and support at home.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "year": 2024,
      "metastases": "liver metastases, peritoneal deposits",
      "tnm_stage": "T3N1M1",
      "histopathology_status": "Mixed ductal-neuroendocrine carcinoma, Ki67 65%",
      "biomarker_status": "STK11 mutation positive",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started FOLFIRINOX chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Changed to Cisplatin-Etoposide due to disease progression after 4 cycles of FOLFIRINOX",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 risen from 1200 to 4500",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows increasing liver metastases, new peritoneal deposits, primary pancreatic mass enlarged from 4.2cm to 5.8cm",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued systemic anti-cancer therapy due to disease progression and declining performance status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 2-3, spending more than 50% of day resting"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal pain requiring regular breakthrough analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety"
      },
      {
        "type": "current_symptom",
        "value": "Weight loss of 4kg over last month despite nutritional supplements"
      },
      {
        "type": "examination_finding",
        "value": "Hepatomegaly extending 6cm below costal margin with moderate ascites"
      },
      {
        "type": "investigation_finding",
        "value": "Albumin dropped to 28, bilirubin rising at 45"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Mixed ductal-neuroendocrine pancreatic cancer with liver and peritoneal metastases. Progressive disease through two lines of therapy with significant clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on second-line Cisplatin-Etoposide with increasing metastases and worsening symptoms"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinued all systemic anti-cancer therapy, switching to palliative care approach"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 2-3 with increasing symptoms and declining liver function"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team with weekly community nurse reviews"
      }
    ]
  }
}