{
  "content": "Diagnosis:\tMetastatic pancreatic adenocarcinoma\n\nManagement:\tGemcitabine/Nab-paclitaxel chemotherapy\n\tPembrolizumab added at cycle 3\n\nHistology:\tPoorly differentiated pancreatic adenocarcinoma\n\tPD-L1 CPS 80\n\nCurrent Situation:\tDisease progression on triple therapy\n\nI reviewed [redacted name] today following recent CT imaging. Unfortunately, this shows clear evidence of disease progression with increasing size of the pancreatic primary (now measuring 6.8cm from 5.2cm), new peritoneal deposits, and increase in size and number of liver metastases. The largest liver lesion in segment 7 has increased from 3.2cm to 4.8cm. Serum CA19-9 has risen significantly from 2800 to 4500.\n\nHer performance status has declined to ECOG 3, spending more than 50% of time in bed. She reports worsening abdominal pain requiring increased opioid doses, with breakthrough pain despite MS Contin 90mg BD. There is also increasing fatigue, early satiety, and new onset jaundice with bilirubin 68. On examination, there is marked peripheral edema, tender hepatomegaly, and shifting dullness suggesting ascites.\n\nI have discussed these findings with [redacted name] and her daughter. Given the clear evidence of disease progression and declining performance status, I have recommended discontinuing systemic anti-cancer therapy. I have made an urgent referral to the palliative care team and arranged community support. We will arrange ascitic drainage if symptoms worsen.\n\nI have prescribed additional breakthrough analgesia and anti-emetics. The palliative care team will review medications and symptom control. We will continue to provide support through our specialist nursing team.",
  "output": {
    "primary_cancer": {
      "site": "pancreas",
      "histopathology_status": "poorly differentiated adenocarcinoma",
      "tnm_stage": "T4N2M1",
      "biomarker_status": "PD-L1 CPS 80",
      "metastases": "liver metastases, peritoneal deposits",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started on Gemcitabine/Nab-paclitaxel chemotherapy"
        },
        {
          "type": "treatment_systemic_change",
          "value": "Pembrolizumab added at cycle 3"
        },
        {
          "type": "anatomical_finding",
          "value": "Pancreatic primary increased from 5.2cm to 6.8cm, new peritoneal deposits, increase in liver metastases with segment 7 lesion grown from 3.2cm to 4.8cm"
        },
        {
          "type": "laboratory_finding",
          "value": "CA19-9 increased from 2800 to 4500"
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing systemic anti-cancer therapy due to disease progression and declining performance status"
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, spending more than 50% of time in bed"
      },
      {
        "type": "current_symptom",
        "value": "Worsening abdominal pain requiring increased opioids, breakthrough pain despite MS Contin 90mg BD"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue and early satiety"
      },
      {
        "type": "current_symptom",
        "value": "New onset jaundice with bilirubin 68"
      },
      {
        "type": "examination_finding",
        "value": "Marked peripheral edema, tender hepatomegaly, and shifting dullness suggesting ascites"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced pancreatic cancer with liver and peritoneal metastases. Disease progression on triple therapy with significant clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with increasing size of primary tumor and metastases, rising CA19-9"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing all systemic anti-cancer therapy due to disease progression and poor performance status"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 3 with increasing symptoms and new jaundice"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and arrangement of community support"
      }
    ]
  }
}