{
  "content": "Diagnosis:\tMetastatic pancreatic large cell neuroendocrine carcinoma with liver and bone metastases\n\nInitial diagnosis March 2024 with diffuse pancreatic mass. NSE markedly elevated at 150 ng/mL, chromogranin A within normal range. Staging CT and subsequent PET-CT confirmed multiple bilobar liver metastases and widespread bone involvement including T8 vertebral body.\n\nI reviewed [redacted name] today for assessment during cycle 2 of carboplatin/etoposide chemotherapy. Unfortunately, she has experienced significant deterioration since commencing treatment three weeks ago. Her performance status has declined from ECOG 1 to ECOG 3, now spending approximately 70% of the day in bed due to profound fatigue and worsening bone pain. She describes new onset severe nausea and has lost 4kg despite maximal antiemetic support with ondansetron and dexamethasone.\n\nHer blood tests today show concerning trends with haemoglobin dropping to 89 g/L (previously 115) and platelets at 85 x 10^9/L. Neutrophils remain adequate at 2.1 x 10^9/L on GCSF support. Liver function shows rising bilirubin at 45 μmol/L and ALT 156 U/L. Latest NSE has increased to 180 ng/mL suggesting disease progression.\n\nOn examination today, there is new tender hepatomegaly extending 4cm below the costal margin. Marked tenderness noted over T8 vertebra. No clinical evidence of spinal cord compression but urgent MRI spine has been arranged given the new severe localised pain.\n\nGiven the significant clinical deterioration and rising markers suggesting disease progression, I have made the difficult decision to discontinue carboplatin/etoposide. I have discussed this extensively with [redacted name] and her daughter today. We will arrange urgent CT assessment to confirm progression and consider second line options including temozolomide if her performance status improves with supportive care.\n\nI have referred urgently to the palliative care team for review this week, increased her opioid analgesia, and prescribed additional antiemetics including levomepromazine. She has been given the acute oncology helpline number and advised to contact us immediately if symptoms worsen. Will review again next week with scan results and palliative care team input to discuss further management options.",
  "output": {
    "primary_cancer": {
      "site": "pancreas diffuse",
      "year": 2024,
      "month": 3,
      "metastases": "multiple bilobar liver metastases, widespread bone involvement including T8 vertebral body",
      "other_stage": "Stage III",
      "histopathology_status": "large cell neuroendocrine carcinoma",
      "biomarker_status": "NSE elevated at 150 ng/mL, chromogranin A normal",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Initial diagnosis with diffuse pancreatic mass, multiple liver metastases and bone involvement on CT and PET-CT",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "NSE markedly elevated at 150 ng/mL, chromogranin A within normal range",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started carboplatin/etoposide chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "NSE increased to 180 ng/mL suggesting disease progression",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued carboplatin/etoposide due to clinical deterioration and disease progression",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, spending 70% of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Severe nausea despite maximal antiemetic support"
      },
      {
        "type": "current_symptom",
        "value": "Worsening bone pain, particularly over T8 vertebra"
      },
      {
        "type": "examination_finding",
        "value": "New tender hepatomegaly extending 4cm below costal margin"
      },
      {
        "type": "investigation_finding",
        "value": "Hb 89 g/L, platelets 85 x 10^9/L, neutrophils 2.1 x 10^9/L, bilirubin 45 μmol/L, ALT 156 U/L"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic pancreatic neuroendocrine carcinoma with rapid clinical deterioration and disease progression during first-line chemotherapy"
      },
      {
        "type": "latest_treatment_response",
        "value": "Clinical and biochemical disease progression with rising NSE and new symptoms"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Severe fatigue, nausea, and cytopenia requiring treatment discontinuation"
      },
      {
        "type": "update_to_treatment",
        "value": "Carboplatin/etoposide discontinued, increased opioid analgesia and antiemetics including levomepromazine"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in performance status from ECOG 1 to ECOG 3"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI spine and CT assessment arranged"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care team referral, oncology review next week with scan results"
      }
    ]
  }
}