{
  "content": "Diagnosis:\tPeritoneal mesothelioma, Stage IIIA\n\tDiagnosed March 2023 following diagnostic laparoscopy and biopsy\n\tCalretinin positive, WT-1 positive on immunohistochemistry\n\nI reviewed [redacted name] in follow-up clinic today following completion of 6 cycles of first-line cisplatin and pemetrexed chemotherapy in December 2023. His most recent CT scan performed on 15 March 2024 shows stable disease with no significant change in the omental and peritoneal disease compared to the end-of-treatment scan. The previously noted small volume ascites has resolved.\n\nHe completed his planned chemotherapy with good tolerance, achieving disease stabilization. His CA-125 level has remained stable at 42 (previously 45). We discussed surveillance strategy, and I have arranged for a repeat CT scan in 3 months' time with clinical review. He understands to contact us sooner if he develops any new symptoms or concerns. We have provided written information about mesothelioma support services.\n\nThe plan is to continue with 3-monthly surveillance, with consideration of second-line treatment options if there is evidence of disease progression in the future.",
  "output": {
    "primary_cancer": {
      "site": "peritoneal",
      "year": 2023,
      "month": 3,
      "metastases": "omental and peritoneal disease",
      "other_stage": "Stage IIIA",
      "histopathology_status": "mesothelioma",
      "biomarker_status": "Calretinin positive, WT-1 positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "diagnostic laparoscopy and biopsy",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "commenced cisplatin and pemetrexed chemotherapy",
          "year": 2023,
          "month": 6
        },
        {
          "type": "treatment_systemic_change",
          "value": "completed 6 cycles of cisplatin and pemetrexed chemotherapy",
          "year": 2023,
          "month": 12
        },
        {
          "type": "laboratory_finding",
          "value": "CA-125 stable at 42 (previously 45)",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable omental and peritoneal disease, resolution of ascites",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "CT 15/03/24 shows stable disease with no significant change in omental and peritoneal disease"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IIIA peritoneal mesothelioma with stable disease following completion of first-line chemotherapy. Currently under surveillance with stable imaging and markers."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease stabilization achieved with chemotherapy, maintained on recent imaging"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat CT scan in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinical review with CT results in 3 months"
      }
    ]
  }
}