{
  "content": "Diagnosis:\tMalignant pleural mesothelioma (epithelioid type)\n\nStaging:\tT4N0M0 with bilateral pleural disease\n\tDiagnosed March 2024\n\tBiomarkers: MTAP loss, PD-L1 TPS 80%\n\nCurrent Situation:\tInitial oncology assessment\n\nI reviewed [redacted name] today following his recent diagnosis of malignant pleural mesothelioma. He initially presented in January 2024 with progressive breathlessness and right-sided chest pain. Initial chest x-ray showed a large right pleural effusion, and subsequent CT thorax demonstrated irregular pleural thickening with nodularity affecting both pleural surfaces, more extensive on the right. Video-assisted thoracoscopic surgery (VATS) and pleural biopsy on 15/03/24 confirmed epithelioid mesothelioma.\n\nHe reports worsening breathlessness over the past 2 weeks, now occurring with minimal exertion (ECOG PS 2). He has ongoing right-sided chest pain requiring regular opioid analgesia, and his weight has dropped by 6kg over 3 months. Night sweats are becoming more frequent.\n\nCT staging completed on 25/03/24 shows extensive bilateral pleural disease with mediastinal involvement and early chest wall invasion on the right (T4N0M0). No distant metastases identified. PET-CT on 28/03/24 confirms no evidence of extra-thoracic disease.\n\nOn examination today, there is significantly reduced air entry on the right with dull percussion note to mid-zone. Oxygen saturations 92% on room air. Performance status has deteriorated to ECOG 2-3.\n\nMolecular testing has identified MTAP loss and high PD-L1 expression (TPS 80%). Given his deteriorating clinical status and molecular profile, I have recommended first-line combination immunotherapy with ipilimumab/nivolumab. We discussed the treatment schedule, potential side effects, and likely benefits in detail.\n\nI have arranged urgent CT-guided pleural drain insertion for symptomatic management, requested baseline cardiac echo and pulmonary function tests, and booked chemotherapy unit assessment for next week. We will commence immunotherapy as soon as pleural drainage is optimized. I will review him again in one week with all results.\n\nThe case will be re-discussed at next week's mesothelioma MDT to confirm treatment approach. I have also referred to our specialist mesothelioma nurse and palliative care team for additional support.",
  "output": {
    "primary_cancer": {
      "site": "pleural, bilateral",
      "year": 2024,
      "month": 3,
      "metastases": "bilateral pleural disease with mediastinal involvement and chest wall invasion",
      "tnm_stage": "T4N0M0",
      "histopathology_status": "epithelioid mesothelioma",
      "biomarker_status": "MTAP loss, PD-L1 TPS 80%",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial presentation with progressive breathlessness and right pleural effusion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "VATS and pleural biopsy confirming epithelioid mesothelioma",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows extensive bilateral pleural disease with mediastinal involvement and chest wall invasion",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT confirms no evidence of extra-thoracic disease",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular testing identifies MTAP loss and PD-L1 TPS 80%",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2-3, deteriorating"
      },
      {
        "type": "current_symptom",
        "value": "Breathlessness on minimal exertion"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided chest pain requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Night sweats"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry on right with dull percussion note to mid-zone"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturations 92% on room air"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed bilateral pleural mesothelioma with rapid clinical deterioration. Initial assessment for first-line immunotherapy."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence ipilimumab/nivolumab immunotherapy combination"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorating performance status with 6kg weight loss over 3 months"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged CT-guided pleural drain insertion, cardiac echo and pulmonary function tests"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in one week after pleural drainage and chemotherapy unit assessment"
      }
    ]
  }
}