{
  "content": "Diagnosis:\n\nMetastatic prostate cancer with widespread bone metastases\n\nPrevious medical history:\nType 2 diabetes\nHypertension\nOsteoarthritis of right hip\n\nCurrent medications:\nMetformin 1g bd\nRamipril 5mg od\nAspirin 75mg od\n\nCurrent situation:\nPSA rising to 234 from 156 over 6 weeks despite ADT\nBRCA2 mutation detected on germline testing\n\nI reviewed [redacted name] today to discuss participation in the TRIUMPH-2 trial of Olaparib in combination with standard ADT for metastatic castration-resistant prostate cancer. He was diagnosed in January 2024 with widespread bone metastatic disease on presentation. Initial PSA was 456. Bone scan showed multiple sites of involvement in thoracic and lumbar spine, pelvis, and bilateral femora. He commenced on Leuprorelin and Bicalutamide with initial good PSA response to nadir of 156, but now showing biochemical progression despite castrate testosterone levels.\n\nHe has completed all screening investigations including CT chest/abdomen/pelvis showing no visceral metastases, and MRI spine confirming multiple bone metastases but no cord compression. Baseline bloods including FBC, U&Es, LFTs are all within acceptable trial parameters. ECG shows normal sinus rhythm. ECOG performance status is 1.\n\nI have discussed the trial protocol in detail, including the randomisation process between Olaparib and placebo, both in combination with ongoing ADT. We reviewed the schedule of visits, additional blood tests and scans required, and potential side effects of treatment. [redacted name] demonstrates good understanding and is keen to participate. He has been provided with written information and contact details for the trial team.\n\nThe plan is to complete trial registration and baseline assessments next week. He will continue current ADT. We have arranged bone protection with monthly denosumab to commence at trial registration visit. I have provided emergency contact information and symptoms requiring urgent review. Follow-up will be as per trial protocol with first treatment visit scheduled for 15 April 2024.",
  "output": {
    "primary_cancer": {
      "site": "prostate, multifocal",
      "year": 2024,
      "month": 1,
      "metastases": "widespread bone metastases affecting thoracic spine, lumbar spine, pelvis, bilateral femora",
      "other_stage": "Stage IV",
      "histopathology_status": "acinar adenocarcinoma",
      "biomarker_status": "BRCA2 mutation positive",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Initial PSA 456",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Bone scan showing multiple metastases in thoracic and lumbar spine, pelvis, and bilateral femora",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Leuprorelin and Bicalutamide",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "PSA nadir of 156",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "PSA rising to 234 despite castrate testosterone levels",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest/abdomen/pelvis shows no visceral metastases, MRI spine confirms multiple bone metastases without cord compression",
          "year": 2024,
          "month": 3
        },
        {
          "type": "clinical_trial_update",
          "value": "Screened for TRIUMPH-2 trial of Olaparib with ADT for metastatic castration-resistant disease",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Osteoarthritis of right hip"
      },
      {
        "type": "performance_status",
        "value": "ECOG performance status 1"
      },
      {
        "type": "investigation_finding",
        "value": "Normal ECG showing sinus rhythm"
      },
      {
        "type": "investigation_finding",
        "value": "FBC, U&Es, LFTs within trial parameters"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic prostate cancer with initial response to ADT now showing biochemical progression. BRCA2 positive patient being enrolled in TRIUMPH-2 trial of Olaparib."
      },
      {
        "type": "latest_treatment_response",
        "value": "PSA rising from 156 to 234 over 6 weeks despite castrate testosterone levels"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing current ADT, planned trial registration for Olaparib/placebo randomisation"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline trial assessments scheduled for next week"
      },
      {
        "type": "follow_up_referral",
        "value": "First treatment visit scheduled for 15 April 2024 as per trial protocol"
      }
    ]
  }
}