{
  "content": "Diagnosis:\tMetastatic prostate cancer - osteoclast-rich undifferentiated carcinoma\n\nStage:\t\tT4N1M1b with extensive bone metastases (superscan appearance on bone scan)\n\nBiomarkers:\tPSA risen from 892 to 1240 ng/mL over 4 weeks\n\tGATA2 positive on molecular testing\n\nTreatment:\tAndrogen deprivation therapy since January 2024\n\tDocetaxel chemotherapy commenced March 2024 - stopped after 2 cycles due to deterioration\n\nCurrent Status:\tSignificant clinical deterioration\n\n[redacted name] has unfortunately experienced rapid progression of his prostate cancer despite initial hormone therapy and attempted docetaxel. His performance status has declined from 1 to 3 over six weeks, with increasing bone pain requiring opiate escalation and new onset spinal cord compression symptoms affecting T8-T10 levels. Recent MRI spine confirms epidural disease at these levels with cord compression. His PSA has risen further to 1240 despite castrate testosterone levels.\n\nI have discussed his case at today's MDT. Given his rapid progression through first-line treatment and declining performance status, we have agreed to proceed with urgent radiotherapy to T8-T10 (20Gy in 5 fractions) starting tomorrow. We will then consider cabazitaxel as second-line therapy if his performance status improves following radiotherapy and steroids. He understands the poor prognosis and has been referred to palliative care for additional support. We will review him after completion of radiotherapy in 10 days.\n",
  "output": {
    "primary_cancer": {
      "site": "prostate",
      "year": 2024,
      "month": 1,
      "metastases": "extensive bone metastases with superscan appearance, epidural metastases T8-T10",
      "tnm_stage": "T4N1M1b",
      "histopathology_status": "osteoclast-rich undifferentiated carcinoma",
      "biomarker_status": "GATA2 positive, PSA 1240 ng/mL (rising from 892)",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started on androgen deprivation therapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced docetaxel chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Docetaxel stopped after 2 cycles due to clinical deterioration",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "PSA risen to 1240 despite castrate testosterone levels",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "MRI confirms epidural disease with cord compression at T8-T10",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3 over six weeks"
      },
      {
        "type": "current_symptom",
        "value": "Increasing bone pain requiring opiate escalation"
      },
      {
        "type": "current_symptom",
        "value": "Spinal cord compression symptoms at T8-T10 levels"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Aggressive metastatic prostate cancer with rapid progression through first-line therapy and development of cord compression. Significant clinical deterioration with poor prognosis"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on ADT and docetaxel with rising PSA and new cord compression"
      },
      {
        "type": "update_to_treatment",
        "value": "Docetaxel discontinued due to clinical deterioration"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status from 1 to 3 over six weeks"
      },
      {
        "type": "planned_investigation",
        "value": "Review after completion of radiotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent radiotherapy to T8-T10 starting tomorrow, referred to palliative care, review in 10 days"
      }
    ]
  }
}