{
  "content": "Diagnosis:\tMetastatic prostate cancer with leptomeningeal disease\n\nManagement:\tJuly 2023 - Docetaxel/ADT\n\t\tOctober 2023 - Whole brain radiotherapy\n\t\tJanuary 2024 - Pembrolizumab commenced\n\nHistology:\tPleomorphic giant cell carcinoma, MSI-high, TMB-high\n\nCurrent Situation:\tProgressive neurological deterioration\n\nI reviewed [redacted name] today who attended with his wife and daughter. Unfortunately, his condition has significantly deteriorated since our last review three weeks ago. His neurological symptoms have worsened with new onset of diplopia, increasing confusion, and worsening gait instability. His performance status has declined from ECOG 2 to ECOG 3-4, now spending most of the day in bed or chair.\n\nHis most recent MRI brain from 15/4/24 shows progressive leptomeningeal disease despite two cycles of pembrolizumab, with new areas of enhancement particularly affecting the posterior fossa. His PSA has continued to rise, now at 2456 ng/mL (previously 1892). Blood tests show worsening renal function with creatinine 165 (baseline 98) and hyponatraemia at 131.\n\nOn examination today, he is drowsy but rousable. There is new left-sided facial weakness, bilateral papilloedema, and marked truncal ataxia. He requires two-person assistance for any mobilisation.\n\nI have had a lengthy discussion with [redacted name] and his family regarding the rapid progression of his disease despite immunotherapy. Given his declining performance status and advancing leptomeningeal disease, I have explained that further systemic anti-cancer therapy is unlikely to be beneficial and carries significant risks. We have agreed to transition to best supportive care with focus on symptom management.\n\nI have commenced dexamethasone 8mg BD and increased his pregabalin to 150mg BD for neuropathic symptoms. I have made an urgent referral to our palliative care team and arranged hospital admission for symptom control. The family understands the poor prognosis and wishes to prioritize comfort measures.\n\nI have provided emergency contact numbers and will liaise directly with the palliative care team regarding ongoing management. We will continue to provide support through this difficult time.",
  "output": {
    "primary_cancer": {
      "site": "prostate",
      "year": 2023,
      "histopathology_status": "pleomorphic giant cell carcinoma",
      "biomarker_status": "MSI-high, TMB-high",
      "metastases": "leptomeningeal disease",
      "other_stage": "Stage IVB",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Docetaxel with ADT",
          "year": 2023,
          "month": 7
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Whole brain radiotherapy",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced pembrolizumab",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "PSA increased to 2456 ng/mL from 1892",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows progressive leptomeningeal disease with new posterior fossa enhancement",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued pembrolizumab due to disease progression and declining performance status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated from ECOG 2 to ECOG 3-4, mostly bed/chair bound"
      },
      {
        "type": "current_symptom",
        "value": "Diplopia, confusion, gait instability"
      },
      {
        "type": "examination_finding",
        "value": "Drowsy but rousable, new left-sided facial weakness, bilateral papilloedema, marked truncal ataxia"
      },
      {
        "type": "investigation_finding",
        "value": "Worsening renal function with creatinine 165 (baseline 98) and hyponatraemia 131"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Advanced prostate cancer with progressive leptomeningeal disease. Failed multiple lines of therapy including immunotherapy with rapid clinical deterioration"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on pembrolizumab with worsening neurological symptoms and rising PSA"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline requiring two-person assistance for mobilisation"
      },
      {
        "type": "update_to_treatment",
        "value": "Transitioning to best supportive care, commenced dexamethasone 8mg BD and increased pregabalin to 150mg BD"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and arranged hospital admission for symptom control"
      }
    ]
  }
}