{
  "content": "Diagnosis:\tProstate cancer - lymphoepithelioma-like carcinoma\n\tStage T2cN1M0 with pelvic nodal involvement\n\tPSA 23.4, EBV positive\n\nManagement:\t15 Mar 2024 Commenced on PROSTATIC trial protocol\n\tRandomised to Arm B: Durvalumab + ADT\n\nCurrent situation:\tBaseline assessments completed\n\n[redacted name] attended clinic today for trial registration and baseline assessments. His prostate cancer was diagnosed in January 2024 following elevated PSA, with subsequent biopsy confirming lymphoepithelioma-like carcinoma. MRI and staging CT showed bilateral prostate disease with right external iliac nodal involvement. Given the rare histological subtype and EBV positivity, he was considered for the PROSTATIC trial.\n\nHe has completed all screening investigations including cardiac echo (normal), baseline CT (stable from staging), and required blood tests. Trial eligibility has been confirmed. The protocol requirements, potential side effects, and follow-up schedule have been discussed in detail. He understands the randomisation outcome to Arm B with durvalumab immunotherapy alongside ADT.\n\nHe will commence treatment next week following completion of trial-mandated 7-day safety window. ADT will be initiated today. We will see him weekly for the first month as per protocol requirements, then transition to 3-weekly reviews. The first trial-mandated CT assessment will be at 12 weeks.",
  "output": {
    "primary_cancer": {
      "site": "prostate, bilateral disease",
      "year": 2024,
      "month": 1,
      "metastases": "right external iliac nodal involvement",
      "tnm_stage": "T2cN1M0",
      "histopathology_status": "lymphoepithelioma-like carcinoma",
      "biomarker_status": "PSA 23.4, EBV positive",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Elevated PSA leading to diagnosis",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsy confirms lymphoepithelioma-like carcinoma",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "MRI and CT showing bilateral prostate disease with right external iliac nodal involvement",
          "year": 2024,
          "month": 1
        },
        {
          "type": "clinical_trial_update",
          "value": "Randomised to PROSTATIC trial Arm B: Durvalumab + ADT",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "Normal cardiac echo at baseline"
      },
      {
        "type": "investigation_finding",
        "value": "Baseline CT stable compared to staging scans"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Rare EBV-positive prostate cancer with nodal disease, enrolled in immunotherapy trial"
      },
      {
        "type": "update_to_treatment",
        "value": "To commence ADT today and durvalumab next week after safety window"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review for first month then 3-weekly reviews as per trial protocol"
      }
    ]
  }
}