{
  "content": "Diagnosis:\tMetastatic prostate adenosquamous carcinoma with sarcomatoid differentiation\n\nManagement:\t15 Jan 2024 Commenced Phase II TRANSFORM-2 trial of Pembrolizumab/Docetaxel combination\n\nHistology:\tProstate biopsy Dec 2023 showing adenosquamous carcinoma with sarcomatoid change, PDL1 100%, AR negative\n\nCurrent Situation:\tCycle 3 trial treatment review\n\nI reviewed [redacted name] today who is participating in the TRANSFORM-2 trial. Unfortunately, his disease has shown evidence of progression despite initial stability on trial treatment. He has developed new cutaneous metastases over the past 2 weeks, with three nodules now visible on his anterior chest wall, the largest measuring 3.2cm. These are causing significant pain requiring increased analgesia.\n\nHis performance status has declined to ECOG 2, spending approximately 50% of the day resting. He describes increasing fatigue, reduced appetite, and weight loss of 4kg over the past month. The chest wall pain is partially controlled on modified release morphine 60mg BD, though breakthrough requirements have increased.\n\nBlood tests show rising PSA from 678 to 892 over the past 3 weeks. Liver function remains stable. There is a new normocytic anaemia with Hb 98 g/L. Trial-mandated ECG and troponin remain within normal range.\n\nOn examination, the new cutaneous deposits are tender and erythematous. There is reduced air entry at the right base, though oxygen saturations remain adequate at 96% on air. No new neurological deficits are identified.\n\nI have discussed these findings with the trial team. Given clear clinical and biochemical progression, we will discontinue trial treatment as per protocol. I have explained this to [redacted name] and his wife who attended today. We have discussed moving to standard docetaxel chemotherapy, and I have arranged urgent CT chest/abdomen/pelvis to fully reassess disease extent before commencing this.\n\nThe plan is to review him next week with scan results and to commence docetaxel if appropriate. I have increased his regular morphine to 80mg BD and arranged urgent palliative care review to help optimize symptom control. The trial team will arrange the end-of-trial visit and associated investigations.",
  "output": {
    "primary_cancer": {
      "site": "prostate",
      "year": 2023,
      "month": 12,
      "metastases": "cutaneous metastases on anterior chest wall",
      "tnm_stage": "T4N2M1",
      "histopathology_status": "adenosquamous carcinoma with sarcomatoid differentiation, AR negative",
      "biomarker_status": "PDL1 100%, PSA 892 (rising from 678)",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Prostate biopsy showing adenosquamous carcinoma with sarcomatoid change, PDL1 100%, AR negative",
          "year": 2023,
          "month": 12
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced Phase II TRANSFORM-2 trial of Pembrolizumab/Docetaxel combination",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "PSA rising from 678 to 892 over 3 weeks",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "Development of new cutaneous metastases on anterior chest wall, largest 3.2cm",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing trial treatment due to disease progression",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2, spending approximately 50% of day resting"
      },
      {
        "type": "current_symptom",
        "value": "Significant chest wall pain from cutaneous metastases"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue, reduced appetite, weight loss 4kg over past month"
      },
      {
        "type": "examination_finding",
        "value": "Tender and erythematous cutaneous deposits, reduced air entry right base"
      },
      {
        "type": "investigation_finding",
        "value": "New normocytic anaemia Hb 98 g/L, normal ECG and troponin"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic prostate adenosquamous carcinoma showing progression on TRANSFORM-2 trial with new cutaneous metastases and rising PSA. Deteriorating performance status with increasing pain."
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with new cutaneous metastases and rising PSA despite trial treatment"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing trial treatment, planning to commence standard docetaxel chemotherapy"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration to ECOG PS 2 with increasing pain and fatigue"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent CT chest/abdomen/pelvis to reassess disease extent"
      },
      {
        "type": "follow_up_referral",
        "value": "Review next week with scan results, urgent palliative care review arranged"
      }
    ]
  }
}