{
  "content": "Diagnosis:\tMetastatic neuroendocrine prostate carcinoma with rhabdoid features\n\tInitial diagnosis March 2023\n\tMolecular profile: TP53/RB1/PTEN/CYLD loss\n\tPSA consistently <0.1\n?\n[redacted name] has unfortunately experienced significant clinical deterioration over the past three weeks. Following his initial diagnosis of this rare and aggressive variant of prostate cancer in March 2023, he initially responded well to first-line carboplatin/etoposide chemotherapy, achieving partial response after 4 cycles. However, following completion of 6 cycles in August 2023, surveillance imaging showed early disease progression with new liver lesions.?\n?\nSecond-line treatment with pembrolizumab was commenced in September 2023 but discontinued after 2 cycles due to immune-related hepatitis requiring high-dose steroids. Following recovery, he commenced docetaxel in November 2023, completing 4 cycles with stable disease as best response before developing progressive symptoms in January 2024.?\n?\nHe presented to the Emergency Department last week with severe headaches and ataxia. MRI brain demonstrated multiple dural-based metastases with the largest measuring 3.2cm in the right posterior fossa causing early cerebellar compression. He received urgent dexamethasone and whole brain radiotherapy (20Gy in 5 fractions, completed yesterday).?\n?\nOn review today, his performance status has declined to ECOG 3. He requires wheelchair assistance and reports ongoing headaches (though improved from presentation), severe fatigue, poor appetite with 6kg weight loss over 1 month, and new right-sided chest pain. His wife reports he is sleeping most of the day.?\n?\nOn examination, he is cushingoid from steroids but alert and oriented. There is mild right-sided cerebellar signs with past-pointing and dysdiadochokinesia. Chest examination reveals reduced air entry at the right base with dullness to percussion, suggesting possible pleural effusion.?\n?\nGiven his poor performance status and aggressive disease trajectory despite multiple lines of therapy, I have had a detailed discussion with [redacted name] and his wife about focusing on quality of life and symptom control. They understand and agree with transition to best supportive care. I have made an urgent referral to the palliative care team and arranged community support. He will be reviewed by them tomorrow, and I will maintain oversight of his care with weekly telephone reviews. I have provided emergency contact numbers and educated about red flag symptoms.?\n?\nPlease do not hesitate to contact us if you require any additional information regarding his care.",
  "output": {
    "primary_cancer": {
      "site": "prostate",
      "year": 2023,
      "month": 3,
      "metastases": "multiple dural-based metastases, liver metastases, suspected right pleural effusion",
      "other_stage": "Stage IVB",
      "histopathology_status": "neuroendocrine carcinoma with rhabdoid features",
      "biomarker_status": "TP53/RB1/PTEN/CYLD loss, PSA consistently <0.1",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line carboplatin/etoposide chemotherapy",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 6 cycles carboplatin/etoposide with subsequent progression",
          "year": 2023,
          "month": 8
        },
        {
          "type": "anatomical_finding",
          "value": "New liver lesions detected on surveillance imaging",
          "year": 2023,
          "month": 8
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started second-line pembrolizumab",
          "year": 2023,
          "month": 9
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinued pembrolizumab after 2 cycles due to immune-related hepatitis",
          "year": 2023,
          "month": 9
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started docetaxel chemotherapy",
          "year": 2023,
          "month": 11
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed 4 cycles docetaxel with subsequent progression",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain showed multiple dural metastases with 3.2cm right posterior fossa lesion",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed whole brain radiotherapy 20Gy in 5 fractions",
          "year": 2024,
          "month": 2
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 3, requires wheelchair assistance"
      },
      {
        "type": "current_symptom",
        "value": "Ongoing headaches, severe fatigue, poor appetite with 6kg weight loss over 1 month, right-sided chest pain"
      },
      {
        "type": "examination_finding",
        "value": "Cushingoid, mild right-sided cerebellar signs with past-pointing and dysdiadochokinesia"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry at right base with dullness to percussion suggesting pleural effusion"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Aggressive neuroendocrine prostate cancer with multiple lines of failed therapy and new brain metastases. Significant clinical deterioration with poor performance status leading to transition to palliative care."
      },
      {
        "type": "latest_treatment_response",
        "value": "Clinical deterioration with new neurological symptoms from brain metastases"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Declined to ECOG PS 3, requiring wheelchair assistance and sleeping most of day"
      },
      {
        "type": "update_to_treatment",
        "value": "Transition to best supportive care due to poor performance status and disease progression"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care team referral with review tomorrow, weekly telephone reviews planned"
      }
    ]
  }
}