{
  "content": "Diagnosis:\tMetastatic prostate cancer (plasmacytoid variant)\n\nManagement:\tJan 2024 - Started Docetaxel/ADT\n\t\tMarch 2024 - Docetaxel discontinued due to neutropenic sepsis\n\t\tApril 2024 - Commenced Cabazitaxel\n\nHistology:\tPlasmacytoid carcinoma, androgen receptor negative\n\nCurrent Situation:\tProgressive disease with deteriorating performance status\n\nI reviewed [redacted name] today who attended with his wife. Unfortunately, he has experienced further significant clinical deterioration since our last review. His performance status has declined from ECOG 2 to ECOG 3, and he now requires assistance with most activities of daily living. He reports worsening bone pain despite recent increases in his opiate medications, and new onset confusion over the past week.\n\nHis blood tests show concerning progression with haemoglobin dropping to 78 g/L requiring transfusion support. His PSA has risen dramatically from 789 to 1240 ng/mL over the past 3 weeks. Alkaline phosphatase has also increased to 876 U/L. Recent CT shows progressive bone marrow infiltration and new compression fractures at T8 and L2.\n\nHe initially commenced on docetaxel with ADT in January 2024 but experienced grade 4 neutropenic sepsis requiring ICU admission after cycle 2. Following recovery, we initiated cabazitaxel in April 2024, but he has only managed one cycle with significant toxicity including grade 3 fatigue and grade 2 peripheral neuropathy.\n\nGiven his rapid clinical deterioration, poor tolerance of chemotherapy, and extensive bone marrow involvement, I have had a detailed discussion with [redacted name] and his wife about transitioning to best supportive care. They understand that further systemic anti-cancer therapy is likely to cause more harm than benefit at this stage.\n\nI have made an urgent referral to the palliative care team and increased his opiate medications. We have arranged admission to the local hospice for symptom control. I have also organized urgent MRI spine to assess the need for palliative radiotherapy to the areas of cord compression.\n\nWe will continue to provide support through our acute oncology service, and I have given them direct contact details should they need urgent assistance.",
  "output": {
    "primary_cancer": {
      "site": "prostate",
      "year": 2024,
      "month": 1,
      "metastases": "extensive bone marrow infiltration, T8 and L2 compression fractures",
      "tnm_stage": "T4N1M1",
      "histopathology_status": "plasmacytoid carcinoma",
      "biomarker_status": "androgen receptor negative, PSA 1240 ng/mL",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started Docetaxel with ADT",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Docetaxel discontinued due to grade 4 neutropenic sepsis requiring ICU admission after cycle 2",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced Cabazitaxel",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "PSA increased from 789 to 1240 ng/mL, ALP 876 U/L",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progressive bone marrow infiltration and new compression fractures at T8 and L2",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated from ECOG 2 to ECOG 3, requiring assistance with most activities of daily living"
      },
      {
        "type": "current_symptom",
        "value": "Worsening bone pain despite increased opiate medications"
      },
      {
        "type": "current_symptom",
        "value": "New onset confusion over past week"
      },
      {
        "type": "investigation_finding",
        "value": "Haemoglobin 78 g/L requiring transfusion support"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic prostate cancer with extensive bone marrow involvement showing rapid progression. Failed two lines of chemotherapy due to severe toxicity"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Cabazitaxel causing grade 3 fatigue and grade 2 peripheral neuropathy"
      },
      {
        "type": "update_to_treatment",
        "value": "Transitioning to best supportive care due to clinical deterioration and poor treatment tolerance"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant decline in performance status requiring increased care support"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI spine to assess cord compression"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team and arranged hospice admission for symptom control"
      }
    ]
  }
}