{
  "content": "I reviewed [redacted name] today who attended with his wife and daughter following recent admission to [redacted name] Hospital with increasing confusion and headaches. Unfortunately, imaging during admission has confirmed progression of his metastatic prostate cancer with new brain metastases.\n\nTo recap, [redacted name] was diagnosed in January 2024 with de novo metastatic prostate cancer, initially presenting with back pain and urinary symptoms. Initial staging showed a T4 prostate mass with pelvic nodal disease, extensive bone metastases, and liver involvement. His initial PSA was markedly elevated at 892. Prostate biopsy confirmed Gleason 5+5 mixed acinar-ductal adenocarcinoma.\n\nHe commenced androgen deprivation therapy with Goserelin and Enzalutamide in February 2024, with initial good biochemical response (PSA nadir 120 in March 2024). However, his PSA has risen rapidly over the past month to 567, coinciding with development of confusion, persistent headaches, and worsening mobility. MRI brain performed during recent admission shows three new parenchymal metastases - the largest measuring 2.8cm in the right temporal lobe with associated edema. CT chest/abdomen/pelvis shows progression in liver metastases and new thoracic vertebral deposits.\n\nHis performance status has unfortunately deteriorated to ECOG 3, spending most of the day in bed or chair. He requires assistance with most activities of daily living. He is experiencing significant fatigue, ongoing bone pain requiring regular opiates, and some difficulty with word-finding. His wife reports increased confusion particularly in evenings. On examination today, he is clearly frailer than at last review, with new mild right-sided weakness and unstable gait requiring wheelchair for longer distances.\n\nI have had a lengthy discussion with [redacted name] and his family regarding the situation. Given the aggressive disease progression and poor performance status, I have explained that further systemic anti-cancer therapy carries significant risks with limited potential benefit. We have agreed to focus on symptom control and quality of life. I have commenced dexamethasone 8mg daily for cerebral edema and arranged urgent radiotherapy to whole brain (20Gy in 5 fractions) starting tomorrow. I have also referred to the palliative care team for ongoing support with symptom management.\n\nThe plan is to continue current ADT but discontinue Enzalutamide given clear progression. I have provided prescriptions for dexamethasone and increased analgesia. [redacted name] will be reviewed by palliative care team tomorrow, and I will see him again after completion of radiotherapy in clinic next week. I have given clear instructions about red flag symptoms and provided 24-hour contact details for the acute oncology service.",
  "output": {
    "primary_cancer": {
      "site": "prostate bilateral",
      "year": 2024,
      "month": 1,
      "metastases": "pelvic nodal disease, extensive bone metastases, liver metastases, brain metastases",
      "tnm_stage": "T4N1M1",
      "histopathology_status": "mixed acinar-ductal adenocarcinoma, Gleason 5+5",
      "biomarker_status": "Initial PSA 892",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "Initial PSA 892",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Goserelin and Enzalutamide",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "PSA nadir 120",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "PSA risen to 567",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows three new brain metastases, largest 2.8cm in right temporal lobe",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows progression in liver metastases and new thoracic vertebral deposits",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing Enzalutamide due to disease progression",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG 3, spending most of day in bed or chair"
      },
      {
        "type": "current_symptom",
        "value": "Confusion and headaches"
      },
      {
        "type": "current_symptom",
        "value": "Significant fatigue"
      },
      {
        "type": "current_symptom",
        "value": "Bone pain requiring regular opiates"
      },
      {
        "type": "current_symptom",
        "value": "Word-finding difficulty"
      },
      {
        "type": "examination_finding",
        "value": "Mild right-sided weakness and unstable gait requiring wheelchair for longer distances"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic prostate cancer with recent progression including new brain metastases. Significant clinical deterioration with poor performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with rising PSA and new metastases despite Enzalutamide"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing Enzalutamide, continuing ADT, starting dexamethasone 8mg daily"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deteriorated to ECOG 3, requiring assistance with most activities of daily living"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent whole brain radiotherapy 20Gy in 5 fractions"
      },
      {
        "type": "follow_up_referral",
        "value": "Palliative care team review tomorrow, oncology review after completion of radiotherapy"
      }
    ]
  }
}