{
  "content": "Many thanks for referring [redacted name] for MDT discussion following recent identification of liver metastases. He is a 62-year-old gentleman who underwent anterior resection in January 2024 for a poorly differentiated rectal adenocarcinoma, Duke's C1 with 4/12 nodes positive. His post-operative recovery was complicated by an anastomotic leak requiring temporary defunctioning ileostomy. Molecular analysis of the primary tumor demonstrated KRAS G12D mutation and BRAF wild-type status.\n\nSurveillance CT on 15th March 2024 unfortunately showed three new liver metastases in segments 6 and 7, measuring 2.8cm, 2.1cm, and 1.6cm respectively. His case was discussed at length at today's Colorectal MDT with input from hepatobiliary surgery, medical oncology, and clinical oncology teams. The consensus was that given the limited hepatic disease burden and good performance status, he would be an excellent candidate for potentially curative treatment combining systemic therapy and surgery.\n\nThe MDT recommendation is to commence 3 months of FOLFOX chemotherapy with bevacizumab, followed by CT reassessment. If good response is demonstrated, he would proceed to staged liver resection followed by completion of systemic therapy. His case has been accepted by [redacted name] on the hepatobiliary surgical list. The alternative of upfront liver surgery was considered but rejected given the early presentation of metastatic disease following primary surgery.\n\nI reviewed [redacted name] in clinic immediately following the MDT. He maintains excellent performance status (WHO PS 0) despite recent surgery. He has recovered well from his anastomotic leak, and stoma function is good. Blood tests show normal liver function, CEA 12.4 (previously 8.2). He understands the treatment recommendation and wishes to proceed. I have arranged urgent insertion of a PICC line and will commence chemotherapy next week. He will be reviewed regularly in the oncology clinic during treatment with interim blood tests and toxicity monitoring. CT reassessment is planned for 3 months' time, following which his case will be re-discussed at the MDT.",
  "output": {
    "primary_cancer": {
      "site": "rectum",
      "year": 2024,
      "month": 1,
      "metastases": "three liver metastases in segments 6 and 7",
      "other_stage": "Duke's C1",
      "histopathology_status": "poorly differentiated adenocarcinoma, 4/12 nodes positive",
      "biomarker_status": "KRAS G12D mutation, BRAF wild-type",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "anterior resection complicated by anastomotic leak requiring temporary defunctioning ileostomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows three new liver metastases in segments 6 and 7, measuring 2.8cm, 2.1cm, and 1.6cm",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "CEA increased from 8.2 to 12.4",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "WHO PS 0"
      },
      {
        "type": "investigation_finding",
        "value": "normal liver function"
      },
      {
        "type": "investigation_finding",
        "value": "CEA 12.4"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recent rectal cancer with early metastatic liver disease. MDT recommends systemic therapy followed by staged liver resection with curative intent."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence FOLFOX chemotherapy with bevacizumab"
      },
      {
        "type": "planned_investigation",
        "value": "CT reassessment in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Regular oncology clinic review during treatment with interim blood tests and toxicity monitoring"
      }
    ]
  }
}