{
  "content": "Diagnosis\n\t1. Small cell carcinoma of rectosigmoid junction with liver and brain metastases\n\tDate of diagnosis\n\tJanuary 2024\n\n\tTreatment aim\n\tPalliative\n\n\tSummary of completed treatment and relevant dates\n\n\tSurgery\n\t15 Jan 2024 Diagnostic laparoscopic biopsy\n\n\tChemotherapy\n\t1. Carboplatin/Etoposide Jan-Mar 2024 (4 cycles)\n\t2. Whole brain radiotherapy March 2024 30Gy in 10#\n\n\tClinical studies\n\tNone suitable\n\n\tCurrent disease status\n\tProgressive disease in liver and brain\n\n\tCurrent issues\n\t1. Deteriorating mobility and confusion\n\t2. Increasing liver pain\n\t3. Fatigue WHO PS 3\n\n\tSummary of consultation\n\nI reviewed [redacted name] today who attended with his wife and daughter. Unfortunately, his condition has significantly deteriorated since our last review three weeks ago. The recent MRI brain (15/4/24) shows progression of multiple brain metastases with increasing perilesional edema despite completion of whole brain radiotherapy in March. CT abdomen/pelvis (12/4/24) demonstrates enlarging liver metastases with the largest lesion now measuring 8.2cm compared to 5.6cm in February.\n\nHe is now spending most of the day in bed or chair (WHO PS 3) and requires assistance with all activities of daily living. His wife reports increasing confusion and drowsiness over the past week. He has escalating right upper quadrant pain requiring increased doses of opiates. Current medications include Dexamethasone 4mg bd, MST 60mg bd, Oxycodone 5mg prn, and Ondansetron prn.\n\nOn examination today, he is cushingoid from steroids but not jaundiced. There is tender hepatomegaly extending 6cm below the costal margin. Neurological examination reveals new mild left-sided weakness and unsteady gait requiring a wheelchair for mobility.\n\nI have had a lengthy discussion with [redacted name] and his family about the significant disease progression and poor prognosis. Given his deteriorating performance status and progression through first-line chemotherapy, further systemic anti-cancer therapy would carry significant risks with little likelihood of benefit.\n\n\tFurther investigations\n\tNone indicated\n\n\tMedication changes\n\t1. Dexamethasone increased to 8mg bd\n\t2. MST increased to 90mg bd\n\t3. Metoclopramide 10mg tds added\n\n\tFollow up\n\t1. Urgent referral to community palliative care team\n\t2. Hospital palliative care team review tomorrow\n\t3. GP updated by telephone today\n\n\tRequired GP actions\n\t1. Please support terminal care at home as discussed\n\t2. Anticipatory medications to be arranged\n\n\tSummary of information given to patient and family\n\tExtensive discussion regarding progressive disease and transition to supportive care focus. Family aware of poor prognosis with likely survival of weeks rather than months.",
  "output": {
    "primary_cancer": {
      "site": "rectosigmoid junction",
      "year": 2024,
      "month": 1,
      "metastases": "liver and brain metastases",
      "tnm_stage": "T3N1M1",
      "histopathology_status": "small cell carcinoma",
      "biomarker_status": "SSTR2 negative; Ki67 95%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Diagnostic laparoscopic biopsy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Carboplatin/Etoposide chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Completed whole brain radiotherapy 30Gy in 10 fractions",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT abdomen/pelvis shows enlarging liver metastases, largest lesion 8.2cm vs 5.6cm in February",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows progression of multiple brain metastases with increasing perilesional edema",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "WHO PS 3, spending most of day in bed or chair"
      },
      {
        "type": "current_symptom",
        "value": "Increasing confusion and drowsiness over past week"
      },
      {
        "type": "current_symptom",
        "value": "Escalating right upper quadrant pain requiring increased opiates"
      },
      {
        "type": "examination_finding",
        "value": "Cushingoid appearance, tender hepatomegaly 6cm below costal margin, new mild left-sided weakness, unsteady gait"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires assistance with all activities of daily living, wheelchair dependent"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic small cell carcinoma of rectosigmoid with progressive disease in liver and brain despite first-line chemotherapy and radiotherapy. Significant clinical deterioration with poor prognosis"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease in both liver and brain metastases despite completion of whole brain radiotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Decision to cease systemic anti-cancer therapy due to disease progression and poor performance status"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration to WHO PS 3 with new neurological deficits and increasing confusion"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to community palliative care team and hospital palliative care review arranged"
      }
    ]
  }
}