{
  "content": "I reviewed [redacted name] today in the colorectal oncology clinic, accompanied by his wife. Unfortunately, recent imaging has confirmed disease progression despite third-line treatment. The patient was initially diagnosed with a mucinous adenocarcinoma of the rectum in January 2023, initially Duke's C1 with 4/12 positive lymph nodes. He underwent long-course chemoradiotherapy followed by anterior resection in April 2023. Molecular analysis revealed MSI-high status and NRAS G12D mutation.\n\nUnfortunately, surveillance imaging in August 2023 revealed the development of multiple liver metastases. He received first-line FOLFOX chemotherapy with good initial response, but developed progression after 6 cycles. Second-line FOLFIRI was commenced in November 2023 but was poorly tolerated with grade 3 diarrhea requiring dose reduction and eventual discontinuation after 4 cycles due to ongoing toxicity. Third-line pembrolizumab was initiated in February 2024 given his MSI-high status.\n\nHis most recent CT scan from 15 April 2024 shows clear evidence of disease progression with 30% increase in liver metastases and development of new peritoneal deposits. His performance status has declined from ECOG 1 to ECOG 2-3, spending more than 50% of the day resting. He describes worsening right upper quadrant pain requiring increased opiate analgesia, early satiety, and has lost 6kg over the last month despite nutritional supplements.\n\nOn examination today, there is tender hepatomegaly extending 4cm below the costal margin. There is peripheral edema to the mid-calves bilaterally. Blood tests show deteriorating liver function with bilirubin 45, ALT 156, ALP 345.\n\nI have had a lengthy discussion with [redacted name] and his wife about the current situation. Given his declining performance status, worsening liver function, and clear evidence of disease progression through three lines of therapy, I have explained that further systemic anti-cancer therapy is unlikely to be beneficial and carries significant risks. We have agreed to focus on symptom management and quality of life. I have made an urgent referral to the palliative care team and arranged weekly community nurse reviews. He will continue under our care with review in 2 weeks' time, sooner if needed. I have provided emergency contact numbers and arranged for a Macmillan nurse to visit at home this week.",
  "output": {
    "primary_cancer": {
      "site": "rectum",
      "year": 2023,
      "month": 1,
      "metastases": "multiple liver metastases, peritoneal deposits",
      "other_stage": "Duke's C1",
      "histopathology_status": "mucinous adenocarcinoma",
      "biomarker_status": "MSI-high, NRAS G12D mutation",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Completed long-course chemoradiotherapy",
          "year": 2023,
          "month": 4
        },
        {
          "type": "treatment_surgery",
          "value": "Anterior resection with 4/12 positive lymph nodes",
          "year": 2023,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "Development of multiple liver metastases on surveillance imaging",
          "year": 2023,
          "month": 8
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line FOLFOX chemotherapy",
          "year": 2023,
          "month": 8
        },
        {
          "type": "treatment_systemic_change",
          "value": "Disease progression after 6 cycles of FOLFOX",
          "year": 2023,
          "month": 11
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced second-line FOLFIRI",
          "year": 2023,
          "month": 11
        },
        {
          "type": "treatment_systemic_change",
          "value": "FOLFIRI discontinued after 4 cycles due to grade 3 diarrhea and ongoing toxicity",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started third-line pembrolizumab",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows 30% increase in liver metastases and new peritoneal deposits",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Deteriorated from ECOG 1 to ECOG 2-3, spending >50% of day resting"
      },
      {
        "type": "current_symptom",
        "value": "Worsening right upper quadrant pain requiring increased opiate analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety"
      },
      {
        "type": "examination_finding",
        "value": "Tender hepatomegaly extending 4cm below costal margin"
      },
      {
        "type": "examination_finding",
        "value": "Peripheral edema to mid-calves bilaterally"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating liver function with bilirubin 45, ALT 156, ALP 345"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic rectal cancer progressing through third-line therapy with declining performance status and liver function"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on pembrolizumab with 30% increase in liver metastases and new peritoneal disease"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant functional decline with weight loss of 6kg over last month despite nutritional supplements"
      },
      {
        "type": "update_to_treatment",
        "value": "Decision to discontinue systemic therapy and focus on symptom management"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team, weekly community nurse reviews, and oncology review in 2 weeks"
      }
    ]
  }
}