{
  "content": "Diagnosis:\tMetastatic anorectal melanoma\n\nManagement:\t12 Mar 2024 Diagnostic biopsy\n\t\t20 Mar 2024 Staging investigations completed\n\nHistology:\tMalignant melanoma, BRAF V600E positive, KIT negative\n\nCurrent Situation:\tInitial oncology assessment\n\nI reviewed [redacted name] today who presents with recently diagnosed anorectal melanoma. The patient initially presented to colorectal surgery in February 2024 with a 3-month history of rectal bleeding and change in bowel habit. Colonoscopy revealed a 5.2cm pigmented mass in the anorectal junction, biopsies of which confirmed malignant melanoma. Molecular testing has shown BRAF V600E mutation positivity, while KIT mutation testing was negative.?\n?\nStaging investigations have unfortunately revealed extensive metastatic disease. CT chest/abdomen/pelvis from 15/03/24 shows the primary anorectal mass with multiple enlarged mesorectal and bilateral inguinal nodes, the largest measuring 3.2cm. There are multiple liver metastases throughout both lobes, the largest being 4.8cm in segment 7. Multiple lung metastases are present bilaterally, measuring up to 2.1cm. MRI brain on 18/03/24 shows three parenchymal metastases - the largest measuring 12mm in the right frontal lobe with surrounding edema.?\n?\nThe patient reports increasing pelvic pain over the past month, now requiring regular opioid analgesia. There has been a 6kg weight loss over 2 months with reduced appetite. Performance status has declined from fully independent to ECOG PS 2, spending around 50% of the day resting due to fatigue and pain.?\n?\nPast medical history includes well-controlled type 2 diabetes and hypertension. Current medications include Metformin 1g BD, Ramipril 5mg OD, MST 30mg BD, and Oramorph for breakthrough pain. Lives with spouse who provides good support.?\n?\nOn examination today, the patient appears cachectic with obvious fatigue. Abdominal examination reveals tender hepatomegaly 4cm below costal margin. Digital rectal examination demonstrates a firm, irregular mass from 2-6 o'clock position. No focal neurological deficits are identified.?\n?\nGiven the presence of brain metastases, I have discussed starting urgent whole brain radiotherapy next week. Following this, we plan to commence combination immunotherapy with Ipilimumab and Nivolumab, with consideration of adding targeted BRAF/MEK inhibition depending on response. I have arranged urgent referral to palliative care for optimization of pain control and support. The patient will be discussed at next week's melanoma MDT.?\n?\nWe will review again in one week after completion of whole brain radiotherapy to commence systemic therapy. CT reassessment will be arranged after 4 cycles of immunotherapy. I have provided emergency contact details and written information about treatment options.",
  "output": {
    "primary_cancer": {
      "site": "anorectal junction",
      "year": 2024,
      "month": 3,
      "metastases": "multiple liver metastases, bilateral lung metastases, brain metastases, mesorectal and bilateral inguinal nodes",
      "tnm_stage": "T4bN2M1",
      "histopathology_status": "malignant melanoma",
      "biomarker_status": "BRAF V600E positive, KIT negative",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial presentation with rectal bleeding and change in bowel habit",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "Colonoscopy showing 5.2cm pigmented mass in anorectal junction",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_surgery",
          "value": "Diagnostic biopsy performed",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Biopsy confirms malignant melanoma, BRAF V600E positive, KIT negative",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows multiple liver metastases, lung metastases, and lymph node involvement",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows three parenchymal metastases",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2, spending around 50% of day resting due to fatigue and pain"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "current_symptom",
        "value": "Increasing pelvic pain requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "6kg weight loss over 2 months with reduced appetite"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic appearance, tender hepatomegaly 4cm below costal margin, firm irregular mass from 2-6 o'clock position on rectal examination"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed metastatic anorectal melanoma with brain, lung, and liver metastases. Rapidly deteriorating with significant symptoms requiring urgent treatment initiation."
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Decline in performance status from fully independent to ECOG PS 2 due to fatigue and pain"
      },
      {
        "type": "planned_investigation",
        "value": "CT reassessment after 4 cycles of immunotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for urgent whole brain radiotherapy followed by Ipilimumab and Nivolumab immunotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in one week after completion of whole brain radiotherapy to commence systemic therapy"
      }
    ]
  }
}