{
  "content": "Diagnosis:\tMalignant pleural mesothelioma, right hemithorax, BAP1 negative, T4N2M0\n\nPresented March 2024 with progressive dyspnoea and right-sided chest pain. CT thorax showed circumferential right pleural thickening with mediastinal invasion and bulky right hilar lymphadenopathy. Video-assisted thoracoscopic pleural biopsy on 15/3/24 confirmed epithelioid mesothelioma, BAP1 negative on immunohistochemistry. MRI thorax 28/3/24 demonstrated T4 disease with chest wall invasion and diaphragmatic involvement.\n\n[redacted name] is a 68-year-old retired plumber with significant asbestos exposure during his early career. His symptoms began approximately 4 months ago with gradually worsening breathlessness, now MRCD grade 3. He reports right-sided chest pain requiring regular opioid analgesia and has lost 7kg in weight. Performance status has declined from 1 to 2 over the past month.\n\nSignificant past medical history includes type 2 diabetes, hypertension, and previous DVT in 2020. Current medications include metformin, ramipril, and morphine sulfate modified release 20mg BD. He lives with his wife who provides good support.\n\nClinical examination reveals reduced air entry throughout the right hemithorax with dull percussion note and tactile vocal fremitus. Chest expansion is notably reduced on the right. No supraclavicular lymphadenopathy. Oxygen saturations 94% on room air.\n\nDiscussed at the Mesothelioma MDT on 2/4/24. Given the extent of disease and declining performance status, recommended for first-line carboplatin/pemetrexed chemotherapy with early palliative care involvement. I have explained the rationale, procedure, and potential side effects of chemotherapy. [redacted name] wishes to proceed with treatment.\n\nPlan: Will commence chemotherapy next week pending baseline blood tests and vitamin B12/folate levels. Referred to palliative care for optimization of pain control. Arranged CT assessment after 3 cycles. Follow-up in 3 weeks with blood results.",
  "output": {
    "primary_cancer": {
      "site": "right lung, pleural",
      "year": 2024,
      "month": 3,
      "metastases": "mediastinal invasion, right hilar lymphadenopathy, chest wall invasion, diaphragmatic involvement",
      "tnm_stage": "T4N2M0",
      "histopathology_status": "epithelioid mesothelioma",
      "biomarker_status": "BAP1 negative",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT thorax shows circumferential right pleural thickening with mediastinal invasion and bulky right hilar lymphadenopathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "VATS pleural biopsy confirms epithelioid mesothelioma, BAP1 negative",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI thorax demonstrates T4 disease with chest wall invasion and diaphragmatic involvement",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "MDT recommendation for first-line carboplatin/pemetrexed chemotherapy",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2, deteriorated from PS 1 over past month"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided chest pain requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Breathlessness MRCD grade 3"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry throughout right hemithorax with dull percussion note and reduced chest expansion"
      },
      {
        "type": "examination_finding",
        "value": "Oxygen saturations 94% on room air"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension"
      },
      {
        "type": "comorbidity",
        "value": "Previous DVT in 2020"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed epithelioid mesothelioma with extensive local invasion. Deteriorating performance status with significant symptoms requiring prompt treatment initiation"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence carboplatin/pemetrexed chemotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "CT assessment after 3 cycles of chemotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Follow-up in 3 weeks with blood results"
      }
    ]
  }
}