{
  "content": "Diagnosis:\tLocally advanced squamous cell carcinoma of right upper lobe lung.\n\tT3N2M0 (Stage IIIA), PD-L1 55%\n\tCT chest 15 March 2024 - 5.2cm right upper lobe mass with ipsilateral mediastinal lymphadenopathy.\n\tPET-CT 20 March 2024 - FDG-avid primary lesion and right hilar/mediastinal nodes, no distant metastases.\n\tMRI brain 22 March 2024 - No evidence of intracranial metastases.??\n?\n[redacted name] is a 64-year-old gentleman who has recently been diagnosed with locally advanced squamous cell carcinoma of the right upper lobe. His presenting symptoms began in January 2024 with persistent cough, mild haemoptysis, and progressive breathlessness. He reports 5kg weight loss over the past 3 months but maintains good appetite. His performance status is 1, managing daily activities with mild breathlessness on exertion.??\n?\nIn his past medical history, he has COPD with FEV1 65% predicted and well-controlled hypertension. He is an ex-smoker with 40 pack-year history, having quit 2 years ago. He lives with his wife and continues to work part-time as an accountant.?\n?\nOn examination today, there is reduced air entry in the right upper zone with some surrounding bronchial breathing. No clubbing or lymphadenopathy noted. Cardiovascular examination unremarkable.??\n?\nImaging shows a 5.2cm right upper lobe mass with ipsilateral mediastinal lymphadenopathy on CT chest. PET-CT confirms FDG-avid disease confined to thorax with no distant metastases. Brain MRI is clear. Bronchoscopic biopsy confirmed squamous cell carcinoma, PD-L1 55%.?\n?\nI have discussed his case at our Lung MDT. Given his good performance status and disease extent, he is suitable for radical chemoradiotherapy with curative intent. We plan for 4 cycles of cisplatin/vinorelbine chemotherapy concurrent with radical radiotherapy (60Gy in 30 fractions).?\n?\nI have explained the treatment schedule, potential side effects, and aims of therapy. He will have baseline blood tests, EDTA clearance, and audiometry next week. We will see him in clinic prior to treatment commencement in 2 weeks' time. Please do not hesitate to contact us if any concerns arise.",
  "output": {
    "primary_cancer": {
      "site": "lung, right upper lobe",
      "year": 2024,
      "month": 1,
      "metastases": "ipsilateral mediastinal lymphadenopathy",
      "tnm_stage": "T3N2M0",
      "other_stage": "Stage IIIA",
      "histopathology_status": "squamous cell carcinoma",
      "biomarker_status": "PD-L1 55%",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial symptoms of cough, haemoptysis, and progressive breathlessness",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest shows 5.2cm right upper lobe mass with ipsilateral mediastinal lymphadenopathy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "PET-CT confirms FDG-avid primary lesion and right hilar/mediastinal nodes, no distant metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows no evidence of intracranial metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Bronchoscopic biopsy confirmed squamous cell carcinoma, PD-L1 55%",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 1, managing daily activities with mild breathlessness on exertion"
      },
      {
        "type": "comorbidity",
        "value": "COPD with FEV1 65% predicted"
      },
      {
        "type": "comorbidity",
        "value": "Well-controlled hypertension"
      },
      {
        "type": "current_symptom",
        "value": "5kg weight loss over past 3 months"
      },
      {
        "type": "current_symptom",
        "value": "Mild breathlessness on exertion"
      },
      {
        "type": "examination_finding",
        "value": "Reduced air entry in right upper zone with surrounding bronchial breathing"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed locally advanced squamous cell lung cancer. Good performance status, suitable for radical chemoradiotherapy with curative intent"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline blood tests, EDTA clearance, and audiometry next week"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan for 4 cycles cisplatin/vinorelbine chemotherapy concurrent with radical radiotherapy 60Gy in 30 fractions"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in 2 weeks prior to treatment commencement"
      }
    ]
  }
}