{
  "content": "Diagnosis:\tMetastatic lung adenocarcinoma (right middle lobe)\n\nManagement:\t2023 Whole brain radiotherapy\n\t\tOngoing Poziotinib 16mg daily\n\nHistology:\tAdenocarcinoma with HER2 exon 20 insertion mutation (results for other molecular markers pending)\n\nCurrent Situation:\tRoutine follow-up on targeted therapy\n\nI reviewed [redacted name] in clinic today who continues on Poziotinib for her metastatic lung cancer. She has been managing well on treatment since starting in November 2023 following completion of whole brain radiotherapy. Her main symptoms of headache and dizziness have significantly improved. She reports good energy levels and has maintained her weight at 68kg. She continues to experience grade 1 diarrhea which is well controlled with loperamide as needed.\n\nHer most recent CT chest/abdomen/pelvis from March 2024 shows stable appearances of the right middle lobe primary tumor and bone metastases. MRI brain last month demonstrated good response to previous radiotherapy with reduction in size of all intracranial deposits.\n\nOn examination today, she is comfortable at rest with no new neurological deficits. Chest is clear on auscultation.\n\nThe plan is to continue with Poziotinib at current dose. We will arrange repeat CT and MRI brain in 3 months' time. She will be reviewed back in clinic following these scans. In the meantime, she has been advised to contact us if any new concerns arise.",
  "output": {
    "primary_cancer": {
      "site": "lung, right middle lobe",
      "metastases": "brain and bone metastases",
      "other_stage": "Stage IV",
      "histopathology_status": "adenocarcinoma",
      "biomarker_status": "HER2 exon 20 insertion mutation, other molecular results pending",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Completed whole brain radiotherapy",
          "year": 2023
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Poziotinib 16mg daily",
          "year": 2023,
          "month": 11
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable appearances of right middle lobe primary tumor and bone metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows reduction in size of all intracranial deposits",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Grade 1 diarrhea controlled with loperamide"
      },
      {
        "type": "examination_finding",
        "value": "Comfortable at rest, no new neurological deficits, chest clear on auscultation"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Good energy levels, maintained weight at 68kg"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic lung adenocarcinoma with brain and bone metastases, stable disease on Poziotinib with good symptom control"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on CT with improvement in brain metastases on MRI"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Ongoing grade 1 diarrhea managed with loperamide"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing Poziotinib at current dose"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat CT and MRI brain in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic after imaging"
      }
    ]
  }
}