{
  "content": "Diagnosis:\tBasaloid carcinoma of right hilar region with mediastinal invasion\n\nStage:\t\tT4N2M0 (Stage IIIB)\n\nBiomarkers:\tSOX2 amplification positive, PD-L1 25%\n\nTrial:\t\tIMpower-133 protocol arm B (atezolizumab + carboplatin/etoposide)\n\nI reviewed [redacted name] today for cycle 4 assessment on the IMpower-133 trial. His initial presenting symptoms of cough and right-sided chest pain have significantly improved since starting treatment. Performance status remains 0 and he continues to work full time. Weight has stabilized at 76kg.\n\nCT assessment performed on 15/4/2024 shows partial response with 45% reduction in right hilar mass and reduction in mediastinal lymphadenopathy compared to baseline. No new sites of disease identified.\n\nBlood results show stable renal and liver function. FBC shows mild neutropenia (neutrophils 1.2) but above protocol-defined hold parameters. LDH has normalized from 450 to 280.\n\nTreatment tolerance has been good with grade 1 fatigue and occasional grade 1 nausea well controlled with standard antiemetics. No immune-related adverse events identified.\n\nPlan is to proceed with cycle 4 today as per protocol. Next CT assessment due after cycle 6. Trial coordinator has arranged next review in 3 weeks with routine bloods 48 hours before attendance.",
  "output": {
    "primary_cancer": {
      "site": "right hilar region",
      "histopathology_status": "basaloid carcinoma with mediastinal invasion",
      "tnm_stage": "T4N2M0",
      "other_stage": "Stage IIIB",
      "biomarker_status": "SOX2 amplification positive, PD-L1 25%",
      "cancer_timeline": [
        {
          "type": "clinical_trial_update",
          "value": "Enrolled in IMpower-133 trial arm B (atezolizumab + carboplatin/etoposide)"
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows partial response with 45% reduction in right hilar mass and reduction in mediastinal lymphadenopathy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "LDH normalized from 450 to 280"
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 0"
      },
      {
        "type": "investigation_finding",
        "value": "Mild neutropenia (neutrophils 1.2)"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Continues to work full time"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Basaloid carcinoma of right hilum showing good partial response to IMpower-133 trial therapy with improving symptoms"
      },
      {
        "type": "latest_treatment_response",
        "value": "45% reduction in right hilar mass and reduction in mediastinal lymphadenopathy on CT"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 fatigue and occasional grade 1 nausea well controlled with antiemetics"
      },
      {
        "type": "update_to_treatment",
        "value": "Proceeding with cycle 4 of trial protocol"
      },
      {
        "type": "planned_investigation",
        "value": "CT assessment due after cycle 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 3 weeks with routine bloods 48 hours before attendance"
      }
    ]
  }
}