{
  "content": "Diagnosis:\tMetastatic adenocarcinoma of right lower lobe lung with bone metastases\n\nManagement:\t15 Jan 2024 Commenced Crizotinib on METEOR-1 trial\n\nHistology:\tModerately differentiated adenocarcinoma, MET amplification positive, ROS1 negative\n\nCurrent Situation:\tCycle 1 Day 15 trial review\n\nI reviewed [redacted name] today in the Phase II METEOR-1 trial clinic. She was diagnosed with metastatic lung adenocarcinoma in December 2023 following investigations for persistent back pain. Initial staging showed a 4.8cm right lower lobe mass with extensive bone metastases affecting thoracic spine, ribs, and pelvis. Molecular testing revealed MET amplification with copy number 8, while other drivers including ROS1 were negative.\n\nFollowing discussion at our Molecular MDT on January 10th 2024, she was identified as potentially suitable for the METEOR-1 trial investigating Crizotinib in MET-amplified NSCLC. She underwent successful screening including baseline brain MRI showing no metastases, and normal cardiac function on echocardiogram. All eligibility criteria were met and she was enrolled on January 15th 2024.\n\nShe has completed the first two weeks of treatment at 250mg twice daily. Her baseline symptoms have shown early improvement, particularly her back pain which has reduced from requiring regular breakthrough opioids to being controlled on regular paracetamol alone. She describes mild nausea and taste changes but these are not impacting her oral intake. Her performance status remains 1.\n\nAll trial-mandated safety bloods and ECG monitoring have been completed today showing no concerns. Quality of life questionnaires have been completed. She understands the importance of reporting any new symptoms and has the trial team contact details. We have arranged the protocol-mandated CT assessment for week 6. She will continue with the current dose and return next week for cycle 1 day 22 assessment. The research nurse has arranged transport for all upcoming visits.",
  "output": {
    "primary_cancer": {
      "site": "lung, right lower lobe",
      "year": 2023,
      "month": 12,
      "metastases": "extensive bone metastases affecting thoracic spine, ribs, and pelvis",
      "other_stage": "Stage IV",
      "histopathology_status": "moderately differentiated adenocarcinoma",
      "biomarker_status": "MET amplification positive with copy number 8, ROS1 negative",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "4.8cm right lower lobe mass with extensive bone metastases",
          "year": 2023,
          "month": 12
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular testing revealed MET amplification with copy number 8, ROS1 negative",
          "year": 2023,
          "month": 12
        },
        {
          "type": "other_progress_or_event",
          "value": "Discussed at Molecular MDT - identified as suitable for METEOR-1 trial",
          "year": 2024,
          "month": 1
        },
        {
          "type": "clinical_trial_update",
          "value": "Successfully screened and enrolled in METEOR-1 trial investigating Crizotinib",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started Crizotinib 250mg twice daily on METEOR-1 trial",
          "year": 2024,
          "month": 1
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "current_symptom",
        "value": "Mild nausea and taste changes"
      },
      {
        "type": "investigation_finding",
        "value": "Baseline brain MRI showing no metastases"
      },
      {
        "type": "investigation_finding",
        "value": "Normal cardiac function on echocardiogram"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IV MET-amplified lung adenocarcinoma with bone metastases, showing early symptomatic improvement on trial medication Crizotinib"
      },
      {
        "type": "latest_treatment_response",
        "value": "Early symptomatic improvement with reduction in back pain"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Mild nausea and taste changes, not impacting oral intake"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing Crizotinib 250mg twice daily"
      },
      {
        "type": "planned_investigation",
        "value": "Protocol-mandated CT assessment arranged for week 6"
      },
      {
        "type": "follow_up_referral",
        "value": "Return next week for cycle 1 day 22 assessment"
      }
    ]
  }
}