{
  "content": "I reviewed [redacted name] today who attended with his wife following recent CT imaging. Unfortunately, his adenoid cystic carcinoma of the right parotid gland, originally diagnosed in October 2023, has shown further progression despite systemic therapy. The initial presentation involved a T4 locally advanced tumor with level II nodal disease, and staging investigations revealed synchronous lung metastases. He completed radical radiotherapy to the primary site in December 2023, achieving good local control, but developed bone metastases in the thoracic spine in January 2024.\n\nHe commenced lenvatinib in February 2024 following confirmation of NTRK fusion negative status. Initial response assessment showed disease stabilization, but the most recent CT chest performed on 15/4/24 demonstrates clear progression with increase in pulmonary metastases and new liver lesions. His performance status has declined from 1 to 2, with increasing fatigue and right-sided chest pain requiring regular opioid analgesia. He reports new onset dysphagia and has lost 4kg in weight over the past month despite nutritional supplements.\n\nOn examination today, there is no evidence of local recurrence in the right parotid region, but chest examination reveals reduced air entry at both bases with dull percussion note. Blood results show stable renal function but mild transaminitis, likely related to hepatic metastases.\n\nI have discussed the situation in detail with [redacted name] and his wife. Given the clear evidence of disease progression and declining performance status, we have agreed to discontinue lenvatinib. I have explained that while further systemic therapy options exist, including clinical trial possibilities, his current clinical condition suggests we should focus on symptom management. I have made an urgent referral to the palliative care team for review of his pain control and have prescribed additional breakthrough analgesia today. We will arrange urgent CT-guided biopsy of the liver lesions for additional molecular profiling should his condition stabilize sufficiently to consider further treatment options.",
  "output": {
    "primary_cancer": {
      "site": "right parotid gland",
      "year": 2023,
      "month": 10,
      "metastases": "lung metastases, bone metastases in thoracic spine, new liver lesions",
      "tnm_stage": "T4N1M1",
      "histopathology_status": "adenoid cystic carcinoma",
      "biomarker_status": "NTRK fusion negative",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Completed radical radiotherapy to primary site",
          "year": 2023,
          "month": 12
        },
        {
          "type": "anatomical_finding",
          "value": "Developed bone metastases in thoracic spine",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "NTRK fusion negative status confirmed",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced lenvatinib",
          "year": 2024,
          "month": 2
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest shows progression with increase in pulmonary metastases and new liver lesions",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing lenvatinib due to disease progression and declining performance status",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status declined from 1 to 2"
      },
      {
        "type": "current_symptom",
        "value": "Increasing fatigue and right-sided chest pain requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "New onset dysphagia"
      },
      {
        "type": "examination_finding",
        "value": "No evidence of local recurrence in right parotid region, reduced air entry at both bases with dull percussion note"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal function but mild transaminitis, likely related to hepatic metastases"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic adenoid cystic carcinoma of parotid showing disease progression on lenvatinib with declining performance status"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with increase in pulmonary metastases and new liver lesions"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing lenvatinib due to disease progression"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Declining performance status with 4kg weight loss over past month despite nutritional supplements"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care team for review of pain control"
      }
    ]
  }
}