{
  "content": "I reviewed [redacted name] today in follow up after completing his course of adjuvant radiotherapy for T2N0 cutaneous squamous cell carcinoma of the left temple. The radiotherapy was completed on March 15th 2024 with good tolerance apart from grade 1 skin reaction which has now resolved. His most recent CT scan from April 2024 shows no evidence of local recurrence or metastatic disease. The surgical site has healed well with excellent cosmetic outcome. He remains asymptomatic with no new skin lesions noted on examination today. His performance status remains excellent at ECOG 0. Given the high risk features of his original tumor (PD-L1 high expression, 4.2cm diameter, moderate differentiation), we will continue regular surveillance. I have arranged follow up in 3 months with repeat imaging at that time. He understands to contact us sooner if any new concerns develop in the interim.",
  "output": {
    "primary_cancer": {
      "site": "skin, left temple",
      "year": 2024,
      "metastases": "none",
      "tnm_stage": "T2N0",
      "histopathology_status": "squamous cell carcinoma, moderately differentiated, 4.2cm diameter",
      "biomarker_status": "PD-L1 high expression",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Completed adjuvant radiotherapy with grade 1 skin reaction",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT scan shows no evidence of local recurrence or metastatic disease",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 0"
      },
      {
        "type": "examination_finding",
        "value": "Surgical site well healed with excellent cosmetic outcome"
      },
      {
        "type": "examination_finding",
        "value": "No new skin lesions"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "T2N0 cutaneous SCC post adjuvant radiotherapy. No evidence of recurrence on latest imaging with well-healed surgical site."
      },
      {
        "type": "latest_treatment_response",
        "value": "Good tolerance of radiotherapy with resolved grade 1 skin reaction"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat imaging in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in 3 months"
      }
    ]
  }
}