{
  "content": "Diagnosis:\tSquamous cell carcinoma right temple\n\nManagement:\t12 Mar 2024 Wide local excision with 6mm margins\n\nHistology:\tModerately differentiated squamous cell carcinoma, 15mm diameter, 3.2mm depth of invasion, clear margins (minimum 4.2mm), no lymphovascular invasion, pT2N0\n\nCurrent Situation:\tPost-operative review\n\nI reviewed [redacted name] following his recent wide local excision of a right temporal squamous cell carcinoma. The surgical site is healing well with no evidence of complications. There is minimal scarring and no signs of local recurrence. The patient reports no concerning symptoms.\n\nHe has a background of multiple actinic keratoses managed by his dermatologist with regular cryotherapy. He is an ex-smoker having quit in 2010 and works outdoors as a landscape gardener. He uses regular sun protection and has reduced his sun exposure since diagnosis.\n\nOn examination today, the surgical site shows appropriate healing. There is no palpable lymphadenopathy in the neck or pre-auricular regions. The rest of the head and neck skin examination reveals multiple areas of solar damage but no suspicious lesions.\n\nGiven the T2 staging but clear margins and absence of poor prognostic features, we will arrange follow-up in the combined skin cancer clinic in 3 months with repeat photography. I have provided written information about sun protection and skin self-examination. The patient understands to report any new or changing skin lesions.",
  "output": {
    "primary_cancer": {
      "site": "skin, right temple",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "pT2N0",
      "histopathology_status": "Moderately differentiated squamous cell carcinoma, 15mm diameter, 3.2mm depth, clear margins, no lymphovascular invasion",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision with 6mm margins",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Histology confirms moderately differentiated SCC, clear margins minimum 4.2mm",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "comorbidity",
        "value": "Multiple actinic keratoses managed with regular cryotherapy"
      },
      {
        "type": "examination_finding",
        "value": "Surgical site showing appropriate healing, no palpable lymphadenopathy"
      },
      {
        "type": "examination_finding",
        "value": "Multiple areas of solar damage but no suspicious lesions on rest of head and neck"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "T2 squamous cell carcinoma of right temple treated with wide local excision. Post-operative review shows appropriate healing with no complications."
      },
      {
        "type": "follow_up_referral",
        "value": "Combined skin cancer clinic review in 3 months with repeat photography"
      }
    ]
  }
}