{
  "content": "Diagnosis\n\t1. Metastatic cutaneous squamous cell carcinoma of right temple region with extensive bone metastases\n\n\tDate of diagnosis\n\tJanuary 2024\n\n\tTreatment aim\n\tPalliative\n\n\tSummary of completed treatment and relevant dates\n\n\tSurgery\n\t15 Jan 2024 Wide local excision of right temple lesion\n\tHistology confirmed poorly differentiated squamous cell carcinoma with perineural invasion\n\n\tSystemic therapy\n\t1 Feb 2024 - 15 Apr 2024: Pembrolizumab monotherapy\n\n\tRadiotherapy\n\t20 Mar 2024: Palliative radiotherapy to T7 vertebral metastasis (20Gy in 5#)\n\n\tClinical studies\n\tNone\n\n\tCurrent disease status\n\tProgressive disease with new symptomatic bone metastases\n\n\tCurrent issues\n\t1. Severe bone pain\n\t2. Deteriorating mobility\n\t3. Increasing fatigue\n\t4. Weight loss\n\n\tSummary of consultation\n\tThis 78-year-old gentleman has unfortunately shown clear evidence of disease progression despite 3 cycles of pembrolizumab. CT imaging performed yesterday demonstrates multiple new bone metastases including a concerning lesion at C5 with early cord compression, as well as progression in previously identified lesions. His performance status has declined from 1 to 3, now spending most of the day in bed due to pain and fatigue. He has lost 8kg in the past 6 weeks despite dietetic support.\n\nHe requires increasing doses of opioid analgesia, currently on oxycodone MR 40mg BD with breakthrough oxycodone liquid 5mg/5ml used 4-6 times daily. He is experiencing significant side effects from the opioids including constipation and drowsiness.\n\nOn examination today, there is tenderness over multiple thoracic vertebrae and the left hip. Neurological examination shows reduced power (4/5) in the left leg but normal sensation and reflexes. The right temple surgical site shows no evidence of local recurrence.\n\n\tFurther investigations\n\t1. Urgent MRI whole spine\n\t2. Bone profile and vitamin D level\n\t3. DEXA scan\n\n\tMedication prescribed\n\t1. Increased oxycodone MR to 60mg BD\n\t2. Added pregabalin 75mg BD for neuropathic pain\n\t3. Dexamethasone 8mg OD with PPI cover\n\n\tFollow up\n\t1. Urgent referral to acute oncology service\n\t2. Referral to palliative care team\n\t3. Clinical review in 1 week\n\n\tRequired GP actions\n\t1. Please monitor renal function weekly\n\t2. District nurse referral for support with medication administration\n\n\tSummary of information given to patient\n\tDetailed discussion held with patient and family regarding disease progression. Treatment with pembrolizumab will be discontinued. Focus now on symptom control and quality of life. Palliative care involvement explained and accepted.",
  "output": {
    "primary_cancer": {
      "site": "skin, right temple",
      "year": 2024,
      "month": 1,
      "metastases": "extensive bone metastases including T7 and C5 vertebrae with early cord compression",
      "other_stage": "Stage IV",
      "histopathology_status": "poorly differentiated squamous cell carcinoma with perineural invasion",
      "biomarker_status": "PD-L1 CPS 80",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision of right temple lesion",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced pembrolizumab monotherapy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_radiotherapy",
          "value": "Palliative radiotherapy to T7 vertebral metastasis (20Gy in 5#)",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows multiple new bone metastases including C5 lesion with early cord compression",
          "year": 2024,
          "month": 4
        },
        {
          "type": "treatment_systemic_change",
          "value": "Discontinuing pembrolizumab due to disease progression",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status deteriorated from 1 to 3, spending most of day in bed"
      },
      {
        "type": "current_symptom",
        "value": "Severe bone pain requiring increasing opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Significant opioid side effects including constipation and drowsiness"
      },
      {
        "type": "examination_finding",
        "value": "Tenderness over multiple thoracic vertebrae and left hip, reduced power (4/5) in left leg"
      },
      {
        "type": "quality_of_life_finding",
        "value": "8kg weight loss in past 6 weeks despite dietetic support"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic cutaneous SCC showing rapid progression with new symptomatic bone metastases despite pembrolizumab. Significant decline in performance status with increasing pain and mobility issues."
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease after 3 cycles of pembrolizumab with multiple new bone metastases"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing pembrolizumab, increasing oxycodone MR to 60mg BD, adding pregabalin and dexamethasone"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in mobility and independence, now largely bed-bound"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI whole spine, bone profile, vitamin D level, and DEXA scan"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to acute oncology and palliative care teams, clinical review in 1 week"
      }
    ]
  }
}