{
  "content": "Diagnosis:\tLocally advanced cutaneous squamous cell carcinoma right temporal region with regional lymph node involvement\n\nManagement:\t15 Jan 2024 Wide local excision and parotid/neck dissection\n\t\t12 Feb 2024 Started adjuvant pembrolizumab\n\nHistology:\tModerately differentiated squamous cell carcinoma, 4.2cm diameter, 12mm depth\n\t\tExtensive perineural and lymphovascular invasion\n\t\t3/18 intraparotid nodes positive, largest deposit 15mm\n\t\tPD-L1 CPS 60%\n\nCurrent Situation:\tMDT discussion regarding cycle 3 pembrolizumab and surveillance imaging\n\nI am writing to document today's MDT discussion regarding [redacted name], who is currently receiving adjuvant immunotherapy following surgery for locally advanced cutaneous SCC. The case was presented with recent imaging showing post-surgical changes but no evidence of new disease. His treatment course has been complicated by immune-related thyroiditis requiring endocrine input, though this is now stabilizing on levothyroxine replacement.\n\nThe surgical site is healing well with no clinical evidence of recurrence. He developed grade 2 fatigue after cycle 2 pembrolizumab which has improved to grade 1. Recent thyroid function tests show TSH <0.01 and T4 18.2 on levothyroxine 100mcg daily. Latest chest x-ray shows no evidence of immune pneumonitis.\n\nThe MDT recommendations are to continue with cycle 3 pembrolizumab as planned, with ongoing thyroid monitoring. The next CT scan should be brought forward to precede cycle 4 given the high-risk features. We will arrange dedicated head and neck imaging with contrast at that time. [redacted name] will be reviewed in the combined skin/immunotherapy clinic next week before cycle 3, with concurrent endocrine review.\n\nThe case will be re-discussed after the next imaging. In the meantime, he has clear instructions regarding immune-related adverse event monitoring and emergency contact details.",
  "output": {
    "primary_cancer": {
      "site": "skin, right temporal region",
      "year": 2024,
      "month": 1,
      "metastases": "intraparotid lymph node involvement",
      "other_stage": "Stage III",
      "histopathology_status": "Moderately differentiated squamous cell carcinoma, 4.2cm diameter, 12mm depth, extensive perineural and lymphovascular invasion",
      "biomarker_status": "PD-L1 CPS 60%",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision and parotid/neck dissection with 3/18 positive intraparotid nodes",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant pembrolizumab",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Developed immune-related thyroiditis requiring levothyroxine replacement",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Grade 2 fatigue after cycle 2 pembrolizumab, improved to grade 1",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Surgical site healing well with no clinical evidence of recurrence"
      },
      {
        "type": "investigation_finding",
        "value": "TSH <0.01 and T4 18.2 on levothyroxine 100mcg daily"
      },
      {
        "type": "investigation_finding",
        "value": "Chest x-ray shows no evidence of immune pneumonitis"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Locally advanced cutaneous SCC post surgery, receiving adjuvant pembrolizumab with managed immune-related thyroiditis"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 fatigue and thyroiditis requiring levothyroxine replacement"
      },
      {
        "type": "update_to_treatment",
        "value": "Continue with cycle 3 pembrolizumab as planned"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan with dedicated head and neck imaging with contrast before cycle 4"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in combined skin/immunotherapy clinic next week before cycle 3, with concurrent endocrine review"
      }
    ]
  }
}