{
  "content": "Diagnosis:\tMerkel cell carcinoma right forearm\n\nManagement:\t12 Apr 2024 Wide local excision with 2cm margins and sentinel lymph node biopsy\n\nHistology:\tpT1 (8mm) Merkel cell carcinoma, clear margins >1cm. 0/2 sentinel nodes negative.\n\tMCPyV positive, PD-L1 expression present but percentage not quantifiable\n\nCurrent Situation:\tPost-operative review\n\nI reviewed [redacted name] today following his recent surgery for a Merkel cell carcinoma of the right forearm. The surgical site is healing well with no evidence of wound complications. The sentinel node biopsy sites in the right axilla are also healing appropriately.\n\nHe remains well with no new symptoms. Performance status is 0. On examination today, there is no evidence of local recurrence or regional lymphadenopathy. The surgical site shows expected post-operative changes.\n\nGiven the completely excised T1 tumor with negative sentinel nodes, we have discussed the management options. While adjuvant radiotherapy could be considered, given the small size, clear margins, and negative nodes, we have agreed to proceed with close surveillance.\n\nThe plan is for 3-monthly reviews for the first year with careful examination of the surgical site and regional nodes. I have arranged baseline CT chest/abdomen/pelvis for next week to complete staging. We will see him again with the scan results in 2 weeks' time.",
  "output": {
    "primary_cancer": {
      "site": "skin, right forearm",
      "year": 2024,
      "month": 4,
      "metastases": "",
      "tnm_stage": "pT1N0",
      "other_stage": "",
      "histopathology_status": "Merkel cell carcinoma, 8mm diameter, clear margins >1cm, sentinel nodes negative (0/2)",
      "biomarker_status": "MCPyV positive, PD-L1 expression present (percentage not quantifiable)",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision with 2cm margins and sentinel lymph node biopsy",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Histology confirms pT1 (8mm) Merkel cell carcinoma, clear margins >1cm, 0/2 sentinel nodes negative",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "MCPyV positive, PD-L1 expression present but percentage not quantifiable",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 0"
      },
      {
        "type": "examination_finding",
        "value": "Surgical site healing well, no evidence of local recurrence or regional lymphadenopathy"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed early stage Merkel cell carcinoma of right forearm, treated with wide local excision and sentinel node biopsy. Post-operative review shows good healing with no complications."
      },
      {
        "type": "update_to_treatment",
        "value": "Decision for surveillance rather than adjuvant radiotherapy given small size, clear margins, and negative nodes"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline CT chest/abdomen/pelvis arranged for next week"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with scan results, then 3-monthly reviews for first year"
      }
    ]
  }
}