{
  "content": "Diagnosis:\tMetastatic melanoma - T4bN2M1 disease with brain metastases\n\nInitially diagnosed March 2023 with 6.2mm ulcerated melanoma right calf, BRAF V600K mutation positive, PD-L1 70%.\n\nI reviewed [redacted name] today who attended with her husband. Unfortunately, she has experienced significant clinical deterioration over the past three weeks. Her headaches have worsened despite increasing dexamethasone to 8mg twice daily, and she now describes associated nausea and intermittent visual disturbance. She has also developed new left-sided weakness affecting both arm and leg, though she remains mobile with a walking frame. Her husband reports increased confusion and personality changes over the past week.\n\nShe completed cycle 4 of ipilimumab/nivolumab two weeks ago, but subsequent MRI brain shows clear progression of her intracranial disease with the largest lesion in the right parietal lobe increasing from 2.8cm to 4.1cm with significant surrounding edema. There are also two new lesions in the left frontal lobe measuring 8mm and 12mm respectively. CT chest/abdomen/pelvis shows stable extracranial disease.\n\nI have had a lengthy discussion with [redacted name] and her husband about the significance of these findings. Given the rapid progression of intracranial disease despite immunotherapy, I have recommended urgent whole brain radiotherapy. While this carries risks of cognitive decline, the immediate risk from progressive brain metastases is more pressing. I have also discussed switching systemic therapy to targeted therapy with dabrafenib/trametinib given her BRAF mutation status.\n\nI have made an urgent referral to clinical oncology for whole brain radiotherapy assessment, aiming to start treatment next week if possible. I have prescribed additional dexamethasone (now 8mg three times daily) and added metoclopramide for nausea. The plan is to commence dabrafenib/trametinib immediately after completion of radiotherapy.\n\nI have arranged urgent follow up in one week's time to review her neurological symptoms. I have also made a referral to the palliative care team for additional support with symptom management. Her husband has my direct contact details should there be any acute deterioration before then.",
  "output": {
    "primary_cancer": {
      "site": "skin, right calf",
      "year": 2023,
      "month": 3,
      "metastases": "brain metastases - right parietal lobe and left frontal lobe",
      "tnm_stage": "T4bN2M1",
      "histopathology_status": "melanoma, 6.2mm thickness with ulceration",
      "biomarker_status": "BRAF V600K mutation positive, PD-L1 70%",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started ipilimumab/nivolumab combination immunotherapy",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "MRI shows progression of right parietal lesion from 2.8cm to 4.1cm with significant edema, two new left frontal lesions 8mm and 12mm",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest/abdomen/pelvis shows stable extracranial disease",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Stopping immunotherapy due to brain disease progression",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Worsening headaches despite dexamethasone 8mg twice daily"
      },
      {
        "type": "current_symptom",
        "value": "Nausea and intermittent visual disturbance"
      },
      {
        "type": "current_symptom",
        "value": "New left-sided weakness affecting arm and leg"
      },
      {
        "type": "current_symptom",
        "value": "Confusion and personality changes"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Mobile with walking frame"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic melanoma with progressive brain metastases despite immunotherapy. Significant neurological deterioration requiring urgent whole brain radiotherapy"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive intracranial disease despite ipilimumab/nivolumab with stable extracranial disease"
      },
      {
        "type": "update_to_treatment",
        "value": "Increased dexamethasone to 8mg three times daily and added metoclopramide"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent whole brain radiotherapy assessment"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in one week, referral to palliative care team"
      }
    ]
  }
}