{
  "content": "I was very pleased to review [redacted name] today in our combined head and neck clinic. As you know, he has been managing a challenging course of treatment for his locally advanced cutaneous squamous cell carcinoma of the left temporal region. The tumor was initially diagnosed in January 2024 following a period of rapid growth, with biopsy confirming a moderately to poorly differentiated squamous cell carcinoma with perineural invasion. Initial staging showed extensive local invasion into the temporal bone with a single left level II lymph node, staged as T4N1. PD-L1 testing showed CPS of 15.\n\nHe commenced treatment with pembrolizumab immunotherapy on 15th February 2024, receiving 200mg every 3 weeks. After two cycles, he developed grade 2 pneumonitis requiring a three-week treatment break and oral prednisolone 40mg daily with gradual taper. This has now completely resolved on recent chest imaging. He was able to restart pembrolizumab at the same dose on April 1st 2024, with no recurrence of the pneumonitis.\n\nI am pleased to report that his most recent CT scan on May 1st 2024 shows encouraging disease stability, with no progression of the temporal bone invasion and some reduction in the enhancement pattern of the primary lesion. The previously noted level II node has reduced in size from 2.1cm to 1.4cm. He reports significant improvement in his left-sided facial pain, now requiring only occasional paracetamol compared to the regular opiates he needed at presentation.\n\nOn examination today, the visible component of the tumor appears less erythematous and has reduced in size. There is no clinical evidence of progression. His performance status remains excellent at ECOG 0. He continues to work part-time as an accountant and maintains regular exercise with daily walking.\n\nGiven the good clinical and radiological stability, and current tolerability, we plan to continue with pembrolizumab immunotherapy. I have arranged his next three cycles and will see him again in 9 weeks with repeat imaging. I have also arranged review with our head and neck surgeon [redacted name] to discuss the possibility of salvage surgery if we achieve further response. He understands to contact our team if he develops any new breathing difficulties or other concerning symptoms.",
  "output": {
    "primary_cancer": {
      "site": "skin, left temporal region",
      "year": 2024,
      "month": 1,
      "metastases": "left level II lymph node involvement, temporal bone invasion",
      "tnm_stage": "T4N1",
      "histopathology_status": "moderately to poorly differentiated squamous cell carcinoma with perineural invasion",
      "biomarker_status": "PD-L1 CPS 15",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "Initial presentation with rapidly growing tumor with temporal bone invasion and single left level II lymph node",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started pembrolizumab 200mg every 3 weeks",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Treatment paused due to grade 2 pneumonitis, started on prednisolone 40mg daily",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Resumed pembrolizumab at same dose after pneumonitis resolution",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable disease with reduced enhancement of primary lesion and lymph node reduction from 2.1cm to 1.4cm",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 0"
      },
      {
        "type": "current_symptom",
        "value": "Improved left-sided facial pain, requiring only occasional paracetamol"
      },
      {
        "type": "examination_finding",
        "value": "Visible tumor less erythematous and reduced in size, no clinical evidence of progression"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Working part-time as accountant and maintains daily walking"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Locally advanced cutaneous SCC with temporal bone invasion, showing disease stability on pembrolizumab after managing early pneumonitis complication"
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease on imaging with reduced enhancement of primary lesion and lymph node shrinkage"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Previous grade 2 pneumonitis now resolved, current treatment well tolerated"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing pembrolizumab immunotherapy at 200mg every 3 weeks"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat imaging in 9 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 9 weeks and arranged surgical review to discuss salvage surgery possibility"
      }
    ]
  }
}