{
  "content": "Diagnosis:\tMetastatic lung adenocarcinoma (subpleural right upper lobe primary)\n\nManagement:\t2023 Nov - Stereotactic radiosurgery to solitary right parietal brain metastasis\n\t\t2023 Dec - Commenced Sotorasib 960mg daily\n\nHistology:\tKRAS G12C mutant adenocarcinoma with STK11 co-mutation\n\nCurrent Situation:\tCycle 4 review Sotorasib\n\nI reviewed [redacted name] today in the thoracic oncology clinic. She continues to tolerate Sotorasib well with no significant side effects beyond mild fatigue which is manageable. Her cough has completely resolved and she reports feeling generally well with good energy levels. She has been maintaining regular swimming sessions three times weekly.\n\nHer recent MRI brain (March 15th 2024) shows continued response of the treated right parietal metastasis with no new intracranial disease. CT chest/abdomen/pelvis from last week demonstrates stable appearance of the right upper lobe primary lesion measuring 2.8cm (previously 2.9cm) with no new sites of disease.\n\nOn examination today, chest is clear with good air entry bilaterally. Neurological examination remains normal with no focal deficits.\n\nThe plan is to continue with Sotorasib at full dose with routine blood monitoring. We will arrange repeat CT and MRI brain in 3 months' time. She will be reviewed back in clinic in 6 weeks with blood results.",
  "output": {
    "primary_cancer": {
      "site": "lung, subpleural right upper lobe",
      "year": 2023,
      "metastases": "solitary right parietal brain metastasis",
      "other_stage": "Stage IV",
      "histopathology_status": "adenocarcinoma",
      "biomarker_status": "KRAS G12C mutation, STK11 co-mutation",
      "cancer_timeline": [
        {
          "type": "treatment_radiotherapy",
          "value": "Stereotactic radiosurgery to solitary right parietal brain metastasis",
          "year": 2023,
          "month": 11
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced Sotorasib 960mg daily",
          "year": 2023,
          "month": 12
        },
        {
          "type": "anatomical_finding",
          "value": "MRI brain shows continued response of the treated right parietal metastasis with no new intracranial disease",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable right upper lobe primary lesion measuring 2.8cm (previously 2.9cm) with no new sites of disease",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "mild fatigue which is manageable"
      },
      {
        "type": "quality_of_life_finding",
        "value": "maintaining regular swimming sessions three times weekly"
      },
      {
        "type": "examination_finding",
        "value": "chest clear with good air entry bilaterally"
      },
      {
        "type": "examination_finding",
        "value": "neurological examination normal with no focal deficits"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic lung adenocarcinoma with brain metastasis showing stable disease on Sotorasib. Good clinical status with resolved symptoms and maintaining activity."
      },
      {
        "type": "latest_treatment_response",
        "value": "Stable disease with primary tumor 2.8cm (previously 2.9cm) and continued response of treated brain metastasis"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Mild fatigue only on Sotorasib"
      },
      {
        "type": "update_to_treatment",
        "value": "Continue Sotorasib at full dose"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat CT and MRI brain in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in clinic in 6 weeks with blood results"
      }
    ]
  }
}