{
  "content": "Diagnosis:\tPoorly differentiated thyroid carcinoma, T4N1M1 with lung and bone metastases\n\tDiagnosed March 2024 following FNA of 6.8cm right thyroid mass\n\tMolecular profile: TP53 and TERT mutations identified\n?\n[redacted name] is a 62-year-old gentleman who has unfortunately been diagnosed with an aggressive poorly differentiated thyroid carcinoma. He initially presented to his GP in January 2024 with a rapidly enlarging right-sided neck mass and progressive dysphagia to solids. A subsequent ultrasound revealed a 6.8cm highly suspicious right thyroid mass with multiple pathological appearing cervical lymph nodes. FNA biopsy confirmed poorly differentiated thyroid carcinoma.\n?\nStaging investigations including CT neck/chest/abdomen/pelvis on 15/03/24 demonstrated the primary thyroid mass extending into the tracheal wall with multiple bilateral cervical lymph nodes. There were also multiple bilateral pulmonary metastases, the largest measuring 2.2cm, and lytic bone metastases affecting T4, T8 vertebrae and the left acetabulum. MRI spine on 20/03/24 confirmed the vertebral metastases with no evidence of cord compression. Molecular testing has identified both TP53 and TERT mutations, which are associated with more aggressive disease behavior.\n?\nHe reports worsening dysphagia requiring modification of diet to soft foods, and has lost 7kg in weight over 2 months. He describes new onset bone pain affecting his mid-back and left hip, currently requiring regular co-codamol. His performance status has declined from fully independent to ECOG PS 2 due to pain and fatigue.\n?\nIn his past medical history, he has well-controlled type 2 diabetes on metformin, and hypertension managed with amlodipine. He lives with his wife who provides good support, and has two adult children living nearby. He is an ex-smoker having quit 10 years ago with a 30 pack-year history.\n?\nOn examination today, there is a hard, fixed 7cm right thyroid mass with associated right cervical lymphadenopathy. There is mild stridor at rest. Chest examination reveals reduced breath sounds at both bases. There is tenderness over the thoracic spine and left hip.\n?\nI have discussed his case in detail with our thyroid MDT. Given the aggressive nature of his disease and presence of distant metastases, we recommend systemic therapy with the multikinase inhibitor lenvatinib. I have explained the aims of treatment, focusing on disease control and symptom improvement, as well as potential side effects including hypertension, fatigue, and diarrhea. We will also refer urgently for palliative radiotherapy to the symptomatic bone metastases.\n?\nThe plan is to admit him next week for initiation of lenvatinib under close monitoring given his stridor. I have arranged urgent referral to palliative care for optimization of pain control, and he will have a DEXA scan and dental review prior to consideration of bone-targeted therapy. We will see him again in clinic in 2 weeks with repeat thyroid function tests and biochemistry.",
  "output": {
    "primary_cancer": {
      "site": "thyroid, right",
      "year": 2024,
      "month": 3,
      "metastases": "bilateral pulmonary metastases, lytic bone metastases in T4 and T8 vertebrae and left acetabulum, bilateral cervical lymph nodes",
      "tnm_stage": "T4N1M1",
      "histopathology_status": "poorly differentiated thyroid carcinoma",
      "biomarker_status": "TP53 and TERT mutations positive",
      "cancer_timeline": [
        {
          "type": "other_progress_or_event",
          "value": "Initial presentation with rapidly enlarging right-sided neck mass and progressive dysphagia",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "Ultrasound shows 6.8cm suspicious right thyroid mass with pathological cervical lymph nodes",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "FNA biopsy confirms poorly differentiated thyroid carcinoma",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows primary thyroid mass extending into tracheal wall with bilateral pulmonary metastases and bone metastases",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "MRI spine confirms vertebral metastases with no cord compression",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular testing identifies TP53 and TERT mutations",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2 due to pain and fatigue"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes on metformin"
      },
      {
        "type": "comorbidity",
        "value": "Hypertension on amlodipine"
      },
      {
        "type": "current_symptom",
        "value": "Worsening dysphagia requiring soft food diet"
      },
      {
        "type": "current_symptom",
        "value": "Bone pain affecting mid-back and left hip requiring regular co-codamol"
      },
      {
        "type": "current_symptom",
        "value": "Mild stridor at rest"
      },
      {
        "type": "examination_finding",
        "value": "Hard, fixed 7cm right thyroid mass with right cervical lymphadenopathy"
      },
      {
        "type": "examination_finding",
        "value": "Reduced breath sounds at both bases"
      },
      {
        "type": "quality_of_life_finding",
        "value": "7kg weight loss over 2 months"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed aggressive poorly differentiated thyroid cancer with extensive metastatic disease. Symptomatic with dysphagia, stridor, and bone pain requiring urgent systemic therapy and palliative radiotherapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to start lenvatinib under inpatient monitoring"
      },
      {
        "type": "planned_investigation",
        "value": "DEXA scan and dental review planned prior to bone-targeted therapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent referral to palliative care for pain control, clinic review in 2 weeks with thyroid function and biochemistry"
      }
    ]
  }
}