{
  "content": "Diagnosis:\tFollicular variant papillary thyroid carcinoma with cervical lymph node metastases\n\nI am writing following today's Head and Neck MDT discussion regarding [redacted name], a 45-year-old lady with follicular variant papillary thyroid cancer. She initially underwent total thyroidectomy on 15 March 2024, which revealed a 2.8cm follicular variant papillary thyroid carcinoma in the right lobe with extrathyroidal extension. Molecular testing has confirmed RET/PTC rearrangement positivity.\n\nSubsequent neck ultrasound on 2 April 2024 identified suspicious right level III and IV lymph nodes, with the largest measuring 1.8cm. FNA cytology from the dominant level III node has confirmed metastatic papillary thyroid cancer. Her thyroglobulin level is currently 45 μg/L on thyroid hormone replacement.\n\nThe case was discussed in detail at today's MDT with input from surgical, nuclear medicine, and oncology teams. Given the presence of cervical nodal disease and adverse molecular profile, the consensus recommendation is for completion right neck dissection (levels II-VI) followed by radioactive iodine ablation. The surgical team will aim to schedule the neck dissection within the next 2-3 weeks.\n\nThe nuclear medicine team has recommended a treatment activity of 3.7 GBq I-131 for the ablation, to be administered 4-6 weeks post-surgery. This will require thyroid hormone withdrawal protocol rather than rhTSH stimulation given the extent of disease. A post-therapy whole body scan will be performed 5-7 days after RAI administration.\n\nThe patient will be seen in the joint thyroid clinic next week to discuss these recommendations in detail. We will arrange baseline blood tests including calcium, thyroid function, and thyroglobulin. Long-term follow-up will involve 6-monthly thyroglobulin measurements and annual neck ultrasound, with consideration of further imaging based on thyroglobulin trend.\n\nThe case will be re-discussed at MDT following completion of all planned treatment to agree ongoing surveillance protocol.",
  "output": {
    "primary_cancer": {
      "site": "thyroid, right lobe",
      "year": 2024,
      "month": 3,
      "metastases": "right level III and IV cervical lymph nodes",
      "histopathology_status": "follicular variant papillary thyroid carcinoma with extrathyroidal extension, 2.8cm",
      "biomarker_status": "RET/PTC rearrangement positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "total thyroidectomy revealing 2.8cm follicular variant papillary thyroid carcinoma with extrathyroidal extension",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "ultrasound identified suspicious right level III and IV lymph nodes, largest 1.8cm",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "FNA cytology from dominant level III node confirmed metastatic papillary thyroid cancer",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "thyroglobulin level 45 μg/L on thyroid hormone replacement",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "investigation_finding",
        "value": "thyroglobulin level 45 μg/L on thyroid hormone replacement"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Follicular variant papillary thyroid cancer with cervical nodal metastases post total thyroidectomy, requiring completion neck dissection and radioactive iodine therapy"
      },
      {
        "type": "update_to_treatment",
        "value": "MDT recommendation for completion right neck dissection (levels II-VI) followed by 3.7 GBq I-131 radioactive iodine ablation"
      },
      {
        "type": "planned_investigation",
        "value": "Baseline blood tests including calcium, thyroid function, and thyroglobulin"
      },
      {
        "type": "follow_up_referral",
        "value": "Joint thyroid clinic next week to discuss treatment plan"
      }
    ]
  }
}