{
  "content": "Diagnosis:\tHurthle cell thyroid carcinoma, initially T3N1M0\n\nI reviewed [redacted name] today following completion of his post-operative radioiodine ablation therapy. As background, he underwent total thyroidectomy with central compartment neck dissection on March 15th 2024, revealing a 4.5cm Hurthle cell carcinoma with extrathyroidal extension and 3/12 positive central compartment lymph nodes. Molecular testing showed TERT mutation negative status. He subsequently received 100mCi radioactive iodine therapy on April 20th 2024 following appropriate TSH elevation.\n\nHe has experienced significant side effects from the radioiodine treatment, including persistent sialadenitis affecting both parotid glands with associated taste disturbance and xerostomia. He reports some improvement with regular hydration and sour candies but continues to find these symptoms quite troublesome. His voice remains slightly hoarse following surgery though his calcium levels have normalized. He maintains good performance status (ECOG PS 1) and has returned to most normal activities.\n\nRecent thyroglobulin levels show appropriate suppression at <0.1 ng/mL (TSH <0.01) suggesting good response to radioiodine therapy. Post-therapy whole body scan showed only minor residual uptake in the thyroid bed with no evidence of distant metastatic disease. Neck ultrasound today shows no suspicious lymphadenopathy.\n\nGiven his excellent biochemical response and the significant side effects experienced, we have discussed transitioning from TSH suppression to a more moderate target range of 0.1-0.5 mU/L. I have therefore reduced his levothyroxine from 175mcg to 150mcg daily. We will check thyroid function tests in 6 weeks to ensure appropriate adjustment.\n\nThe plan is to continue regular surveillance with 3-monthly thyroglobulin measurements and annual neck ultrasound. I have arranged follow-up in 3 months with repeat biochemistry. I have also referred him to our specialist head and neck speech and language therapy team for ongoing management of his post-treatment symptoms.",
  "output": {
    "primary_cancer": {
      "site": "thyroid",
      "year": 2024,
      "month": 3,
      "metastases": "3/12 positive central compartment lymph nodes",
      "tnm_stage": "T3N1M0",
      "histopathology_status": "Hurthle cell carcinoma, 4.5cm with extrathyroidal extension",
      "biomarker_status": "TERT mutation negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Total thyroidectomy with central compartment neck dissection",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Radioactive iodine therapy 100mCi following TSH elevation",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Thyroglobulin <0.1 ng/mL with TSH <0.01 suggesting good response to therapy",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "Post-therapy whole body scan shows minor residual uptake in thyroid bed, no distant metastases",
          "year": 2024,
          "month": null
        },
        {
          "type": "anatomical_finding",
          "value": "Neck ultrasound shows no suspicious lymphadenopathy",
          "year": 2024,
          "month": null
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 1"
      },
      {
        "type": "current_symptom",
        "value": "Persistent sialadenitis affecting both parotid glands with taste disturbance and xerostomia"
      },
      {
        "type": "current_symptom",
        "value": "Slightly hoarse voice following surgery"
      },
      {
        "type": "investigation_finding",
        "value": "Calcium levels normalized"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Hurthle cell thyroid cancer post thyroidectomy and radioiodine ablation showing good biochemical response but experiencing significant treatment-related side effects"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Significant sialadenitis, taste disturbance and xerostomia from radioiodine therapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Levothyroxine reduced from 175mcg to 150mcg daily to achieve more moderate TSH target of 0.1-0.5 mU/L"
      },
      {
        "type": "planned_investigation",
        "value": "Thyroid function tests in 6 weeks, repeat biochemistry in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Follow-up in 3 months, referred to specialist head and neck speech and language therapy"
      }
    ]
  }
}