{
  "content": "Diagnosis:\tFollicular thyroid carcinoma, Stage IVA (T3bN1bM1), PAX8/PPARγ fusion positive\n\nInitial treatment with total thyroidectomy and central compartment neck dissection March 2023, followed by radioactive iodine therapy 150mCi in May 2023. Subsequent development of pulmonary metastases identified on follow-up imaging September 2023.\n\n[redacted name] has unfortunately shown progressive disease on lenvatinib 24mg daily which was commenced in October 2023. Recent CT imaging from 15/4/24 demonstrates enlarging pulmonary metastases with new mediastinal lymphadenopathy. The largest pulmonary nodule has increased from 2.1cm to 3.4cm, and there is a new 2.8cm right paratracheal node. Her thyroglobulin has risen from 280 to 450 over the past 8 weeks despite maintained TSH suppression.\n\nShe has experienced significant toxicity from lenvatinib including grade 3 hypertension requiring three antihypertensive medications, grade 2 palmar-plantar erythrodysesthesia, and grade 2 fatigue. Despite two dose reductions to current dose of 14mg daily, these side effects continue to impact significantly on her quality of life. Her performance status has deteriorated to ECOG 2.\n\nAfter detailed discussion at today's thyroid MDT, and in view of disease progression and challenging toxicity profile, we have agreed to discontinue lenvatinib and commence sorafenib. I have discussed this change in treatment strategy with [redacted name] and her husband today. We reviewed the side effect profile of sorafenib and management strategies. She will commence at 400mg twice daily with close monitoring of blood pressure and thyroid function.\n\nI have arranged weekly nurse-led toxicity monitoring for the first month. Thyroid function tests and thyroglobulin will be checked in 4 weeks, with CT reassessment planned for 12 weeks. We will review her in clinic in 2 weeks to ensure tolerability of the new regimen. The acute oncology team are aware of her treatment change should she develop any concerning symptoms.\n\nI have provided written information about sorafenib and management of potential side effects. [redacted name] understands to contact our team if she develops any new or worsening symptoms, particularly uncontrolled hypertension or severe skin reactions.",
  "output": {
    "primary_cancer": {
      "site": "thyroid",
      "year": 2023,
      "month": 3,
      "metastases": "pulmonary metastases, mediastinal lymphadenopathy including right paratracheal node",
      "tnm_stage": "T3bN1bM1",
      "other_stage": "Stage IVA",
      "histopathology_status": "follicular thyroid carcinoma",
      "biomarker_status": "PAX8/PPARγ fusion positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "total thyroidectomy and central compartment neck dissection",
          "year": 2023,
          "month": 3
        },
        {
          "type": "treatment_radiotherapy",
          "value": "radioactive iodine therapy 150mCi",
          "year": 2023,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "development of pulmonary metastases identified on follow-up imaging",
          "year": 2023,
          "month": 9
        },
        {
          "type": "treatment_systemic_start",
          "value": "commenced lenvatinib 24mg daily",
          "year": 2023,
          "month": 10
        },
        {
          "type": "treatment_systemic_change",
          "value": "lenvatinib dose reduced to 14mg daily due to toxicity",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows enlarging pulmonary metastases, largest nodule increased from 2.1cm to 3.4cm, new 2.8cm right paratracheal node",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "thyroglobulin risen from 280 to 450 over past 8 weeks despite maintained TSH suppression",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2"
      },
      {
        "type": "current_symptom",
        "value": "grade 3 hypertension requiring three antihypertensive medications"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 palmar-plantar erythrodysesthesia"
      },
      {
        "type": "current_symptom",
        "value": "grade 2 fatigue"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Stage IVA follicular thyroid cancer with progressive pulmonary metastases. Disease progression on lenvatinib with significant toxicity necessitating switch to sorafenib"
      },
      {
        "type": "latest_treatment_response",
        "value": "Progressive disease on lenvatinib with enlarging pulmonary metastases and new mediastinal lymphadenopathy"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Persistent grade 3 hypertension, grade 2 palmar-plantar erythrodysesthesia, and grade 2 fatigue despite dose reductions"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing lenvatinib and commencing sorafenib 400mg twice daily"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Performance status deteriorated to ECOG 2"
      },
      {
        "type": "planned_investigation",
        "value": "Thyroid function tests and thyroglobulin in 4 weeks, CT reassessment in 12 weeks"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly nurse-led toxicity monitoring and clinic review in 2 weeks"
      }
    ]
  }
}