{
  "content": "Diagnosis:\tHurthle cell thyroid carcinoma, T3N1M0, RAS mutation positive\n\nI am writing following today's Head & Neck MDT discussion regarding [redacted name], a 56-year-old gentleman with Hurthle cell thyroid carcinoma. He initially presented in January 2024 with a rapidly enlarging right-sided neck mass. Fine needle aspiration on 15/1/24 showed Bethesda VI cytology suggestive of Hurthle cell carcinoma. CT neck and thorax on 22/1/24 demonstrated a 4.8cm right thyroid mass with evidence of extrathyroidal extension and right level III-IV nodal involvement.\n\nHe underwent total thyroidectomy with right central and lateral neck dissection on 12/2/24. Histopathology confirmed a 5.2cm Hurthle cell carcinoma with minimal extrathyroidal extension and 4/18 positive lymph nodes in levels III and IV. Molecular testing has subsequently revealed RAS mutation positivity.\n\nPost-operative recovery was complicated by temporary right recurrent laryngeal nerve palsy which has now largely resolved with speech therapy input. His voice is now near baseline though he reports mild hoarseness with prolonged use. Calcium levels have normalized and he is stable on levothyroxine 125mcg daily.\n\nThe case was discussed in detail at today's MDT. Given the size, nodal involvement, and RAS mutation status, the consensus recommendation is for high-dose radioiodine ablation therapy. The proposed activity is 5.5GBq I-131, to be administered following appropriate TSH elevation through hormone withdrawal rather than rhTSH stimulation. This has been scheduled for 15/4/24.\n\nWe have also recommended early post-therapy scanning at 3-5 days post radioiodine, followed by a diagnostic whole body scan at 6-9 months. Thyroglobulin monitoring will be performed at regular intervals, with the first measurement scheduled for 6 weeks post ablation.\n\nI have discussed these recommendations with [redacted name] following the MDT. He understands the rationale for radioiodine therapy and the preparation required, including the low-iodine diet and hormone withdrawal protocol. He will be reviewed in the combined thyroid clinic next week for detailed treatment planning and written information provision.",
  "output": {
    "primary_cancer": {
      "site": "thyroid, right",
      "year": 2024,
      "month": 1,
      "metastases": "right level III-IV cervical lymph nodes",
      "tnm_stage": "T3N1M0",
      "histopathology_status": "Hurthle cell carcinoma",
      "biomarker_status": "RAS mutation positive",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "FNA shows Bethesda VI cytology suggestive of Hurthle cell carcinoma",
          "year": 2024,
          "month": 1
        },
        {
          "type": "anatomical_finding",
          "value": "CT neck/thorax shows 4.8cm right thyroid mass with extrathyroidal extension and right level III-IV nodal involvement",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "Total thyroidectomy with right central and lateral neck dissection, complicated by temporary right recurrent laryngeal nerve palsy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "Histopathology confirms 5.2cm Hurthle cell carcinoma with minimal extrathyroidal extension and 4/18 positive lymph nodes",
          "year": 2024,
          "month": 2
        },
        {
          "type": "laboratory_finding",
          "value": "Molecular testing reveals RAS mutation positivity",
          "year": 2024,
          "month": 2
        }
      ]
    },
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Mild hoarseness with prolonged voice use"
      },
      {
        "type": "investigation_finding",
        "value": "Calcium levels normalized"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed Hurthle cell thyroid cancer with nodal involvement, post-thyroidectomy with resolving complications, awaiting radioiodine therapy"
      },
      {
        "type": "update_to_treatment",
        "value": "Stable on levothyroxine 125mcg daily"
      },
      {
        "type": "planned_investigation",
        "value": "Early post-therapy scanning 3-5 days post radioiodine, diagnostic whole body scan at 6-9 months, thyroglobulin monitoring starting 6 weeks post ablation"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in combined thyroid clinic next week for radioiodine treatment planning"
      }
    ]
  }
}