{
  "content": "Diagnosis:\nHurthle cell carcinoma of thyroid\nT3N0M0 (AJCC 8th edition)\n\nPrevious treatment:\nTotal thyroidectomy - March 2024\nRadioactive iodine 100mCi - April 2024\n\nCurrent medications:\nLevothyroxine 125mcg daily\n\nCurrent situation:\nPost-treatment thyroglobulin 0.4 (previously 1.2)\nTSH well suppressed at 0.1\n\nI reviewed [redacted name] today following completion of radioactive iodine therapy. The treatment was well tolerated with only mild short-term symptoms of dry mouth and slight nausea which have now resolved. The post-treatment whole body scan showed no evidence of residual disease or metastatic uptake. Thyroglobulin levels have appropriately decreased and TSH remains well suppressed on current levothyroxine dose.\n\nGiven the excellent response to treatment and current disease status, we will now transition to surveillance phase. I have explained that this will involve regular thyroglobulin monitoring and neck ultrasound, with the first scan scheduled for 6 months' time. We have discussed the importance of maintaining TSH suppression and continuing regular levothyroxine. [redacted name] understands to contact us if any new symptoms develop, particularly any neck symptoms or unexplained bone pain.\n\nPlan for 3-monthly thyroglobulin measurements and clinic review in 6 months with ultrasound scan results.",
  "output": {
    "primary_cancer": {
      "site": "thyroid",
      "year": 2024,
      "month": 3,
      "metastases": "",
      "tnm_stage": "T3N0M0",
      "other_stage": "",
      "histopathology_status": "Hurthle cell carcinoma",
      "biomarker_status": "",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Total thyroidectomy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Radioactive iodine therapy 100mCi",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Thyroglobulin decreased to 0.4 from 1.2, TSH well suppressed at 0.1",
          "year": 2024,
          "month": 5
        },
        {
          "type": "anatomical_finding",
          "value": "Post-treatment whole body scan showed no evidence of residual disease or metastatic uptake",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "other_cancers": [],
    "patient_facts": [
      {
        "type": "current_symptom",
        "value": "Previous symptoms of dry mouth and slight nausea now resolved"
      },
      {
        "type": "investigation_finding",
        "value": "TSH well suppressed at 0.1 on levothyroxine 125mcg daily"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Thyroid cancer post thyroidectomy and radioactive iodine. Excellent treatment response with no evidence of residual disease"
      },
      {
        "type": "latest_treatment_response",
        "value": "Good biochemical response with falling thyroglobulin, no evidence of residual disease on whole body scan"
      },
      {
        "type": "update_to_treatment",
        "value": "Transitioning from active treatment to surveillance phase"
      },
      {
        "type": "planned_investigation",
        "value": "3-monthly thyroglobulin measurements and neck ultrasound in 6 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinic review in 6 months with ultrasound results"
      }
    ]
  }
}