{
  "content": "Diagnosis:\tFollicular thyroid carcinoma, T2N1M0, RET fusion negative\n\nI reviewed [redacted name] today following completion of radioactive iodine (RAI) therapy. She initially presented in January 2024 with a right-sided thyroid nodule and ipsilateral cervical lymphadenopathy. FNA confirmed follicular thyroid carcinoma, and she underwent total thyroidectomy with right-sided selective neck dissection on February 15th 2024, revealing a 3.8cm follicular thyroid carcinoma with capsular and vascular invasion, and 3/12 positive lymph nodes. Molecular testing was negative for RET fusion.\n\nShe received 150mCi RAI therapy on April 1st 2024 following appropriate TSH elevation through thyroid hormone withdrawal. The post-therapy whole body scan showed good uptake in the thyroid bed and right cervical nodes, with no evidence of distant metastatic disease. She experienced moderate radiation sialadenitis during treatment which has now largely resolved with conservative management.\n\nOn review today, she is clinically well with excellent wound healing. Her voice has returned to normal following some temporary hoarseness post-surgery. Thyroglobulin has dropped from 45 μg/L pre-RAI to 1.2 μg/L, with thyroglobulin antibodies remaining negative. TSH is appropriately suppressed at 0.08 mU/L on Levothyroxine 175mcg daily.\n\nNeck examination today shows no evidence of residual disease or lymphadenopathy. She has maintained her weight and energy levels are improving. She has returned to work part-time as a teacher and is gradually increasing her hours.\n\nThe plan is to continue TSH suppression with current Levothyroxine dose. We will arrange neck ultrasound and thyroglobulin measurement in 3 months, with clinical review thereafter. I have provided her with written information about long-term surveillance protocols and symptoms that should prompt earlier review. She understands to contact us if she develops any new concerning symptoms in the interim.\n?\n",
  "output": {
    "primary_cancer": {
      "site": "thyroid, right-sided",
      "year": 2024,
      "month": 1,
      "metastases": "ipsilateral cervical lymphadenopathy, 3/12 positive lymph nodes",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "follicular thyroid carcinoma with capsular and vascular invasion",
      "biomarker_status": "RET fusion negative",
      "cancer_timeline": [
        {
          "type": "laboratory_finding",
          "value": "FNA confirmed follicular thyroid carcinoma",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_surgery",
          "value": "total thyroidectomy with right-sided selective neck dissection, revealing 3.8cm follicular thyroid carcinoma with 3/12 positive lymph nodes",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_radiotherapy",
          "value": "150mCi radioactive iodine therapy with good uptake in thyroid bed and right cervical nodes",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Thyroglobulin dropped from 45 μg/L pre-RAI to 1.2 μg/L, thyroglobulin antibodies negative",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "No evidence of residual disease or lymphadenopathy on neck examination"
      },
      {
        "type": "investigation_finding",
        "value": "TSH appropriately suppressed at 0.08 mU/L on Levothyroxine 175mcg daily"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Returned to work part-time as a teacher and gradually increasing hours"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Follicular thyroid carcinoma treated with surgery and RAI showing good biochemical response. Post-treatment review shows no evidence of residual disease"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Moderate radiation sialadenitis during RAI now largely resolved"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing TSH suppression with Levothyroxine 175mcg daily"
      },
      {
        "type": "planned_investigation",
        "value": "Neck ultrasound and thyroglobulin measurement in 3 months"
      },
      {
        "type": "follow_up_referral",
        "value": "Clinical review following investigations in 3 months"
      }
    ]
  }
}