{
  "content": "Diagnosis:\t\tMetastatic transverse colon adenocarcinoma with signet ring features\n\nStaging:\t\tT4N2M1 with peritoneal and hepatic disease\n\nMolecular:\t\tNTRK2-STRN fusion positive\n\nTreatment:\t\tCycle 4 FOLFIRI completed 15/4/24\n\t\tPrevious right hemicolectomy 12/1/24\n\nCurrent Status:\tClinical and radiological disease progression\n\n[redacted name] has unfortunately shown clear evidence of disease progression on current treatment. CT performed on 22/4/24 shows 30% increase in peritoneal disease volume with new ascites. Her performance status has declined to ECOG 2 from previous ECOG 1, with increasing abdominal pain requiring regular breakthrough analgesia. She has developed early bowel obstruction symptoms with intermittent vomiting.\n\nGiven the presence of NTRK fusion, we have discussed switching treatment to Entrectinib. I have explained the mechanism of action and potential side effects. We will arrange urgent drain of ascites next week before commencing the new treatment. Blood tests today show deteriorating liver function with bilirubin 45 and ALT 156. I have prescribed additional antiemetics and arranged district nurse support for symptom management.\n\nPlan is to start Entrectinib 600mg daily once ascitic drain complete. We will review in one week with repeat bloods and clinical assessment.",
  "output": {
    "primary_cancer": {
      "site": "transverse colon",
      "year": 2024,
      "month": 1,
      "metastases": "peritoneal and hepatic disease",
      "tnm_stage": "T4N2M1",
      "histopathology_status": "adenocarcinoma with signet ring features",
      "biomarker_status": "NTRK2-STRN fusion positive",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "right hemicolectomy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started on FOLFIRI chemotherapy",
          "year": 2024,
          "month": null
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed cycle 4 FOLFIRI",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows 30% increase in peritoneal disease volume with new ascites",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Deteriorating liver function with bilirubin 45 and ALT 156",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 2, declined from previous ECOG 1"
      },
      {
        "type": "current_symptom",
        "value": "Increasing abdominal pain requiring regular breakthrough analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early bowel obstruction symptoms with intermittent vomiting"
      },
      {
        "type": "investigation_finding",
        "value": "Deteriorating liver function with bilirubin 45 and ALT 156"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic colon cancer showing disease progression on FOLFIRI with declining performance status. Planning switch to targeted therapy based on NTRK fusion"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with 30% increase in peritoneal disease and new ascites"
      },
      {
        "type": "update_to_treatment",
        "value": "Discontinuing FOLFIRI, planning to start Entrectinib 600mg daily after ascitic drain"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Deterioration in performance status from ECOG 1 to ECOG 2"
      },
      {
        "type": "planned_investigation",
        "value": "Review in one week with repeat bloods"
      }
    ]
  }
}