{
  "content": "Diagnosis\n\t1. Extensive stage small cell lung cancer with liver, bone, and adrenal metastases\n\n\tDate of diagnosis\n\tApril 2024\n\n\tTreatment aim\n\tPalliative\n\n\tSummary of completed treatment and relevant dates\n\n\tSurgery\n\t12 Apr 2024 Liver biopsy\n\n\tRadiotherapy\n\tNot yet commenced\n\n\tChemotherapy\n\tNot yet commenced\n\n\tClinical studies\n\tNot eligible\n\n\tCurrent disease status\n\tNewly diagnosed extensive stage disease\n\n\tCurrent issues\n\tSevere fatigue, dyspnoea, right upper quadrant pain, weight loss\n\n\tSummary of consultation\n\tThis 64 year old gentleman presented following a 6-week history of progressive breathlessnes, right upper quadrant pain, and significant weight loss of 12kg. Initial CT thorax/abdomen/pelvis on 5/4/24 demonstrated a 7.2cm right hilar mass with mediastinal lymphadenopathy, multiple liver metastases (largest 6.5cm), bilateral adrenal masses, and widespread bone metastases including thoracic spine. Liver biopsy on 12/4/24 confirmed small cell carcinoma, with positive staining for Synaptophysin and CD56.\n\nHe has significant comorbidities including poorly controlled type 2 diabetes (latest HbA1c 86), chronic kidney disease stage 3b (eGFR 32), and previous myocardial infarction in 2020 with residual left ventricular dysfunction (EF 42%). His performance status has deteriorated from 1 to 3 over the past month, now spending approximately 70% of the day in bed or chair.\n\nOn examination today, he appears cachectic with marked muscle wasting. Oxygen saturations 92% on room air. There is dullness to percussion and reduced breath sounds in the right lung base. The liver edge is palpable 4cm below the costal margin and tender. No focal neurological deficits.\n\nI have discussed his diagnosis and poor prognosis at length with him and his wife today. Given his extensive disease, poor performance status, and significant comorbidities, standard platinum-etoposide chemotherapy carries substantial risks. However, without treatment his prognosis is likely to be measured in weeks.\n\n\tFurther investigations\n\tUrgent MRI brain to exclude CNS metastases\n\tCardiac MUGA scan to reassess left ventricular function\n\n\tMedication prescribed\n\tDexamethasone 4mg bd\n\tOxycodone MR 10mg bd\n\tMetoclopramide 10mg tds prn\n\n\tFollow up\n\tUrgent review in lung oncology clinic next week with investigation results\n\n\tRequired GP actions\n\tPlease monitor blood glucose given steroid commencement\n\tPlease refer to district nurses for support\n\n\tSummary of information given to patient\n\tDiagnosis of extensive stage small cell lung cancer explained\n\tPoor prognosis discussed\n\tRisks and benefits of palliative chemotherapy outlined",
  "output": {
    "primary_cancer": {
      "site": "lung, right hilar",
      "year": 2024,
      "month": 4,
      "metastases": "multiple liver metastases, bilateral adrenal masses, widespread bone metastases including thoracic spine",
      "other_stage": "Extensive stage",
      "histopathology_status": "small cell carcinoma",
      "biomarker_status": "Synaptophysin and CD56 positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT thorax/abdomen/pelvis shows 7.2cm right hilar mass with mediastinal lymphadenopathy, multiple liver metastases (largest 6.5cm), bilateral adrenal masses, and widespread bone metastases",
          "year": 2024,
          "month": 4
        },
        {
          "type": "laboratory_finding",
          "value": "Liver biopsy confirms small cell carcinoma, positive for Synaptophysin and CD56",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 3, spending 70% of day in bed or chair"
      },
      {
        "type": "comorbidity",
        "value": "Type 2 diabetes poorly controlled with HbA1c 86"
      },
      {
        "type": "comorbidity",
        "value": "Chronic kidney disease stage 3b with eGFR 32"
      },
      {
        "type": "comorbidity",
        "value": "Previous myocardial infarction 2020 with left ventricular dysfunction EF 42%"
      },
      {
        "type": "current_symptom",
        "value": "Progressive breathlessness"
      },
      {
        "type": "current_symptom",
        "value": "Right upper quadrant pain"
      },
      {
        "type": "current_symptom",
        "value": "Weight loss of 12kg over 6 weeks"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with muscle wasting, oxygen saturations 92%, reduced right base breath sounds, liver edge palpable 4cm and tender"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Newly diagnosed extensive stage small cell lung cancer with widespread metastases. Poor performance status and multiple comorbidities complicating treatment options"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Performance status deteriorated from 1 to 3 over past month"
      },
      {
        "type": "update_to_treatment",
        "value": "Starting dexamethasone 4mg bd and oxycodone MR 10mg bd"
      },
      {
        "type": "planned_investigation",
        "value": "Urgent MRI brain and cardiac MUGA scan"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent review in lung oncology clinic next week with investigation results"
      }
    ]
  }
}