{
  "content": "I reviewed [redacted name] today who attended with her husband and daughter. Unfortunately, she has experienced significant deterioration since our last review three weeks ago. Her metastatic signet ring adenocarcinoma, which was diagnosed in January 2024, has shown progressive disease despite two lines of systemic therapy.\n\nShe initially responded well to FOLFOX chemotherapy but developed disease progression after four cycles, confirmed on CT imaging in March 2024. Following molecular testing showing BRAF wild-type status, she commenced second-line FOLFIRI with Bevacizumab. Unfortunately, she experienced considerable toxicity including grade 3 diarrhea requiring hospital admission, and repeat imaging last week has shown further disease progression with new bone metastases in the thoracic spine and right hip, as well as the development of two small brain metastases in the right frontal and left parietal regions.\n\nHer symptoms have worsened significantly over the past two weeks. She now spends most of the day in bed or resting in a chair (WHO Performance Status 3), and requires assistance with most activities of daily living. She describes increasing pain in her back and right hip, despite recent increases in her opiate medications. She has also developed intermittent confusion and word-finding difficulties, which may be related to the newly identified brain metastases.\n\nOn examination today, she appears notably more frail than during our last review. She is tender over the thoracic spine and right hip. Neurological examination shows mild word-finding difficulty but no focal deficits. Her husband reports she has eaten very little over the past week and has lost approximately 4kg in weight.\n\nI have had a lengthy discussion with [redacted name] and her family about the current situation. Given her declining performance status and disease progression on two lines of therapy, I have explained that further systemic anti-cancer treatment would carry significant risks with little likelihood of benefit. We have agreed to focus on symptom management and quality of life.\n\nI have made the following arrangements today:\n1. Urgent referral to our palliative care team for review of pain control and other symptoms\n2. Referral for urgent radiotherapy to symptomatic bone metastases\n3. Neurosurgical review regarding management options for brain metastases\n4. District nurse referral for support at home\n5. Increased care package to provide additional support\n\nWe will maintain close follow-up through our palliative care colleagues, who will see her at home later this week. I have provided my direct contact details to the family and emphasized they can contact us at any time if they have concerns. I will review her again next week in our supportive care clinic.",
  "output": {
    "primary_cancer": {
      "site": "unknown primary",
      "year": 2024,
      "month": 1,
      "metastases": "bone metastases in thoracic spine and right hip, brain metastases in right frontal and left parietal regions",
      "histopathology_status": "signet ring adenocarcinoma",
      "biomarker_status": "BRAF wild-type",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line FOLFOX chemotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Disease progression after 4 cycles of FOLFOX confirmed on CT imaging",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_start",
          "value": "Commenced second-line FOLFIRI with Bevacizumab",
          "year": 2024,
          "month": 3
        },
        {
          "type": "treatment_systemic_change",
          "value": "Experienced grade 3 diarrhea requiring hospital admission during FOLFIRI/Bevacizumab",
          "year": 2024,
          "month": 4
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows new bone metastases in thoracic spine and right hip, plus two brain metastases",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "WHO Performance Status 3, spends most of day in bed or chair"
      },
      {
        "type": "current_symptom",
        "value": "Increasing pain in back and right hip"
      },
      {
        "type": "current_symptom",
        "value": "Intermittent confusion and word-finding difficulties"
      },
      {
        "type": "examination_finding",
        "value": "Tender over thoracic spine and right hip, mild word-finding difficulty but no focal neurological deficits"
      },
      {
        "type": "quality_of_life_finding",
        "value": "Requires assistance with most activities of daily living"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic signet ring adenocarcinoma with progressive disease despite two lines of therapy. Significant clinical deterioration with new bone and brain metastases"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression on second-line FOLFIRI/Bevacizumab with new metastases"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 3 diarrhea requiring hospital admission during FOLFIRI/Bevacizumab"
      },
      {
        "type": "update_to_treatment",
        "value": "Decision to discontinue systemic therapy due to poor performance status and disease progression"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Significant deterioration in performance status, now PS 3 with 4kg weight loss in past week"
      },
      {
        "type": "planned_investigation",
        "value": "Neurosurgical review regarding management options for brain metastases"
      },
      {
        "type": "follow_up_referral",
        "value": "Urgent palliative care team referral, district nurse referral, review next week in supportive care clinic"
      }
    ]
  }
}