{
  "content": "Diagnosis:\tMetastatic clear cell carcinoma of unknown primary\n\nManagement:\t15 Jan 2024 Commenced pembrolizumab monotherapy\n\t\t12 Feb 2024 Cycle 2 pembrolizumab with grade 2 pneumonitis\n\t\t15 Mar 2024 Cycle 3 delayed due to pneumonitis\n\nHistology:\tClear cell carcinoma with extensive lymphovascular invasion\n\t\tPD-L1 TPS 90%\n\nCurrent Situation:\tReview following admission with pneumonitis\n\nI reviewed [redacted name] today following their recent admission to [redacted name] Hospital with immunotherapy-related pneumonitis. They were admitted on 10 March 2024 with progressive breathlessness and dry cough. CT chest showed new bilateral ground glass changes consistent with grade 2 pneumonitis. They received oral prednisolone 1mg/kg with good symptomatic improvement and were discharged after 5 days.\n\nTheir disease-related symptoms have shown mixed response to immunotherapy. The cervical lymphadenopathy has reduced significantly on clinical examination, and they report improvement in their energy levels. However, they continue to experience right-sided chest pain requiring regular opioid analgesia, and have lost a further 2kg since last review (now 64kg from baseline 72kg).\n\nBlood tests show stable renal function, mild transaminitis (ALT 82, AST 65), and normal thyroid function. CRP has improved from 86 to 24. Their performance status remains 2 due to ongoing breathlessness.\n\nGiven the grade 2 pneumonitis, we will continue to hold immunotherapy while completing the steroid taper. Current dose is prednisolone 40mg daily, reducing by 10mg weekly. They will require pneumocystis prophylaxis while on steroids. We have arranged weekly clinical review and repeat CT chest in 3 weeks to assess resolution of pneumonitis. If imaging shows improvement and they remain clinically stable, we will consider restarting pembrolizumab at a reduced dose.\n\nI have provided written information about steroid side effects and warning symptoms that would require urgent review. They will be monitored through our immunotherapy toxicity service and have direct access to the acute oncology team if needed.",
  "output": {
    "primary_cancer": {
      "site": "unknown primary",
      "year": 2024,
      "metastases": "widespread lymph nodes including cervical nodes",
      "histopathology_status": "clear cell carcinoma with extensive lymphovascular invasion",
      "biomarker_status": "PD-L1 TPS 90%",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Commenced pembrolizumab monotherapy",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cycle 2 pembrolizumab administered with grade 2 pneumonitis developing",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Cycle 3 pembrolizumab delayed due to pneumonitis",
          "year": 2024,
          "month": 3
        },
        {
          "type": "other_progress_or_event",
          "value": "Admitted with immunotherapy-related pneumonitis requiring oral prednisolone",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 2 due to ongoing breathlessness"
      },
      {
        "type": "current_symptom",
        "value": "Right-sided chest pain requiring regular opioid analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Progressive breathlessness and dry cough"
      },
      {
        "type": "investigation_finding",
        "value": "CT chest shows bilateral ground glass changes consistent with pneumonitis"
      },
      {
        "type": "investigation_finding",
        "value": "Blood tests show stable renal function, ALT 82, AST 65, normal thyroid function, CRP improved from 86 to 24"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic clear cell carcinoma of unknown primary on pembrolizumab, currently held due to grade 2 pneumonitis. Mixed treatment response with reducing lymphadenopathy but ongoing symptoms."
      },
      {
        "type": "latest_treatment_response",
        "value": "Mixed response with reduction in cervical lymphadenopathy and improved energy, but ongoing chest pain and weight loss"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 pneumonitis requiring hospital admission and oral prednisolone"
      },
      {
        "type": "update_to_treatment",
        "value": "Immunotherapy held while completing prednisolone taper, currently 40mg daily reducing by 10mg weekly"
      },
      {
        "type": "planned_investigation",
        "value": "Repeat CT chest in 3 weeks to assess resolution of pneumonitis"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly clinical review and monitoring through immunotherapy toxicity service"
      }
    ]
  }
}