{
  "content": "Diagnosis:\tHigh grade neuroendocrine carcinoma of right ureter\n\nManagement:\t12 Mar 2024 Right nephroureterectomy with lymph node dissection\n\nHistology:\tpT3N1M0 high grade neuroendocrine carcinoma with lymphovascular invasion and positive margins. 3/8 regional lymph nodes positive. ARID1A mutation detected.\n\nCurrent Situation:\tPost-operative assessment for adjuvant therapy planning\n\nI reviewed [redacted name] today following his recent right nephroureterectomy for a high-grade neuroendocrine carcinoma of the ureter. The diagnosis was made following investigation of intermittent frank haematuria over the preceding 6 months. Initial CT urogram in February 2024 demonstrated a 4.8cm mass in the proximal right ureter with associated hydronephrosis and regional lymphadenopathy. Following MDT discussion, he proceeded to surgery on 12th March 2024.\n\nThe histology has confirmed an aggressive high-grade neuroendocrine carcinoma with concerning features including lymphovascular invasion, positive margins, and lymph node involvement. Molecular profiling has identified an ARID1A mutation. Post-operative staging CT on 2nd April shows no evidence of distant metastatic disease but suggests residual regional lymphadenopathy.\n\nOn review today, he reports ongoing post-operative pain requiring regular analgesia, and has lost approximately 5kg since surgery. His performance status is currently 2, largely due to post-operative recovery. He describes early satiety and occasional nausea but no vomiting. On examination, his surgical wounds are healing well but he appears cachectic with evidence of muscle wasting.\n\nGiven the high-risk features, I have recommended adjuvant platinum-based chemotherapy with etoposide. We discussed the specific risks and benefits of this regimen in detail, including the increased risk of neutropenic sepsis given his post-operative state. I have arranged baseline investigations including cardiac echo, pulmonary function tests, and audiology assessment prior to chemotherapy initiation.\n\nThe plan is to commence carboplatin and etoposide once he has adequately recovered from surgery, likely in 2-3 weeks time. I have arranged weekly blood tests and will see him again in clinic next week to review his progress. I have also referred him to our dietetic team for nutritional support and our physiotherapy colleagues for rehabilitation support.",
  "output": {
    "primary_cancer": {
      "site": "right ureter",
      "year": 2024,
      "month": 2,
      "metastases": "regional lymph node involvement, 3/8 nodes positive",
      "tnm_stage": "pT3N1M0",
      "other_stage": "Stage IIIA",
      "histopathology_status": "high grade neuroendocrine carcinoma with lymphovascular invasion and positive margins",
      "biomarker_status": "ARID1A mutation positive",
      "cancer_timeline": [
        {
          "type": "anatomical_finding",
          "value": "CT urogram shows 4.8cm mass in proximal right ureter with hydronephrosis and regional lymphadenopathy",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_surgery",
          "value": "Right nephroureterectomy with lymph node dissection",
          "year": 2024,
          "month": 3
        },
        {
          "type": "laboratory_finding",
          "value": "Histology confirms high grade neuroendocrine carcinoma, 3/8 nodes positive, positive margins",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "Post-operative CT shows no distant metastases but residual regional lymphadenopathy",
          "year": 2024,
          "month": 4
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "PS 2 due to post-operative recovery"
      },
      {
        "type": "current_symptom",
        "value": "Ongoing post-operative pain requiring regular analgesia"
      },
      {
        "type": "current_symptom",
        "value": "Early satiety and occasional nausea without vomiting"
      },
      {
        "type": "examination_finding",
        "value": "Cachectic with muscle wasting, surgical wounds healing well"
      },
      {
        "type": "quality_of_life_finding",
        "value": "5kg weight loss since surgery"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Recently diagnosed high grade ureteric neuroendocrine carcinoma with positive margins and nodal involvement post-surgery. Currently recovering from surgery with deteriorating nutritional status."
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence adjuvant carboplatin and etoposide once recovered from surgery"
      },
      {
        "type": "planned_investigation",
        "value": "Arranged cardiac echo, pulmonary function tests, and audiology assessment prior to chemotherapy"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly blood tests and clinic review next week, referred to dietetics and physiotherapy"
      }
    ]
  }
}