{
  "content": "Diagnosis:\tNeuroendocrine carcinoma of right ureter, diagnosed March 2024\n\nStage:\t\tT4N1M1 (Stage IV) with liver and lung metastases\n\nBiomarkers:\tTROP2 high expression (80%)\n\n[redacted name] has been receiving first-line carboplatin/etoposide chemotherapy, having completed 4 cycles. Recent CT imaging on 15/5/24 shows stable disease in the primary tumor but unfortunately new small liver lesions have appeared, suggesting disease progression. The previously noted lung nodules remain stable.\n\nShe has tolerated treatment reasonably well with grade 1 fatigue and occasional nausea, maintaining ECOG PS 1. Blood parameters remain satisfactory with stable renal function.\n\nGiven the progression on first-line platinum-based therapy, we have discussed second-line treatment options. Based on the high TROP2 expression, I have recommended commencing sacituzumab govitecan. We have discussed the side effect profile including risks of neutropenia and diarrhea. [redacted name] understands the treatment schedule and monitoring requirements.\n\nThe plan is to commence sacituzumab govitecan next week. We will arrange CT reassessment after 3 cycles. I will review her again in 2 weeks' time with blood tests.",
  "output": {
    "primary_cancer": {
      "site": "ureter, right",
      "year": 2024,
      "month": 3,
      "metastases": "liver and lung metastases",
      "tnm_stage": "T4N1M1",
      "other_stage": "Stage IV",
      "histopathology_status": "neuroendocrine carcinoma",
      "biomarker_status": "TROP2 high expression (80%)",
      "cancer_timeline": [
        {
          "type": "treatment_systemic_start",
          "value": "Started first-line carboplatin/etoposide chemotherapy",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT shows stable primary tumor but new small liver lesions, stable lung nodules",
          "year": 2024,
          "month": 5
        },
        {
          "type": "treatment_systemic_change",
          "value": "Stopping carboplatin/etoposide due to disease progression",
          "year": 2024,
          "month": 5
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "ECOG PS 1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 1 fatigue and occasional nausea"
      },
      {
        "type": "investigation_finding",
        "value": "Blood parameters satisfactory with stable renal function"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Metastatic ureteral neuroendocrine carcinoma with progression on first-line chemotherapy. Changing to second-line sacituzumab govitecan based on high TROP2 expression"
      },
      {
        "type": "latest_treatment_response",
        "value": "Disease progression with new liver lesions despite stable primary tumor and lung nodules"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 1 fatigue and occasional nausea from carboplatin/etoposide"
      },
      {
        "type": "update_to_treatment",
        "value": "Plan to commence sacituzumab govitecan"
      },
      {
        "type": "planned_investigation",
        "value": "CT reassessment after 3 cycles of sacituzumab govitecan"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in 2 weeks with blood tests"
      }
    ]
  }
}