{
  "content": "Diagnosis:\tVulvar squamous cell carcinoma, T2N1M0\n\nManagement:\t15 Jan 2024 Wide local excision and bilateral inguinal node dissection\n\t\t12 Feb - 20 Mar 2024 Adjuvant chemoradiotherapy\n\nHistology:\tModerately differentiated invasive squamous cell carcinoma\n\t\tp16 negative\n\t\t3/12 right inguinal nodes positive\n\t\tLymphovascular invasion present\n\nCurrent Situation:\tPost-treatment assessment\n\nI reviewed [redacted name] today following completion of adjuvant chemoradiotherapy. The case was discussed at yesterday's gynecological oncology MDT with input from surgical, radiation and medical oncology teams. The patient has completed 25 fractions of external beam radiotherapy to the vulva and bilateral groins with concurrent weekly cisplatin. She experienced grade 2 radiation dermatitis and grade 1 fatigue but completed treatment without delays. Recent examination shows good healing of the surgical site with expected post-radiation changes. No concerning features were identified on clinical examination today.\n\nThe MDT reviewed the recent CT chest/abdomen/pelvis performed on 25 March 2024 which shows no evidence of residual or metastatic disease. Blood tests show stable renal function with recovery of the temporary cisplatin-related decline in GFR.\n\nThe MDT recommendations are for clinical follow-up every 3 months for the first two years with examination under anesthesia if required based on symptoms or clinical findings. The next CT scan will be scheduled for 6 months' time. I have explained these recommendations to [redacted name] who understands the follow-up plan. She has been provided with contact details for the CNS team and advised about potential late effects of treatment.\n\nWe will see her in the combined gynecology oncology clinic in 6 weeks' time for her first formal post-treatment assessment.",
  "output": {
    "primary_cancer": {
      "site": "vulva",
      "year": 2024,
      "month": 1,
      "metastases": "3/12 right inguinal nodes positive",
      "tnm_stage": "T2N1M0",
      "histopathology_status": "Moderately differentiated invasive squamous cell carcinoma, lymphovascular invasion present",
      "biomarker_status": "p16 negative",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision and bilateral inguinal node dissection",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started concurrent chemoradiotherapy with weekly cisplatin",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_radiotherapy",
          "value": "25 fractions of external beam radiotherapy to vulva and bilateral groins",
          "year": 2024,
          "month": 2
        },
        {
          "type": "treatment_systemic_change",
          "value": "Completed chemoradiotherapy course",
          "year": 2024,
          "month": 3
        },
        {
          "type": "anatomical_finding",
          "value": "CT chest/abdomen/pelvis shows no evidence of residual or metastatic disease",
          "year": 2024,
          "month": 3
        }
      ]
    },
    "patient_facts": [
      {
        "type": "examination_finding",
        "value": "Good healing of surgical site with expected post-radiation changes, no concerning features"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal function with recovery of temporary cisplatin-related GFR decline"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "T2N1M0 vulvar SCC treated with surgery and adjuvant chemoradiotherapy. Now completed treatment with good response and no evidence of residual disease"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 radiation dermatitis and grade 1 fatigue during chemoradiotherapy"
      },
      {
        "type": "planned_investigation",
        "value": "CT scan scheduled for 6 months' time"
      },
      {
        "type": "follow_up_referral",
        "value": "Review in combined gynecology oncology clinic in 6 weeks for first formal post-treatment assessment, then 3-monthly follow-up for first two years"
      }
    ]
  }
}