{
  "content": "Diagnosis:\tVulvar basal cell carcinoma\n\nManagement:\t15 Jan 2024 Wide local excision with bilateral inguinal node sampling\n\t\t12 Feb 2024 Started adjuvant radiotherapy\n\nHistology:\tpT1N0M0 basal cell carcinoma with clear margins (>5mm). 0/6 right and 0/5 left inguinal nodes involved.\n\nCurrent Situation:\tWeek 4 of adjuvant radiotherapy\n\nI reviewed [redacted name] today during her radiotherapy treatment course. She is managing relatively well overall but experiencing increasing local symptoms. The main issues are grade 2 radiation dermatitis affecting the vulvar and bilateral groin regions, requiring regular analgesia and careful skin care. She describes moderate pain and discomfort, particularly towards the end of each day, which is partially controlled with regular paracetamol and occasional tramadol. Despite these challenges, she remains motivated to complete the full course of treatment.\n\nOn examination today, there is confluent erythema with patchy moist desquamation of the vulvar region and bilateral groins, consistent with expected radiation changes at this stage. No evidence of infection. The surgical sites remain well-healed with no concerning features.\n\nHer performance status remains 1, though she is finding daily activities more challenging due to local discomfort. She continues to maintain good oral intake and stable weight. Blood tests today show stable renal function and no concerning features.\n\nThe plan is to continue with radiotherapy as scheduled. I have prescribed additional analgesic medications and arranged for our specialist radiotherapy nurse to review her skin care regime. She will be reviewed again next week, and we have given clear instructions about contacting the team if symptoms worsen. A follow-up appointment will be arranged for 6 weeks after completion of radiotherapy.",
  "output": {
    "primary_cancer": {
      "site": "vulva",
      "year": 2024,
      "month": 1,
      "metastases": "no nodal involvement confirmed on sampling",
      "tnm_stage": "pT1N0M0",
      "histopathology_status": "basal cell carcinoma with clear margins (>5mm)",
      "cancer_timeline": [
        {
          "type": "treatment_surgery",
          "value": "Wide local excision with bilateral inguinal node sampling",
          "year": 2024,
          "month": 1
        },
        {
          "type": "laboratory_finding",
          "value": "0/6 right and 0/5 left inguinal nodes involved",
          "year": 2024,
          "month": 1
        },
        {
          "type": "treatment_systemic_start",
          "value": "Started adjuvant radiotherapy",
          "year": 2024,
          "month": 2
        }
      ]
    },
    "patient_facts": [
      {
        "type": "performance_status",
        "value": "Performance status 1"
      },
      {
        "type": "current_symptom",
        "value": "Grade 2 radiation dermatitis affecting vulvar and bilateral groin regions"
      },
      {
        "type": "current_symptom",
        "value": "Moderate pain and discomfort, partially controlled with regular paracetamol and occasional tramadol"
      },
      {
        "type": "examination_finding",
        "value": "Confluent erythema with patchy moist desquamation of vulvar region and bilateral groins"
      },
      {
        "type": "examination_finding",
        "value": "Surgical sites well-healed with no concerning features"
      },
      {
        "type": "investigation_finding",
        "value": "Stable renal function with no concerning features on blood tests"
      }
    ],
    "status_updates": [
      {
        "type": "clinical_summary",
        "value": "Early stage vulvar BCC post surgery, currently week 4 of adjuvant radiotherapy. Managing treatment with expected grade 2 radiation dermatitis requiring supportive care"
      },
      {
        "type": "latest_treatment_toxicity",
        "value": "Grade 2 radiation dermatitis requiring regular analgesia and skin care"
      },
      {
        "type": "update_to_treatment",
        "value": "Continuing with planned radiotherapy course with additional analgesic support"
      },
      {
        "type": "updated_patient_functional_status",
        "value": "Finding daily activities more challenging due to local discomfort but maintaining good oral intake and stable weight"
      },
      {
        "type": "follow_up_referral",
        "value": "Weekly review during radiotherapy, follow-up appointment 6 weeks after completion"
      }
    ]
  }
}